{
  "id": "lesson-04",
  "title": "Aula 4: História, Engines e Mercado",
  "objective": "Relacionar evolução tecnológica, engines e estratégias de mercado para contextualizar decisões atuais de desenvolvimento.",
  "content": [
    {
      "type": "lessonPlan",
      "title": "Plano da Aula",
      "cards": [
        {
          "icon": "book-open",
          "title": "CONTEÚDO",
          "content": "Linha do tempo histórica, panorama das engines e análise de mercado. Analisaremos a evolução do hardware/software, o surgimento das engines e como isso moldou os modelos de negócio, com foco também no impacto cultural e na relação entre tecnologia e experiência do jogador."
        },
        {
          "icon": "bullseye",
          "title": "OBJETIVO",
          "content": "Analisar a evolução histórica dos jogos e das ferramentas de desenvolvimento, conectando-a com as dinâmicas de mercado atuais."
        },
        {
          "icon": "gears",
          "title": "METODOLOGIA",
          "content": "Análise crítica histórica com linha do tempo interativa, estudo de caso e debate em grupo para conectar tecnologia, design e mercado."
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "Do Pong ao Metaverso: Uma Jornada Tecnológica e Cultural",
      "content": [
        {
          "type": "paragraph",
          "text": "A história dos jogos digitais é uma fascinante crônica da evolução tecnológica e da criatividade humana. O que começou com simples pontos de luz em uma tela se transformou em mundos virtuais complexos que conectam milhões de pessoas. Entender essa trajetória não é apenas uma curiosidade histórica; é fundamental para qualquer desenvolvedor que deseja criar o futuro desta indústria."
        },
        {
          "type": "paragraph",
          "text": "Mais do que tecnologia, a história dos jogos reflete <strong>movimentos culturais e sociais</strong>: do Atari levando o entretenimento eletrônico para as casas na década de 80, ao PlayStation criando uma nova geração de jogadores, até o mobile que democratizou o acesso e mudou a forma como consumimos experiências digitais."
        },
        {
          "type": "callout",
          "variant": "info",
          "title": "Conexão: História + Ferramenta + Mercado",
          "content": "Nesta aula, vamos conectar três pilares: como a <strong>evolução do hardware</strong> (História) permitiu o surgimento de <strong>ferramentas mais poderosas</strong> (Engines), que por sua vez moldaram os <strong>modelos de negócio</strong> (Mercado) que conhecemos hoje."
        },
        {
          "type": "paragraph",
          "text": "Compreender o passado não é apenas conhecer datas: é entender como as escolhas tecnológicas moldaram gêneros, estilos e modelos de negócio que usamos até hoje."
        }
      ]
    },
    {
      "type": "timeline",
      "title": "⏳ Linha do Tempo da Evolução dos Jogos",
      "steps": [
        {
          "title": "Década de 70: O Big Bang dos Arcades",
          "content": "<strong>Hardware/Software:</strong> Circuitos lógicos dedicados.<br><strong>Engines:</strong> Inexistentes; jogos programados diretamente no hardware.<br><p class=\"text-sm text-slate-500 italic\">Culturalmente, os arcades criaram os primeiros espaços de socialização em torno dos jogos, formando a base da cultura gamer.</p>"
        },
        {
          "title": "Década de 80: A Era de Ouro e a Crise",
          "content": "<strong>Hardware/Software:</strong> Consoles como Atari 2600 e NES.<br><strong>Engines:</strong> Surgem os primeiros motores proprietários e reutilizáveis dentro dos estúdios (ex: Nintendo, Sega)."
        },
        {
          "title": "Década de 90: A Revolução 3D",
          "content": "<strong>Hardware/Software:</strong> PlayStation, N64 e placas de vídeo para PC.<br><strong>Engines:</strong> Motores 3D como a id Tech (DOOM) e RenderWare (GTA III) são licenciados para outros estúdios."
        },
        {
          "title": "Década de 2000: A Conexão Online",
          "content": "<strong>Hardware/Software:</strong> Banda larga, Xbox Live.<br><strong>Engines:</strong> Unreal Engine 2 e 3 se tornam padrão para AAA. Source Engine (Half-Life 2) fomenta a cultura de mods."
        },
        {
          "title": "Década de 2010: A Explosão Indie e Mobile",
          "content": "<strong>Hardware/Software:</strong> Smartphones, lojas digitais.<br><strong>Engines:</strong> Unity democratiza o desenvolvimento, tornando-se a principal ferramenta para indies e mobile. Godot surge como alternativa open-source."
        },
        {
          "title": "Década de 2020+: GaaS e Novas Realidades",
          "content": "<strong>Hardware/Software:</strong> Cloud Gaming, óculos de VR/AR.<br><strong>Engines:</strong> Foco em \"Jogos como Serviço\" (GaaS) e integração de IA Generativa. A linha entre engine de jogo e ferramenta de criação de conteúdo se torna tênue."
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "🎮 Impacto Cultural e Social dos Jogos",
      "content": [
        {
          "type": "paragraph",
          "text": "A evolução dos jogos digitais não apenas acompanhou a tecnologia, mas também <strong>influenciou hábitos, culturas e economias</strong>. Cada avanço técnico criou novas formas de interação social e de expressão artística."
        },
        {
          "type": "paragraph",
          "text": "Nos anos 80, os <em>arcades</em> se tornaram espaços de convivência e competição, moldando a primeira geração de jogadores. Nos anos 90 e 2000, os consoles domésticos trouxeram o entretenimento digital para dentro de casa, impactando a dinâmica familiar e popularizando o jogo como forma de lazer coletiva."
        },
        {
          "type": "paragraph",
          "text": "Hoje, com o mobile e as plataformas online, os jogos são parte da <strong>cultura pop global</strong>, influenciando música, cinema, educação e até movimentos sociais. A democratização das engines, como Unity e Godot, também abriu espaço para que desenvolvedores independentes criassem experiências mais diversas e representativas."
        },
        {
          "type": "callout",
          "variant": "info",
          "title": "Conexão com a Aula:",
          "content": "Este impacto cultural conecta a linha do tempo histórica com o mercado e as engines, mostrando que <strong>tecnologia e sociedade evoluem juntas</strong> no desenvolvimento de jogos."
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "🚀 Ferramentas Emergentes e Tendências Futuras",
      "content": [
        {
          "type": "paragraph",
          "text": "A indústria de jogos está em constante transformação. Novas ferramentas e tecnologias estão moldando como os jogos são criados, distribuídos e jogados."
        },
        {
          "type": "contentBlock",
          "title": "Integração de IA Generativa",
          "content": [
            {
              "type": "paragraph",
              "text": "Motores como Unity e Unreal já experimentam IA para gerar cenários, NPCs dinâmicos e até mecânicas adaptativas em tempo real. Isso tende a reduzir custos e acelerar a prototipagem de jogos."
            }
          ]
        },
        {
          "type": "contentBlock",
          "title": "Ferramentas Low-Code e No-Code",
          "content": [
            {
              "type": "paragraph",
              "text": "Plataformas como <strong>Construct</strong> e novas engines low-code permitem que desenvolvedores iniciantes criem jogos funcionais sem programação avançada, ampliando a entrada de novos criadores na indústria."
            }
          ]
        },
        {
          "type": "contentBlock",
          "title": "Cloud Gaming e Realidade Estendida (XR)",
          "content": [
            {
              "type": "paragraph",
              "text": "O avanço de serviços como xCloud, GeForce Now e dispositivos de VR/AR está mudando a experiência de jogo, reduzindo barreiras de hardware e criando novas formas de imersão e interação."
            }
          ]
        },
        {
          "type": "callout",
          "variant": "good-practice",
          "title": "Conexão com a Aula:",
          "content": "Essa seção expande o conteúdo das engines ao mostrar como as tecnologias atuais e futuras irão impactar o design, o mercado e as competências necessárias para o desenvolvimento de jogos nos próximos anos."
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "🛠️ Pipeline de Produção em Engines",
      "content": [
        {
          "type": "paragraph",
          "text": "O pipeline de produção é a sequência de etapas que transformam uma ideia em um jogo funcional. Cada engine oferece ferramentas para otimizar esse fluxo."
        },
        {
          "type": "list",
          "items": [
            "<strong>Pré-produção:</strong> conceito, protótipos rápidos, documentação inicial.",
            "<strong>Produção:</strong> modelagem, programação, integração de assets e mecânicas.",
            "<strong>Testes e Iteração:</strong> debug, balanceamento e feedback contínuo.",
            "<strong>Publicação:</strong> build final, otimização e exportação multiplataforma."
          ]
        },
        {
          "type": "callout",
          "variant": "info",
          "title": "Dica:",
          "content": "Unity e Unreal oferecem pipelines completos, enquanto Godot e Construct são mais leves e indicados para times menores e prototipagem."
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "💰 Modelos de Monetização em Jogos",
      "content": [
        {
          "type": "paragraph",
          "text": "Além da parte técnica e criativa, entender como o jogo vai gerar receita é crucial para la sustentabilidade de um projeto."
        },
        {
          "type": "contentBlock",
          "title": "Premium",
          "content": [
            {
              "type": "paragraph",
              "text": "Venda direta com preço fixo. Exemplo: jogos single-player AAA tradicionais."
            }
          ]
        },
        {
          "type": "contentBlock",
          "title": "Free-to-Play + Microtransações",
          "content": [
            {
              "type": "paragraph",
              "text": "Entrada gratuita com venda de itens, cosméticos ou progressão. Modelo dominante em mobile e alguns MMOs."
            }
          ]
        },
        {
          "type": "contentBlock",
          "title": "Assinaturas e GaaS",
          "content": [
            {
              "type": "paragraph",
              "text": "Conteúdo contínuo via passes de batalha ou serviços como Game Pass e PS Plus."
            }
          ]
        },
        {
          "type": "callout",
          "variant": "good-practice",
          "title": "Conexão com o Mercado:",
          "content": "O modelo de monetização influencia diretamente o design do jogo, as mecânicas e até o engajamento dos jogadores."
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "🎮 Perfis de Jogadores e Segmentação de Mercado",
      "content": [
        {
          "type": "paragraph",
          "text": "Compreender quem são os jogadores é tão importante quanto dominar as ferramentas técnicas. O mercado é segmentado por perfil, preferências e hábitos de consumo."
        },
        {
          "type": "list",
          "items": [
            "<strong>Casual:</strong> busca diversão rápida e acessível (mobile, jogos simples).",
            "<strong>Hardcore:</strong> valoriza desafios, complexidade e performance.",
            "<strong>Social:</strong> prioriza interação com amigos e comunidade.",
            "<strong>Competitivo:</strong> engajado em eSports e ranking."
          ]
        },
        {
          "type": "paragraph",
          "text": "Essa segmentação influencia não apenas o design, mas também o modelo de monetização e as estratégias de marketing."
        },
        {
          "type": "callout",
          "variant": "info",
          "title": "Conexão com a Aula:",
          "content": "Analisar perfis de jogadores conecta a história e o mercado, permitindo criar experiências mais alinhadas ao público-alvo."
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "<i class=\"fa-solid fa-cogs mr-2\"></i>Panorama das Game Engines",
      "content": [
        {
          "type": "paragraph",
          "text": "Uma game engine é um framework de software que fornece aos desenvolvedores as ferramentas fundamentais para criar um jogo. Como vimos na linha do tempo, a transição de engines proprietárias para ferramentas acessíveis democratizou a criação de jogos e foi o principal catalisador da explosão criativa que vemos hoje."
        },
        {
          "type": "image",
          "src": "https://sombraprof.github.io/tdjd/imagens/aula_4_imagem_2.png",
          "alt": "Diagrama mostrando a evolução das engines: de proprietárias para licenciadas e, finalmente, para acessíveis."
        },
        {
          "type": "cardGrid",
          "cards": [
            {
              "title": "Unity",
              "content": "A engine mais popular do mundo, conhecida por sua flexibilidade e forte suporte da comunidade.<br><p class=\"text-sm font-semibold text-emerald-700\">Pontos Fortes:</p><ul class=\"text-sm list-disc list-inside text-slate-600\"><li>Multiplataforma (PC, mobile, consoles)</li><li>Asset Store robusta</li><li>Ideal para 2D e 3D</li></ul>"
            },
            {
              "title": "Unreal Engine",
              "content": "Famosa por seu poderio gráfico de ponta e ferramentas visuais (Blueprints).<br><p class=\"text-sm font-semibold text-emerald-700\">Pontos Fortes:</p><ul class=\"text-sm list-disc list-inside text-slate-600\"><li>Gráficos fotorrealistas</li><li>Programação visual com Blueprints</li><li>Padrão da indústria AAA</li></ul>"
            },
            {
              "title": "Godot",
              "content": "Uma alternativa open-source e leve que vem ganhando popularidade.<br><p class=\"text-sm font-semibold text-emerald-700\">Pontos Fortes:</p><ul class=\"text-sm list-disc list-inside text-slate-600\"><li>Gratuita e de código aberto</li><li>Leve e rápida</li><li>Excelente para jogos 2D</li></ul>"
            },
            {
              "title": "Construct",
              "content": "Focada no desenvolvimento sem código (no-code) para jogos 2D e baseados em HTML5.<br><p class=\"text-sm font-semibold text-emerald-700\">Pontos Fortes:</p><ul class=\"text-sm list-disc list-inside text-slate-600\"><li>Não exige programação</li><li>Ideal para prototipagem rápida</li><li>Exportação para web (HTML5)</li></ul>"
            }
          ]
        },
        {
          "type": "paragraph",
          "text": "As engines não são apenas ferramentas técnicas: elas definem estilos de design, influenciam gêneros e abrem portas para criadores independentes. A popularização de Unity e Godot democratizou a indústria, enquanto Unreal continua sendo referência para gráficos AAA."
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "<i class=\"fa-solid fa-chart-line mr-2\"></i>A Evolução do Mercado de Jogos",
      "content": [
        {
          "type": "paragraph",
          "text": "Os modelos de negócio na indústria de jogos evoluíram drasticamente, influenciados pela tecnologia de distribuição e pelo comportamento do consumidor."
        },
        {
          "type": "contentBlock",
          "title": "1. O Modelo Premium (Décadas de 80-90)",
          "content": [
            {
              "type": "paragraph",
              "text": "O produto era a caixa. O consumidor pagava um preço cheio por um jogo completo em mídia física (cartucho, CD). O faturamento era concentrado no lançamento."
            }
          ]
        },
        {
          "type": "contentBlock",
          "title": "2. A Revolução Digital e Free-to-Play (Década de 2000)",
          "content": [
            {
              "type": "paragraph",
              "text": "A distribuição digital, impulsionada por plataformas como a <strong>Steam</strong> e a <strong>Xbox Live</strong>, reduziu custos e permitiu que jogos fossem vendidos diretamente aos consumidores. No mobile, com a <strong>App Store</strong>, o modelo <em>Free-to-Play</em> com microtransações se tornou dominante."
            }
          ]
        },
        {
          "type": "contentBlock",
          "title": "3. A Era dos Jogos como Serviço - GaaS (Década de 2010+)",
          "content": [
            {
              "type": "paragraph",
              "text": "O jogo deixa de ser um produto único para se tornar uma plataforma em constante evolução. O foco é na retenção de jogadores a longo prazo através de passes de batalha, assinaturas e conteúdo sazonal. <em>Fortnite</em> e <em>Destiny 2</em> são exemplos paradigmáticos."
            }
          ]
        },
        {
          "type": "image",
          "src": "https://sombraprof.github.io/tdjd/imagens/aula_4_imagen_1.webp",
          "alt": "Gráfico repartindo receita global de games por mobile, console e PC em 2024"
        },
        {
          "type": "paragraph",
          "text": "Em 2024, a receita global do mercado de jogos foi de aproximadamente <strong>US$ 187,7 bi</strong>, crescendo cerca de +2,1% em relação a 2023 <sup>[1]</sup>."
        },
        {
          "type": "list",
          "items": [
            "<strong>Mobile</strong>: ~49% (~US$ 92,6 bi), crescimento de +3% YoY <sup>[2]</sup>;",
            "<strong>Console</strong>: ~27–28% (~US$ 50–51 bi), com queda de ~‑1% a ‑2,5% <sup>[3]</sup>;",
            "<strong>PC</strong>: ~23–24% (~US$ 43 bi), com crescimento de aproximadamente +4% <sup>[4]</sup>."
          ]
        },
        {
          "type": "paragraph",
          "text": "Embora o mobile mantenha a maior fatia do mercado, o segmento de PC cresce mais rapidamente em 2024, refletindo mudanças no comportamento e no ciclo de lançamentos <sup>[5]</sup>."
        },
        {
          "type": "contentBlock",
          "title": "Tendências e Fatores de Mercado",
          "content": [
            {
              "type": "paragraph",
              "text": "A desaceleração em consoles está relacionada a poucos lançamentos de impacto em 2024, enquanto o modelo gratuito e mobile continua resiliente. O PC beneficia-se de exclusividades migradas e forte presença digital <sup>[6]</sup>."
            }
          ]
        },
        {
          "type": "paragraph",
          "text": "<div class=\"mt-4 text-sm text-slate-500\"><p>[1] Newzoo, Global Games Market Report 2024.</p><p>[2] Udonis – Mobile Gaming Industry Overview 2024.</p><p>[3] GamesIndustry.biz – 2024 Market Analysis.</p><p>[4] Best of Gaming – PC Gaming Trends 2024.</p><p>[5] Newzoo Insights + Softonic Reports 2024.</p><p>[6] Reuters – Console Market Performance 2024.</p></div>"
        }
      ]
    },
    {
      "type": "cardGrid",
      "title": "<i class=\"fa-solid fa-book-journal-whills mr-2\"></i>Estudos de Caso Históricos",
      "cards": [
        {
          "title": "AAA Histórico: DOOM (1993)",
          "content": "<div class=\"space-y-4 text-slate-700 leading-relaxed\"><p class=\"text-sm\">Criado pela id Software, DOOM não foi apenas um jogo, mas uma revolução tecnológica. Popularizou o gênero FPS e o multiplayer online (deathmatch).</p><h4 class=\"font-semibold\">Análise Crítica</h4><p class=\"text-sm\">Sua engine, a id Tech 1, era um salto tecnológico que permitia um pseudo-3D rápido e fluido. O level design era labiríntico e incentivava a exploração. O modelo de distribuição <em>shareware</em> (o primeiro episódio era gratuito) foi uma estratégia de marketing genial.</p><h4 class=\"font-semibold\">Impacto Cultural e Tecnológico</h4><p class=\"text-sm\">DOOM definiu o FPS por uma década e sua engine foi licenciada para dezenas de outros jogos. A cultura de \"mods\" (modificações criadas por jogadores) nasceu aqui, mostrando o poder da comunidade na longevidade de um jogo.</p></div>"
        },
        {
          "title": "Indie Histórico: Stardew Valley (2016)",
          "content": "<div class=\"space-y-4 text-slate-700 leading-relaxed\"><p class=\"text-sm\">Desenvolvido por uma única pessoa (Eric Barone), é um simulador de fazenda que se tornou um fenômeno global, vendendo mais de 20 milhões de cópias.</p><h4 class=\"font-semibold\">Análise Crítica</h4><p class=\"text-sm\">Seu sucesso reside no polimento de um core loop viciante (plantar, colher, vender, melhorar) e na profundidade de seus sistemas interligados. É um exemplo de como um projeto autoral pode ressoar com um público massivo ao oferecer uma experiência relaxante e recompensadora.</p><h4 class=\"font-semibold\">Impacto Cultural e Econômico</h4><p class=\"text-sm\">Revitalizou o gênero de simulação de fazenda e provou que um único desenvolvedor pode competir com grandes estúdios, graças às ferramentas modernas e à distribuição digital.</p></div>"
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "📝 Tarefa (TED): Análise Crítica Comparativa",
      "content": [
        {
          "type": "paragraph",
          "text": "A tarefa é uma pesquisa de campo onde você irá aplicar os conceitos da aula para analisar criticamente dois jogos de gerações diferentes."
        },
        {
          "type": "list",
          "items": [
            "<strong>Escolha um jogo de uma era mais antiga</strong> (ex: NES, SNES, PS1) e <strong>um jogo moderno do mesmo gênero</strong>.",
            "<strong>Analise e compare os dois</strong>, focando em como as limitações/possibilidades do hardware e da engine de cada época influenciaram o design do jogo.",
            "<strong>Publique na Atividade</strong> sua comparação crítica, abordando mecânicas, narrativa e estética.",
            "Use imagens, vídeos ou comparativos visuais para ilustrar sua análise e mostrar como tecnologia impacta a experiência do jogador."
          ]
        },
        {
          "type": "callout",
          "variant": "good-practice",
          "title": "<i class=\"fa-solid fa-check-double mr-2\"></i>Checklist de Avaliação",
          "content": "<ul><li>A comparação está bem estruturada e clara.</li><li>A análise conecta as características do jogo com a tecnologia da sua época.</li><li>A capacidade de conectar a evolução tecnológica com a experiência do jogador foi demonstrada.</li></ul>"
        }
      ]
    },
    {
      "type": "bibliographyBlock",
      "title": "📚 Bibliografia e Referências",
      "references": [
        "MARTINHO, Carlos; SANTOS, Pedro; PRADA, Rui. <strong>Design e desenvolvimento de jogos.</strong> Lisboa: FCA, 2014.",
        "MASTROCOLA, Vicente Martin. <strong>Game design:</strong> modelos de negócio e processos criativos. São Paulo: Cengage Learning, 2015."
      ]
    }
  ],
  "formatVersion": "md3.lesson.v1",
  "slug": "historia-engines-e-mercado",
  "summary": "Revisa marcos da história dos jogos digitais, a evolução das engines e como essas mudanças influenciaram modelos de negócio.",
  "objectives": [
    "Identificar gerações e consoles que marcaram a evolução tecnológica.",
    "Comparar engines populares e seus ecossistemas.",
    "Discutir impactos econômicos de transições tecnológicas no mercado de jogos."
  ],
  "competencies": [
    "Pensamento histórico aplicado à tecnologia",
    "Análise de plataformas de desenvolvimento",
    "Visão de negócios"
  ],
  "skills": [
    "Construir linha do tempo com marcos relevantes.",
    "Selecionar engine adequada a um projeto com base em requisitos.",
    "Relacionar movimentos de mercado com decisões técnicas."
  ],
  "outcomes": [
    "Produz linha do tempo comentada sobre evolução dos jogos.",
    "Justifica escolha de engine considerando contexto de projeto.",
    "Aponta tendências de mercado impactadas por novas tecnologias."
  ],
  "prerequisites": [
    "Panorama do mercado de jogos.",
    "Conhecimento introdutório sobre gêneros e mecânicas."
  ],
  "tags": ["historia", "engines", "mercado"],
  "duration": 120,
  "modality": "in-person",
  "resources": [
    {
      "label": "Interactive Game Timeline (IGN)",
      "url": "https://www.ign.com/lists/video-game-history",
      "type": "interactive"
    },
    {
      "label": "Unity vs Unreal feature comparison",
      "url": "https://unity.com/features/compare",
      "type": "article"
    }
  ],
  "bibliography": [
    "KENT, S. The Ultimate History of Video Games. Three Rivers, 2021.",
    "ROLLINGS, A.; MORRIS, D. Game Architecture and Design. New Riders, 2004."
  ],
  "assessment": {
    "type": "formative",
    "description": "Linha do tempo colaborativa com análise de impactos de cada geração."
  },
  "metadata": {
    "status": "published",
    "updatedAt": "2025-02-05T00:00:00.000Z",
    "owners": ["Prof. Lucas Azevedo"],
    "sources": ["Plano de ensino TDJD 2025.1"]
  }
}
