{
  "id": "lesson-08",
  "title": "Aula 8: Level Design com ProBuilder",
  "objective": "Modelar e testar ambientes 3D utilizando ProBuilder e boas práticas de level design.",
  "content": [
    {
      "type": "lessonPlan",
      "title": "Plano da Aula",
      "cards": [
        {
          "icon": "book-open",
          "title": "CONTEÚDO",
          "content": "Level design com ProBuilder: criação de estruturas, colisores, navegação e espaços interativos. Teste e refinamento de layouts."
        },
        {
          "icon": "bullseye",
          "title": "OBJETIVO",
          "content": "Desenvolver habilidades na construção de ambientes 3D com ProBuilder, aplicando princípios de usabilidade e teste iterativo de cenário."
        },
        {
          "icon": "gears",
          "title": "METODOLOGIA",
          "content": "Aula prática com orientação por desafios (metodologia ativa: hands-on com feedback em tempo real)."
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "Arquitetura da Diversão: Introdução ao Level Design",
      "content": [
        {
          "type": "paragraph",
          "text": "Na aula anterior, aprendemos a conceituar um jogo com o GDD e a criar formas básicas com ProBuilder. Hoje, vamos aprofundar o uso dessa ferramenta para praticar o Level Design — a arte e a ciência de criar os ambientes, fases e missões de um jogo."
        },
        {
          "type": "blockquote",
          "text": "\"Um bom level design guia o jogador sutilmente, fazendo-o sentir-se inteligente e poderoso. Ele não apenas cria um espaço, mas também dita o ritmo da experiência.\"",
          "source": "— Adaptado de Schuytema, \"Design de games: uma abordagem prática\""
        },
        {
          "type": "paragraph",
          "text": "O objetivo é ir além da simples construção de \"caixas\". Vamos aprender a pensar como arquitetos de experiências, usando o ProBuilder para criar espaços que contam histórias, propõem desafios e, acima de tudo, são divertidos de navegar."
        }
      ]
    },
    {
      "type": "cardGrid",
      "title": "Princípios do Bom Level Design",
      "cards": [
        {
          "title": "Fluxo do Jogador",
          "content": "Guiar o jogador de forma intuitiva pelo cenário, usando luz, cor e composição para indicar o caminho."
        },
        {
          "title": "Pontos de Interesse",
          "content": "Criar marcos visuais (landmarks) que ajudam na orientação e despertam a curiosidade para a exploração."
        },
        {
          "title": "Ritmo e Cadência",
          "content": "Alternar entre momentos de alta tensão (combate, puzzles difíceis) e de calma (exploração, narrativa)."
        },
        {
          "title": "Risco vs. Recompensa",
          "content": "Oferecer desafios opcionais mais difíceis que recompensam o jogador com itens ou segredos valiosos."
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "História e Referências do Level Design",
      "content": [
        {
          "type": "paragraph",
          "text": "O conceito de level design evoluiu junto com a própria indústria de jogos. Nos anos 80, títulos como Super Mario Bros. (1985) já usavam o design de níveis para ensinar regras sem precisar de tutoriais escritos:"
        },
        {
          "type": "blockquote",
          "text": "\"O primeiro nível de Mario é um tutorial invisível — cada obstáculo ensina uma nova habilidade ao jogador.\"",
          "source": "— Miyamoto, criador da série Mario"
        },
        {
          "type": "paragraph",
          "text": "A partir dos anos 90, jogos em 3D como Doom (1993) e Half-Life (1998) expandiram as possibilidades, trazendo ritmo, narrativa e exploração. Atualmente, obras como The Last of Us e Dark Souls exemplificam o uso de landmarks, guias visuais e controle de ritmo para criar experiências imersivas."
        },
        {
          "type": "paragraph",
          "text": "Segundo Paul Schuytema (2008), \"o level design é a ponte entre a mecânica e a emoção do jogador\", reforçando que não se trata apenas de construir cenários, mas de arquitetar experiências."
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "Exemplos Reais de Level Design",
      "content": [
        {
          "type": "list",
          "items": [
            "🎮 Super Mario Bros. (1985): O primeiro nível é projetado para ensinar movimento, pulo e colisão sem texto. Blocos e inimigos são introduzidos gradualmente para guiar o jogador a experimentar as regras.",
            "🎮 The Legend of Zelda: Ocarina of Time (1998): Introduz o Dungeon Design, onde cada sala ensina uma mecânica que será exigida em puzzles futuros. Esse modelo é referência até hoje para jogos de aventura.",
            "🎮 Dark Souls (2011): Conhecido pelo level design interconectado, onde atalhos e landmarks (como a chama da bonfire) criam uma sensação de descoberta e domínio do espaço. A dificuldade é equilibrada pelo próprio design do cenário.",
            "🎮 The Last of Us (2013): Utiliza o cenário para contar histórias ambientais (environmental storytelling). Um prédio destruído, pichações ou objetos no chão comunicam a narrativa sem cutscenes."
          ]
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "Ferramentas Avançadas do ProBuilder",
      "content": [
        {
          "type": "contentBlock",
          "title": "Modos de Edição",
          "content": [
            {
              "type": "paragraph",
              "text": "Para esculpir suas malhas, você precisa dominar os três modos de seleção de elementos:"
            },
            {
              "type": "cardGrid",
              "cards": [
                {
                  "title": "Vertex",
                  "content": "Edita os pontos individuais."
                },
                {
                  "title": "Edge",
                  "content": "Edita as linhas que conectam os pontos."
                },
                {
                  "title": "Face",
                  "content": "Edita as superfícies poligonais."
                }
              ]
            }
          ]
        },
        {
          "type": "contentBlock",
          "title": "Principais Ferramentas de Modelagem",
          "content": [
            {
              "type": "list",
              "items": [
                "Extrude: \"Puxa\" uma face para fora, criando nova geometria. Essencial para criar paredes, degraus e detalhes.",
                "Bevel: Suaviza as bordas, chanfrando-as. Útil para criar rampas e acabamentos mais orgânicos.",
                "Connect Edges/Vertices: Cria novas arestas ou vértices entre os elementos selecionados, permitindo maior detalhamento.",
                "Triangulate Faces: Garante que as faces sejam renderizadas corretamente, especialmente após edições complexas."
              ]
            }
          ]
        },
        {
          "type": "callout",
          "variant": "good-practice",
          "title": "Mini-Desafio: Criando uma Ponte",
          "content": [
            {
              "type": "paragraph",
              "text": "Vamos praticar: crie um cubo longo e fino para ser a base da ponte. Use Connect Edges para adicionar segmentos no meio. Selecione as faces de cima desses novos segmentos e use Extrude para criar as laterais da ponte. Use Bevel nas bordas para suavizar."
            }
          ]
        }
      ]
    },
    {
      "type": "cardGrid",
      "title": "Construindo Espaços Interativos",
      "cards": [
        {
          "title": "Criação de Cobertura",
          "content": "Em jogos de tiro, use cubos e formas baixas para criar cover. Varie a altura (cobertura total vs. parcial) para incentivar diferentes táticas.",
          "image": "https://placehold.co/400x250/f0f9ff/0369a1?text=Cobertura+(Cover)"
        },
        {
          "title": "Plataformas e Vãos",
          "content": "Em jogos de plataforma, a distância e a altura entre as plataformas são cruciais. Meça a capacidade de pulo do seu personagem e projete os vãos de acordo.",
          "image": "https://placehold.co/400x250/f0f9ff/0369a1?text=Plataformas+e+Vãos"
        },
        {
          "title": "Corredores vs. Arenas",
          "content": "Use corredores estreitos para criar tensão e guiar o jogador. Use espaços abertos (arenas) para batalhas contra chefes ou momentos de maior liberdade.",
          "image": "https://placehold.co/400x250/f0f9ff/0369a1?text=Corredores+vs.+Arenas"
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "Playtesting e Refinamento",
      "content": [
        {
          "type": "paragraph",
          "text": "Level design é um processo iterativo. Crie, teste, refine, repita. O feedback do playtest é a ferramenta mais valiosa que você tem. Use seu controlador de personagem básico para \"jogar\" seu próprio nível constantemente."
        },
        {
          "type": "callout",
          "variant": "good-practice",
          "title": "Checklist de Playtest do Blockout",
          "content": [
            {
              "type": "list",
              "ordered": false,
              "items": [
                "Clareza: O caminho principal está claro? O jogador sabe para onde ir?",
                "Navegação: Existem lugares onde o jogador pode ficar preso (em cantos, buracos)?",
                "Escala: As portas, corredores e coberturas parecem do tamanho certo em relação ao personagem?",
                "Desafio: Os pulos são possíveis? A distância da cobertura é justa?",
                "Diversão: O simples ato de se mover pelo espaço é agradável?"
              ]
            }
          ]
        }
      ]
    },
    {
      "type": "videosBlock",
      "title": "🎬 Vídeos recomendados (Aula 8)",
      "videos": [
        {
          "youtubeId": "SmSZ4e6b-sg",
          "title": "Unity para iniciantes – O Primeiro Passo",
          "description": "Introdução à Unity em português — essencial para quem está começando."
        },
        {
          "youtubeId": "xxgutoxxx",
          "title": "Guto + Game Dev (Unity e C#)",
          "description": "Programação C# aplicada à Unity — ideal para trazer lógica aos seus níveis."
        },
        {
          "youtubeId": "GamesIndie",
          "title": "GamesIndie – Unity 2D/3D (iniciante)",
          "description": "Passo a passo para criar jogos na Unity — útil para entender layout e navegação."
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "📝 Tarefa (TED): Protótipo de Cenário Funcional",
      "content": [
        {
          "type": "paragraph",
          "text": "O objetivo desta tarefa é aplicar as técnicas de level design para criar um pequeno cenário interativo e testável."
        },
        {
          "type": "list",
          "title": "Passo a Passo:",
          "items": [
            "Partindo de um projeto-base com um controlador de personagem simples, use o ProBuilder para construir um pequeno percurso.",
            "O cenário deve incluir, no mínimo: diferentes elevações (rampas ou escadas), uma plataforma que exija um pulo e um obstáculo simples que precise ser contornado.",
            "Teste exaustivamente seu layout para garantir que não há bugs de colisão ou locais onde o jogador possa ficar preso.",
            "Entrega: Grave e suba no Moodle um curto vídeo (30-60 segundos) mostrando a movimentação do personagem pelo seu protótipo de cenário funcional."
          ]
        },
        {
          "type": "callout",
          "variant": "good-practice",
          "title": "Extensões (Opcional)",
          "content": [
            {
              "type": "paragraph",
              "text": "Para um desafio extra, adicione um caminho vertical que exija uma sequência de pulos, ou uma \"armadilha\" simples (como um buraco no chão) que o jogador precise desviar."
            }
          ]
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "📚 Recursos Adicionais",
      "content": [
        {
          "type": "button",
          "text": "Tutorial Oficial: Level design com ProBuilder (Unity Learn)",
          "href": "https://unity.com/features/probuilder"
        },
        {
          "type": "button",
          "text": "Tutorial Prático: Design de nível simples com ProBuilder (LogRocket)",
          "href": "https://blog.logrocket.com/design-level-probuilder-unity/"
        },
        {
          "type": "button",
          "text": "Artigo: 35 maneiras de guiar o jogador (Medium)",
          "href": "https://jacobryanwheeler.medium.com/game-level-design-35-ways-to-guide-the-player-4bbc324204f4"
        },
        {
          "type": "button",
          "text": "Princípios de bom level design — resumo inspirado no GDC",
          "href": "https://www.gamedeveloper.com/design/level-design-practices-for-player-guidance"
        }
      ]
    },
    {
      "type": "bibliographyBlock",
      "title": "📚 Bibliografia",
      "references": [
        "ALVES, George Santiago. Projeto de jogos 3D: modelagem e programação. São Paulo: Platos, 2021.",
        "SCHUYTEMA, Paul. Design de games: uma abordagem prática. São Paulo: Cengage Learning, 2008."
      ]
    }
  ],
  "formatVersion": "md3.lesson.v1",
  "slug": "level-design-com-probuilder",
  "summary": "Explora o ProBuilder para construir ambientes 3D jogáveis, aplicando princípios de usabilidade e iteração em level design.",
  "objectives": [
    "Criar blocagens 3D navegáveis com ProBuilder.",
    "Aplicar métricas de escala e sinalização para orientar o jogador.",
    "Conduzir ciclos de teste e ajuste do cenário."
  ],
  "competencies": ["Level design", "Design centrado no jogador", "Iteração baseada em feedback"],
  "skills": [
    "Manipular ferramentas de extrusão, corte e texturização básica.",
    "Planejar fluxos de navegação com checkpoints e landmarks.",
    "Documentar ajustes a partir de playtests."
  ],
  "outcomes": [
    "Entrega cena prototipada com métricas testadas.",
    "Incorpora feedback de usabilidade no layout.",
    "Explica decisões de geometria e ritmo do nível."
  ],
  "prerequisites": ["Prototipagem e GDD inicial.", "Familiaridade com Unity Editor."],
  "tags": ["level-design", "probuilder", "usabilidade"],
  "duration": 150,
  "modality": "in-person",
  "resources": [
    {
      "label": "Unity Learn – ProBuilder Essentials",
      "url": "https://learn.unity.com/course/probuilder",
      "type": "course"
    },
    {
      "label": "Level Design Reference Guide",
      "url": "https://www.gamedev.net/tutorials/game-design/level-design-reference-guide-r3331/",
      "type": "article"
    }
  ],
  "bibliography": [
    "ROGERS, S. Level Up! The Guide to Great Video Game Design. Wiley, 2014.",
    "ADAMS, E. Fundamentals of Game Design. New Riders, 2014."
  ],
  "assessment": {
    "type": "practical",
    "description": "Avaliação do cenário bloqueado com checklist de navegabilidade."
  },
  "metadata": {
    "status": "published",
    "updatedAt": "2025-02-05T00:00:00.000Z",
    "owners": ["Prof. Tiago Sombra"],
    "sources": ["Plano de ensino TDJD 2025.1"]
  }
}
