{
  "id": "lesson-03",
  "title": "Aula 3: Estudos de Caso, Análise Crítica e Inovações",
  "objective": "Comparar modelos de produção e inovação em jogos Indie e AAA, reconhecendo oportunidades para projetos autorais.",
  "content": [
    {
      "type": "lessonPlan",
      "title": "Plano da Aula",
      "cards": [
        {
          "icon": "book-open",
          "title": "UNIDADE E CONTEÚDO",
          "content": "Unidade I – Introdução ao Desenvolvimento de Jogos Digitais. Estudos de caso (Indie/AAA), análise de mecânicas, público-alvo e tendências."
        },
        {
          "icon": "bullseye",
          "title": "OBJETIVO",
          "content": "Compreender as diferenças de escopo, mecânica e narrativa entre jogos Indie e AAA, analisando criticamente seu impacto cultural e tecnológico."
        },
        {
          "icon": "gears",
          "title": "METODOLOGIA",
          "content": "Estudo de caso, análise comparativa, discussão guiada e Aprendizagem Baseada em Problemas (ABP)."
        },
        {
          "icon": "desktop",
          "title": "RECURSOS",
          "content": "Slides, vídeos de gameplay, Padlet/Miro, fórum do Moodle."
        },
        {
          "icon": "clock",
          "title": "C.H.",
          "content": "2 horas/aula."
        },
        {
          "icon": "tasks",
          "title": "TED",
          "content": "Pesquisa comparativa: análise de dois jogos escolhidos pelo aluno, com publicação no fórum."
        },
        {
          "icon": "graduation-cap",
          "title": "COMPETÊNCIAS",
          "content": "Análise crítica, síntese de informações, integração teoria-prática, leitura de mercado, repertório cultural e tecnológico."
        }
      ]
    },
    {
      "type": "timeline",
      "title": "A Ascensão Indie e a Consolidação AAA",
      "steps": [
        {
          "title": "Anos 2000",
          "content": "Predomínio dos jogos AAA com orçamentos milionários. Publishers definem tendências, e o acesso ao mercado é restrito a grandes estúdios."
        },
        {
          "title": "2008–2010",
          "content": "Plataformas digitais como Steam e App Store democratizam a distribuição. Motores como Unity e Unreal tornam-se acessíveis, abrindo caminho para o movimento Indie."
        },
        {
          "title": "2012–2015",
          "content": "Crowdfunding (Kickstarter) e comunidades online impulsionam projetos independentes. Jogos como Undertale e Shovel Knight mostram a força dos indies."
        },
        {
          "title": "2016–2020",
          "content": "Consolidação dos AAA como experiências cinematográficas (The Last of Us Part II) enquanto indies exploram narrativas autorais (Celeste, Hollow Knight)."
        },
        {
          "title": "2020+",
          "content": "Cloud Gaming, IA gerativa e marketplaces globais ampliam ainda mais o espaço para produções de todos os portes. A coexistência Indie/AAA se torna mais integrada."
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "O que são Jogos Indie e AAA?",
      "content": [
        {
          "type": "paragraph",
          "text": "A indústria de jogos digitais possui dois polos que representam modelos de produção distintos: os Jogos Indie (independentes) e os Jogos AAA (grandes produções). Ambos são essenciais para o ecossistema, equilibrando inovação e sustentabilidade."
        },
        {
          "type": "contentBlock",
          "title": "Jogos Indie (Independent Games)",
          "content": [
            {
              "type": "image",
              "src": "https://placehold.co/80x80/1e293b/ffffff?text=Indie",
              "alt": "Indie"
            },
            {
              "type": "paragraph",
              "text": "Desenvolvidos por equipes pequenas ou indivíduos, com orçamentos reduzidos e grande liberdade criativa. O foco está em inovação mecânica e autoria pessoal. Exemplos: Hollow Knight, Celeste, Undertale."
            }
          ]
        },
        {
          "type": "contentBlock",
          "title": "Jogos AAA (Triple-A)",
          "content": [
            {
              "type": "image",
              "src": "https://placehold.co/80x80/4f46e5/ffffff?text=AAA",
              "alt": "AAA"
            },
            {
              "type": "paragraph",
              "text": "Produzidos por grandes estúdios com centenas de profissionais e orçamentos multimilionários. Priorizam alta qualidade audiovisual e apelo de mercado massivo. Exemplos: The Last of Us Part II, Elden Ring, Assassin's Creed."
            }
          ]
        },
        {
          "type": "md3Table",
          "headers": ["Aspecto", "Jogos Indie", "Jogos AAA"],
          "rows": [
            ["Equipe", "1 a ~50 pessoas", "Centenas ou mais"],
            [
              "Orçamento",
              "Baixo (milhares a poucos milhões)",
              "Alto (dezenas a centenas de milhões)"
            ],
            [
              "Foco",
              "Inovação, mecânica central polida",
              "Escala, polimento audiovisual, marketing"
            ],
            ["Público", "Nichado, experimental", "Massivo, mainstream"]
          ]
        },
        {
          "type": "callout",
          "variant": "info",
          "content": [
            {
              "type": "paragraph",
              "text": "Resumo: Indies trazem liberdade e inovação; AAAs oferecem escala e estabilidade de mercado. O desenvolvedor ideal entende como absorver o melhor dos dois mundos para criar experiências significativas."
            }
          ]
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "Pipeline de Produção Indie vs AAA",
      "content": [
        {
          "type": "paragraph",
          "text": "O pipeline de desenvolvimento define como uma equipe transforma ideias em um produto final. A estrutura e o ritmo diferem radicalmente entre jogos Indie e AAA, impactando orçamento, prazo e design."
        },
        {
          "type": "contentBlock",
          "title": "Pipeline Indie",
          "content": [
            {
              "type": "list",
              "items": [
                "Conceito: Ideias rápidas, prototipagem leve.",
                "Protótipo Jogável: Iterações curtas e feedback constante.",
                "Produção: Equipe reduzida, funções acumuladas.",
                "Teste e Ajuste: Testes com comunidade e refinamento.",
                "Lançamento: Publicação digital (Steam, Itch.io, etc.)."
              ]
            }
          ]
        },
        {
          "type": "contentBlock",
          "title": "Pipeline AAA",
          "content": [
            {
              "type": "list",
              "items": [
                "Pré-produção: Design Doc, protótipo de conceito, alinhamento executivo.",
                "Produção: Equipes especializadas, milestones rígidas.",
                "QA Massivo: Equipes de testes dedicadas e polimento audiovisual.",
                "Marketing Paralelo: Hype building e campanhas de mídia.",
                "Lançamento: Publicação multiplataforma com suporte pós-release."
              ]
            }
          ]
        },
        {
          "type": "image",
          "src": "https://placehold.co/600x200/10b981/ffffff?text=Ideia+→+Protótipo+→+Iteração+→+Lançamento",
          "alt": "Fluxograma Indie"
        },
        {
          "type": "image",
          "src": "https://placehold.co/600x200/6366f1/ffffff?text=Pré-Produção+→+Produção+→+QA+→+Marketing+→+Lançamento",
          "alt": "Fluxograma AAA"
        },
        {
          "type": "callout",
          "variant": "info",
          "content": [
            {
              "type": "paragraph",
              "text": "Insight: Um bom desenvolvedor entende que o pipeline define mais do que etapas técnicas: ele influencia o próprio design do jogo. Projetos híbridos podem combinar a agilidade Indie com o polimento AAA, adaptando processos para equipes médias."
            }
          ]
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "Impacto Cultural dos Jogos",
      "content": [
        {
          "type": "paragraph",
          "text": "Jogos digitais vão muito além do entretenimento. Eles são expressões culturais que refletem valores, narrativas e contextos sociais. Tanto Indies quanto AAAs moldam a forma como percebemos histórias, tecnologia e até identidade coletiva."
        },
        {
          "type": "contentBlock",
          "title": "Jogos Indie",
          "content": [
            {
              "type": "paragraph",
              "text": "Costumam explorar narrativas pessoais e temas sociais. Exemplos: Papers, Please (migração e política), Celeste (saúde mental), Hades (mitologia reimaginada). São reflexos de autoria individual e diversidade cultural."
            }
          ]
        },
        {
          "type": "contentBlock",
          "title": "Jogos AAA",
          "content": [
            {
              "type": "paragraph",
              "text": "Grandes produções moldam tendências globais e se tornam marcos culturais. Exemplos: The Last of Us (narrativa cinematográfica e inclusão), Assassin’s Creed (representação histórica), Elden Ring (imersão em mitologias fictícias)."
            }
          ]
        },
        {
          "type": "contentBlock",
          "title": "Jogos Mobile e Cultura Pop",
          "content": [
            {
              "type": "paragraph",
              "text": "Jogos como Pokémon GO e Free Fire mostram como o mobile influencia comportamentos sociais, cria comunidades e até movimenta economias locais."
            }
          ]
        },
        {
          "type": "contentBlock",
          "title": "🎨 Games como Patrimônio Cultural",
          "content": [
            {
              "type": "paragraph",
              "text": "Em 2022, a UNESCO reconheceu os jogos digitais como expressão cultural significativa. Arquivamento, preservação e estudos acadêmicos são essenciais para garantir que essa arte interativa faça parte da memória coletiva."
            }
          ]
        },
        {
          "type": "image",
          "src": "https://sombraprof.github.io/tdjd/imagens/aula_3_imagem_1.png",
          "alt": "Ilustração de impacto cultural dos jogos"
        },
        {
          "type": "callout",
          "variant": "good-practice",
          "content": [
            {
              "type": "paragraph",
              "text": "Reflexão: Qual jogo mais impactou sua visão de mundo? Ele trouxe uma narrativa, mecânica ou estética que mudou a forma como você entende cultura e sociedade?"
            }
          ]
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "Exercício de Design",
      "content": [
        {
          "type": "paragraph",
          "text": "O objetivo desta atividade é criar um conceito de jogo híbrido que combine elementos de um projeto Indie (inovação, autoria) com características de um AAA (polimento, escala). Isso reforça a compreensão de pipelines, mecânicas centrais e alinhamento com público-alvo."
        },
        {
          "type": "list",
          "items": [
            "Defina o gênero principal e uma mecânica central inovadora (core loop).",
            "Escolha um tema narrativo e defina o público-alvo (casual, hardcore, etc.).",
            "Liste 3 elementos que dariam “escala AAA” ao projeto (ex: gráficos, dublagem, marketing).",
            "Escreva em 3 a 4 frases como seu jogo se diferencia no mercado."
          ]
        },
        {
          "type": "callout",
          "variant": "info",
          "title": "📌 Exemplo de Resposta:",
          "content": [
            {
              "type": "paragraph",
              "text": "Gênero: Plataforma narrativa com elementos de puzzle."
            },
            {
              "type": "paragraph",
              "text": "Mecânica Central: Manipulação do tempo para resolver desafios e alterar a narrativa."
            },
            {
              "type": "paragraph",
              "text": "Tema e Público-Alvo: Viagem emocional sobre perda e superação. Público: jogadores que buscam experiências imersivas e reflexivas."
            },
            {
              "type": "paragraph",
              "text": "Escala AAA: Dublagem profissional, trilha sonora orquestrada, marketing global."
            }
          ]
        },
        {
          "type": "callout",
          "variant": "info",
          "content": [
            {
              "type": "paragraph",
              "text": "Dica: Pense no equilíbrio entre coração Indie (autoria e inovação) e acabamento AAA (polimento, escala). Pergunte-se: “O que torna meu jogo único e como ele se conecta com o público?”"
            }
          ]
        },
        {
          "type": "callout",
          "variant": "good-practice",
          "title": "💡 Atividade Complementar:",
          "content": [
            {
              "type": "paragraph",
              "text": "Desenhe rapidamente (pode ser no papel) a tela inicial e uma tela de gameplay do seu conceito. Não foque em arte, mas na comunicação das mecânicas e interface."
            }
          ]
        }
      ]
    },
    {
      "type": "cardGrid",
      "title": "📖 Glossário de Termos",
      "cards": [
        {
          "title": "AAA",
          "content": "Jogos de alto orçamento, grandes equipes e apelo de mercado massivo.\nExemplo: The Last of Us Part II, pela escala de produção e polimento cinematográfico."
        },
        {
          "title": "Indie",
          "content": "Produções independentes com foco em inovação mecânica e autoria criativa.\nExemplo: Celeste, narrativa íntima com mecânicas precisas desenvolvidas por equipe pequena."
        },
        {
          "title": "Core Loop",
          "content": "Conjunto de ações centrais que o jogador repete durante o jogo.\nExemplo: Em Hollow Knight: explorar → lutar → evoluir habilidades → explorar mais."
        },
        {
          "title": "Game Feel",
          "content": "Sensação tátil e emocional que o jogador tem ao interagir com o jogo.\nExemplo: O peso dos golpes em Elden Ring dá sensação de impacto e desafio."
        },
        {
          "title": "ABP",
          "content": "Aprendizagem Baseada em Problemas: metodologia ativa usada para esta aula.\nExemplo: Analisar diferenças Indie vs AAA e aplicar em projeto autoral."
        },
        {
          "title": "Hitbox",
          "content": "Área invisível que define a detecção de colisões e acertos.\nExemplo: Precisão das hitboxes em Celeste e Hollow Knight garante controle exato."
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "🔬 Estudos de Caso: Indie vs. AAA",
      "content": [
        {
          "type": "paragraph",
          "text": "Analise como escala de produção, orçamento e escolhas de design se manifestam em jogos independentes e AAA. Os casos abaixo conectam narrativa, mecânicas e fundamentos físico-matemáticos."
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "Indie — Hollow Knight",
      "content": [
        {
          "type": "video",
          "youtubeId": "UAO2urG23S4",
          "title": "Trailer de Hollow Knight"
        },
        {
          "type": "paragraph",
          "text": "Produzido por uma equipe de três pessoas, Hollow Knight combina exploração metroidvania, combate desafiador e narrativa ambiental. É referência de como projetos indie podem atingir profundidade e reconhecimento crítico."
        },
        {
          "type": "list",
          "title": "Destaques de design",
          "items": [
            "Mecânicas emergentes: ações simples (pular, atacar, dash) geram combates complexos.",
            "Progressão não linear: exige mapeamento mental e incentiva backtracking inteligente.",
            "Atmosfera: narrativa ambiental construída por cenários e trilha sonora."
          ]
        },
        {
          "type": "callout",
          "variant": "info",
          "title": "Conexão físico-matemática",
          "content": [
            {
              "type": "paragraph",
              "text": "Equação da Física: o pulo segue h = v₀² / (2g), controlando altura pelo tempo de pressão do botão."
            }
          ]
        },
        {
          "type": "list",
          "items": [
            "Física do pulo: trajetória parabólica precisa, essencial para o desafio platformer.",
            "IA dos inimigos: máquinas de estados e pathfinding simples mantêm o ritmo.",
            "Detecção de colisão: hitboxes e hurtboxes calibradas garantem justiça ao jogador."
          ]
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "AAA — The Last of Us Part II",
      "content": [
        {
          "type": "video",
          "youtubeId": "vhII1qlcZ4E",
          "title": "Trailer de The Last of Us Part II"
        },
        {
          "type": "paragraph",
          "text": "O estúdio Naughty Dog entrega uma experiência cinematográfica com grande investimento em narrativa, animação e áudio. Cada mecânica reforça a sensação de sobrevivência brutal."
        },
        {
          "type": "list",
          "title": "Destaques de design",
          "items": [
            "Stealth e combate: sistemas polidos criam tensão emocional constante.",
            "Produção AAA: atuações, captura de movimento e áudio no padrão cinematográfico.",
            "Experiência dirigida: ritmo cuidadosamente coreografado para impacto narrativo."
          ]
        },
        {
          "type": "callout",
          "variant": "info",
          "title": "Conexão físico-matemática",
          "content": [
            {
              "type": "paragraph",
              "text": "Equação aplicada: física de ragdoll utiliza a conservação do momento linear p = m · v para reações realistas."
            }
          ]
        },
        {
          "type": "list",
          "items": [
            "IA comportamental: inimigos usam grafos complexos para flanquear e comunicar intenções.",
            "Ragdoll e impacto: parâmetros de massa e velocidade definem reações a tiros e explosões.",
            "Animação reativa: motion matching e IK garantem transições fluidas."
          ]
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "Indie — Celeste",
      "content": [
        {
          "type": "video",
          "youtubeId": "70d9irlxiB4",
          "title": "Trailer de Celeste"
        },
        {
          "type": "paragraph",
          "text": "Celeste é um platformer de alta precisão que une desafios técnicos a uma narrativa sobre saúde mental e superação."
        },
        {
          "type": "list",
          "title": "Destaques de design",
          "items": [
            "Core loop enxuto: pulo, escalada e dash são explorados ao máximo pelo level design.",
            "Aprendizagem orgânica: fases introduzem novas interações sem tutoriais explícitos.",
            "Feedback imediato: resposta precisa aos comandos sustenta a sensação de controle."
          ]
        },
        {
          "type": "callout",
          "variant": "info",
          "title": "Conexão físico-matemática",
          "content": [
            {
              "type": "paragraph",
              "text": "Equação aplicada: o dash segue v = v₀ · û, permitindo oito direções com magnitude constante."
            }
          ]
        },
        {
          "type": "list",
          "items": [
            "Controle de vetores: dash instantâneo com vetor unitário direciona o movimento.",
            "Física de plataforma: gravidade, aceleração e atrito calibrados para movimentos de precisão."
          ]
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "AAA — Elden Ring",
      "content": [
        {
          "type": "video",
          "youtubeId": "E3Huy2cdih0",
          "title": "Trailer de Elden Ring"
        },
        {
          "type": "paragraph",
          "text": "Elden Ring amplia a fórmula Souls para um mundo aberto denso, incentivando exploração, descoberta e domínio das mecânicas de combate."
        },
        {
          "type": "list",
          "title": "Destaques de design",
          "items": [
            "Gameplay emergente: sistemas abertos permitem múltiplas abordagens.",
            "Desafio autoral: gerenciamento de estamina, tempo de ataque e construção de builds."
          ]
        },
        {
          "type": "callout",
          "variant": "info",
          "title": "Conexão físico-matemática",
          "content": [
            {
              "type": "paragraph",
              "text": "Equação aplicada: o momento de inércia τ = I · α explica como peso de equipamento altera rolamentos."
            }
          ]
        },
        {
          "type": "list",
          "items": [
            "Hitboxes e hurtboxes: detecção precisa define sucesso ou falha nos ataques.",
            "Física de equipamentos: massa influencia velocidade, consumo de estamina e tempo de recuperação."
          ]
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "🗣️ Análise Crítica Coletiva",
      "content": [
        {
          "type": "paragraph",
          "text": "Agora, vamos debater em grupo. A análise crítica é uma das ferramentas mais importantes de um game designer. Não se trata de dizer se um jogo é bom ou ruim, mas de entender por que ele funciona (ou não) para seu público."
        },
        {
          "type": "list",
          "items": [
            "O que define o \"sucesso\" de um jogo indie em comparação com um AAA? São as mesmas métricas?",
            "Como o orçamento e o tamanho da equipe impactam as decisões de design e o escopo das mecânicas?",
            "Qual conceito físico-matemático (colisão, vetores, IA) mais se repete nos jogos analisados e por quê?"
          ]
        },
        {
          "type": "blockquote",
          "text": "\"O jogo não está no computador, está na mente do jogador. O trabalho do designer é criar as regras e o contexto que possibilitam essa experiência significativa.\"",
          "source": "— Adaptado de Salen & Zimmerman, \"Regras do Jogo\""
        },
        {
          "type": "callout",
          "variant": "good-practice",
          "title": "Atividade em Grupo (5 min)",
          "content": [
            {
              "type": "paragraph",
              "text": "Acessem o link do Padlet/Miro compartilhado. Cada grupo deve postar um \"insight\" principal da discussão: uma conclusão, uma nova pergunta ou uma observação interessante sobre as diferenças entre o desenvolvimento Indie e AAA."
            }
          ]
        }
      ]
    },
    {
      "type": "cardGrid",
      "title": "🚀 Tendências e Inovações na Indústria",
      "cards": [
        {
          "title": "Cloud Gaming",
          "content": "Serviços como Xbox Cloud Gaming e GeForce NOW, que permitem jogar títulos AAA em qualquer dispositivo via streaming."
        },
        {
          "title": "Crossplay",
          "content": "Unificação de ecossistemas, permitindo que jogadores de diferentes plataformas (PC, PlayStation, Xbox) joguem juntos."
        },
        {
          "title": "Jogos como Serviço (GaaS)",
          "content": "Modelos de negócio baseados em atualizações contínuas, passes de batalha e conteúdo sazonal para manter os jogadores engajados."
        },
        {
          "title": "IA Gerativa em Jogos",
          "content": "Uso de IA para criar diálogos dinâmicos, assets, texturas e até mesmo quests, prometendo revolucionar a criação de conteúdo."
        },
        {
          "title": "VR/AR",
          "content": "Realidade Virtual e Aumentada continuam a evoluir, buscando criar experiências mais imersivas e interativas."
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "Oportunidades no Mercado Brasileiro",
      "content": [
        {
          "type": "paragraph",
          "text": "O Brasil se destaca no desenvolvimento de jogos indie com identidade cultural própria. O perfil de consumo nacional é forte no mobile e free-to-play. Políticas de incentivo, como a Lei Paulo Gustavo, buscam fomentar ainda mais a produção local."
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "📝 Tarefa (TED): Pesquisa de Campo Comparativa",
      "content": [
        {
          "type": "paragraph",
          "text": "Para consolidar a habilidade de análise crítica, a tarefa desta semana é uma pesquisa de campo. O objetivo é aplicar os conceitos vistos em aula a dois jogos de sua escolha."
        },
        {
          "type": "list",
          "items": [
            "Escolha dos Jogos: Selecione dois jogos de gêneros diferentes. Pode ser um que você já jogou ou um que você irá observar através de vídeos de gameplay.",
            "Análise Individual: Para cada jogo, analise e anote os seguintes pontos: - Gênero e Hibridismo: Qual o gênero principal e quais elementos de outros gêneros ele incorpora? - Mecânicas Centrais: Quais são as 2-3 ações que formam o core loop do jogo? - Público-Alvo: Para quem você acredita que este jogo foi feito? (Casual, hardcore, família, etc.) - Conceitos Físico-Matemáticos: Quais conceitos de física (colisão, gravidade, momento) ou matemática (vetores, IA, grafos) você identificou?",
            "Publicação no Fórum: Crie uma postagem no Moodle com o título \"Análise Comparativa: [Jogo 1] vs. [Jogo 2]\". Na postagem, apresente sua análise de forma comparativa, destacando as principais diferenças e semelhanças no design, mecânicas e público-alvo dos dois jogos."
          ]
        },
        {
          "type": "callout",
          "variant": "good-practice",
          "title": "Checklist de Avaliação",
          "content": [
            {
              "type": "list",
              "ordered": false,
              "items": [
                "A comparação está bem estruturada e clara.",
                "Usei corretamente os conceitos de gênero, mecânica e público-alvo.",
                "Minha análise conectou as mecânicas com a experiência do jogador.",
                "Identifiquei os conceitos de física/matemática aplicados.",
                "Citei as fontes (Salen & Zimmerman, 2012; Schuytema, 2008) para fortalecer a argumentação."
              ]
            }
          ]
        }
      ]
    },
    {
      "type": "bibliographyBlock",
      "title": "📚 Bibliografia e Referências",
      "references": [
        "FULLERTON, Tracy. Game Design Workshop: A Playcentric Approach to Creating Innovative Games. 4th ed. CRC Press, 2018.",
        "SALEN, Katie; ZIMMERMAN, Eric. Regras do jogo: fundamentos do design de jogos. v. 1. São Paulo: Blucher, 2012.",
        "SCHUYTEMA, Paul. Design de games: uma abordagem prática. São Paulo: Cengage Learning, 2008."
      ]
    }
  ],
  "formatVersion": "md3.lesson.v1",
  "slug": "estudos-de-caso-e-inovacoes",
  "summary": "Analisa estudos de caso de jogos Indie e AAA para identificar padrões de inovação, escopo e impacto cultural.",
  "objectives": [
    "Investigar decisões de design em jogos com diferentes escalas de produção.",
    "Relacionar restrições de orçamento e equipe com soluções criativas.",
    "Extrair lições aplicáveis a projetos acadêmicos e profissionais."
  ],
  "competencies": ["Pesquisa e análise crítica", "Pensamento inovador", "Planejamento de produto"],
  "skills": [
    "Construir estudos de caso com evidências claras.",
    "Argumentar sobre impactos culturais de jogos.",
    "Identificar oportunidades de inovação em cenários limitados."
  ],
  "outcomes": [
    "Produz relatório comparativo entre jogos Indie e AAA.",
    "Aponta escolhas de design que alavancaram a inovação.",
    "Propõe insights para futuras prototipagens do grupo."
  ],
  "prerequisites": [
    "Conhecimento de gêneros e mecânicas.",
    "Noções básicas de análise crítica de mídia."
  ],
  "tags": ["estudo-de-caso", "inovacao", "analise"],
  "duration": 120,
  "modality": "in-person",
  "resources": [
    {
      "label": "GDC Vault – Postmortems selecionados",
      "url": "https://www.gdcvault.com/search.php?t=titles&search=postmortem",
      "type": "video"
    },
    {
      "label": "IGDA – Developer Satisfaction Survey",
      "url": "https://igda.org/resources/devsatisfaction/",
      "type": "report"
    }
  ],
  "bibliography": [
    "KEITH, C. Agile Game Development. Addison-Wesley, 2020.",
    "ANTHROPY, A. Rise of the Videogame Zinesters. Seven Stories, 2012."
  ],
  "assessment": {
    "type": "formative",
    "description": "Apresentação curta de estudo de caso elaborado em duplas."
  },
  "metadata": {
    "status": "published",
    "updatedAt": "2025-02-05T00:00:00.000Z",
    "owners": ["Prof. Tiago Sombra"],
    "sources": ["Plano de ensino TDJD 2025.1"]
  }
}
