{
  "formatVersion": "md3.lesson.v1",
  "id": "lesson-01",
  "title": "Aula 1: Introdução à Lógica e Algoritmos",
  "summary": "Apresenta a disciplina, posiciona a lógica como base para resolver problemas computacionais e introduz o ciclo de criação de algoritmos.",
  "objective": "Conhecer o funcionamento do curso, alinhar expectativas e compreender por que a lógica é a linguagem dos computadores.",
  "objectives": [
    "Contextualizar o papel da lógica na resolução de problemas computacionais.",
    "Mapear o funcionamento da disciplina, critérios de avaliação e recursos de apoio.",
    "Experimentar a construção de algoritmos usando passos claros e estruturados."
  ],
  "competencies": [
    "Raciocínio lógico aplicado à computação",
    "Planejamento de soluções algorítmicas",
    "Comunicação de processos passo a passo"
  ],
  "skills": [
    "Identificar premissas e conclusões em argumentos lógicos.",
    "Traduzir situações cotidianas em sequências de passos executáveis.",
    "Selecionar representações adequadas (fluxogramas, pseudocódigo) para comunicar algoritmos."
  ],
  "outcomes": [
    "Explica os pilares da disciplina e os critérios de avaliação.",
    "Esboça um algoritmo simples a partir de um problema cotidiano.",
    "Relaciona os principais formatos de representação algorítmica."
  ],
  "prerequisites": [
    "Familiaridade básica com o uso de computadores e navegação em ambientes virtuais de aprendizagem."
  ],
  "tags": ["logica", "algoritmos", "planejamento"],
  "duration": 100,
  "modality": "in-person",
  "resources": [
    {
      "label": "Plano de ensino da disciplina",
      "type": "document",
      "url": "https://example.edu/algi/plano-ensino"
    },
    {
      "label": "Moodle institucional",
      "type": "platform",
      "url": "https://ava.example.edu"
    }
  ],
  "bibliography": [
    "ASCENCIO, A. F.; CAMPOS, E. R. Fundamentos da Programação de Computadores. 3. ed. Pearson, 2022.",
    "FORBELLONE, A. L. V.; EBERSPÄCHER, H. F. Algoritmos: Lógica para Desenvolvimento de Programas. 3. ed. Prentice Hall, 2021."
  ],
  "assessment": {
    "type": "diagnostic",
    "description": "Checklist de participação no check-in inicial e entrega do esboço de algoritmo cotidiano."
  },
  "content": [
    {
      "type": "lessonPlan",
      "title": "Plano da Aula",
      "unit": {
        "title": "Unidade I – Noções básicas de lógica e algoritmos",
        "content": "Ambientação na disciplina, revisão das regras de convivência e primeira exploração de como algoritmos descrevem soluções computacionais."
      },
      "cards": [
        {
          "icon": "bullseye",
          "title": "Objetivo Geral",
          "content": "Entender o propósito da disciplina e posicionar a lógica de programação como ferramenta central para resolver problemas reais."
        },
        {
          "icon": "gears",
          "title": "Metodologia",
          "content": "Aula expositiva dialogada com dinâmicas curtas, uso de quadros colaborativos digitais e exercício guiado de tradução de problema em algoritmo."
        },
        {
          "icon": "desktop",
          "title": "Recursos",
          "content": "Projetor, computador do docente, Moodle institucional, quadro branco, fichas de atividades e material de leitura complementar."
        }
      ]
    },
    {
      "type": "flightPlan",
      "title": "Plano de voo (1h40)",
      "items": [
        "(15 min) Check-in e alinhamento do plano de ensino.",
        "(20 min) Conversa guiada: por que algoritmos estão em todo lugar?",
        "(25 min) Mini aula: elementos de um algoritmo e exemplos cotidianos.",
        "(20 min) Oficina rápida: escrevendo um algoritmo para preparar um café.",
        "(10 min) Introdução às representações (pseudocódigo, fluxograma).",
        "(10 min) Tarefa diagnóstica e canais de suporte."
      ]
    },
    {
      "type": "callout",
      "variant": "info",
      "title": "Check-in inicial",
      "content": "Partilhe com a turma um processo do seu dia a dia que poderia ser descrito como um algoritmo. Quais passos nunca podem ser esquecidos?"
    },
    {
      "type": "cardGrid",
      "title": "Elementos de um algoritmo",
      "cards": [
        {
          "title": "Entrada",
          "content": "Dados que iniciam o processo. Podem ser informações fornecidas pelo usuário ou coletadas de sensores."
        },
        {
          "title": "Processamento",
          "content": "Transformações lógicas aplicadas sobre as entradas. Aqui definimos condições, cálculos e regras de negócio."
        },
        {
          "title": "Saída",
          "content": "Resultado entregue após o processamento. Pode ser uma mensagem, um relatório ou uma ação automática."
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "Da lógica do discurso à lógica dos computadores",
      "content": [
        {
          "type": "paragraph",
          "text": "A lógica formal permite estruturar argumentos sem ambiguidades. Em computação, ela garante que o computador execute exatamente o que foi especificado."
        },
        {
          "type": "paragraph",
          "text": "Todo algoritmo parte de premissas (entradas) e produz uma conclusão (saída). Quando mapeamos estes elementos, criamos instruções confiáveis."
        },
        {
          "type": "subBlock",
          "title": "Estrutura básica de um argumento lógico",
          "items": [
            "<p><strong>Premissas</strong>: fatos ou condições que assumimos como verdade.</p>",
            "<p><strong>Regra</strong>: relação que conecta as premissas à conclusão.</p>",
            "<p><strong>Conclusão</strong>: afirmação resultante da aplicação da regra.</p>",
            {
              "component": "Callout",
              "props": {
                "variant": "good-practice",
                "title": "Exemplo",
                "content": "Se a porta está fechada <strong>e</strong> há chave na minha mão, então consigo entrar."
              }
            }
          ]
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "Do problema ao algoritmo",
      "content": [
        {
          "type": "paragraph",
          "text": "Para converter um desafio em algoritmo, decomponha o problema em passos pequenos e observe decisões críticas."
        },
        {
          "component": "OrderedList",
          "props": {
            "items": [
              {
                "title": "Definir o objetivo",
                "text": "Qual resultado final precisa ser entregue?"
              },
              {
                "title": "Identificar entradas",
                "text": "Que informações ou materiais são necessários para começar?"
              },
              {
                "title": "Determinar decisões",
                "text": "Quais perguntas precisam ser respondidas durante o processo?"
              },
              {
                "title": "Sequenciar passos",
                "text": "Ordene as ações do início ao fim, incluindo repetições quando necessário."
              },
              {
                "title": "Testar e ajustar",
                "text": "Simule mentalmente e refine o algoritmo até que nenhuma etapa seja ambígua."
              }
            ]
          }
        }
      ]
    },
    {
      "type": "component",
      "component": "Md3LogicOperators"
    }
  ],
  "metadata": {
    "status": "published",
    "updatedAt": "2025-02-10T12:00:00.000Z",
    "owners": ["Profa. Carla Mendes", "Prof. Miguel Souza"],
    "sources": ["Plano pedagógico Algoritmos I 2025.1", "Ata pedagógica de revisão 2024-12"]
  }
}
