{
  "id": "lesson-39",
  "title": "Aula 39: Avaliação NP3",
  "objective": "Avaliar de forma global o domínio dos conteúdos trabalhados ao longo do semestre, testando a capacidade do aluno de analisar problemas e implementar soluções completas em C, com estruturas de dados básicas.",
  "content": [
    {
      "type": "callout",
      "variant": "info",
      "title": "Warm-up (pré-aula)",
      "content": [
        {
          "type": "paragraph",
          "text": "Revise o plano de ensino e leia o trecho recomendado em Forbellone & Eberspächer relacionado a Avaliação NP3. Assista ao vídeo indicado na playlist do Curso em Vídeo e anote dúvidas sobre o conteúdo descrito no sumário."
        },
        {
          "type": "unorderedList",
          "items": [
            {
              "text": "Verifique acesso ao OnlineGDB, Replit ou VS Code template para executar exemplos antes da aula."
            },
            {
              "text": "Preencha a planilha de preparação pré-aula com expectativas e dúvidas prioritárias."
            },
            {
              "text": "Confirme no Moodle a leitura das instruções da Aula 39."
            }
          ]
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "Escopo e formato da avaliação",
      "content": [
        {
          "type": "unorderedList",
          "items": [
            { "text": "Duração total: 120 minutos, prova presencial com consulta vedada." },
            {
              "text": "Estrutura: três blocos (diagnóstico, desenvolvimento, reflexão) com entregas sequenciais."
            },
            {
              "text": "Material permitido: apenas caneta azul ou preta, lápis para rascunho e régua para organização do papel."
            },
            {
              "text": "Entregáveis: caderno de questões, folha de respostas e rascunhos assinados."
            }
          ]
        }
      ]
    },
    {
      "type": "flightPlan",
      "title": "Mapa da avaliação integradora",
      "items": [
        "(10 min) Orientações iniciais: regras de conduta, checagem de documentos e distribuição dos cadernos.",
        "(25 min) Bloco 1 — Diagnóstico: questões objetivas e problemas curtos para aquecer raciocínio lógico.",
        "(45 min) Bloco 2 — Desenvolvimento: resolução de algoritmos completos com vetores, matrizes e structs.",
        "(30 min) Bloco 3 — Reflexão: análise crítica de código legado, justificativas e estimativas de complexidade.",
        "(10 min) Revisão final e entrega: conferência de respostas, organização dos materiais e assinatura de recebimento."
      ]
    },
    {
      "type": "lessonPlan",
      "title": "Roteiro operacional da NP3",
      "cards": [
        {
          "icon": "check-circle",
          "title": "Bloco 0 — Conduta",
          "content": "Explique normas de sigilo, desligamento de dispositivos e procedimento para dúvidas antes do início da contagem de tempo."
        },
        {
          "icon": "book-open",
          "title": "Bloco 1 — Diagnóstico",
          "content": "Liberado após orientações; alunos respondem perguntas de múltipla escolha e pequenos algoritmos (25 min)."
        },
        {
          "icon": "code",
          "title": "Bloco 2 — Desenvolvimento",
          "content": "Questões de implementação em C com suporte a rascunho. Professores registram dúvidas frequentes no quadro (45 min)."
        },
        {
          "icon": "target",
          "title": "Bloco 3 — Revisão crítica",
          "content": "Análise de código legado e perguntas discursivas orientadas à justificativa de escolhas (30 min)."
        },
        {
          "icon": "tasks",
          "title": "Bloco 4 — Encerramento",
          "content": "Colete provas, rascunhos e listas de presença; confirme recibo de entrega e orientações para devolutiva (10 min)."
        }
      ]
    },
    {
      "type": "cardGrid",
      "title": "Rubrica oficial NP3",
      "cards": [
        {
          "title": "Corretude — 40%",
          "content": "Implementa solução que compila, atende aos requisitos e trata casos de borda (entradas inválidas, limites de loops)."
        },
        {
          "title": "Estrutura e modularização — 25%",
          "content": "Organiza o código em funções coesas, usa variáveis bem nomeadas e respeita o fluxo proposto no enunciado."
        },
        {
          "title": "Domínio de dados — 20%",
          "content": "Manipula vetores, matrizes e structs com precisão, mantendo integridade e desempenho aceitável."
        },
        {
          "title": "Clareza comunicativa — 15%",
          "content": "Apresenta comentários breves, justificativas e rascunhos legíveis, apoiando a correção e a rastreabilidade da solução."
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "Estrutura da avaliação",
      "content": [
        {
          "type": "orderedList",
          "items": [
            {
              "title": "Parte 1 — Diagnóstico",
              "text": "Questões curtas para confirmar domínio de sintaxe, operadores e leitura de tabelas verdade."
            },
            {
              "title": "Parte 2 — Desenvolvimento",
              "text": "Problemas que pedem construção de algoritmos completos com vetores/matrizes e decisões encadeadas."
            },
            {
              "title": "Parte 3 — Reflexão",
              "text": "Questões sobre manutenção de código: justificar escolhas, propor refatorações ou estimar complexidade."
            }
          ]
        },
        {
          "type": "paragraph",
          "text": "Utilize rascunho para mapear as etapas do algoritmo antes de codificar. A clareza na apresentação vale pontos."
        },
        {
          "type": "paragraph",
          "text": "Sinalize dúvidas levantando a mão; deslocamentos só são autorizados com acompanhamento do fiscal."
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "Critérios de avaliação",
      "content": [
        {
          "type": "subBlock",
          "title": "Como a nota é distribuída",
          "items": [
            "Corretude (40%): resultados esperados, tratamento de bordas e validação de entrada.",
            "Estrutura (25%): uso apropriado de laços, decisões e funções para organizar o algoritmo.",
            "Dados (20%): manipulação correta de vetores, matrizes e registros, incluindo índices e inicializações.",
            "Apresentação (15%): indentação, nomenclatura consistente e explicações concisas quando solicitadas."
          ]
        },
        {
          "type": "callout",
          "variant": "info",
          "title": "Dica",
          "content": [
            {
              "type": "paragraph",
              "text": "Releia a rubrica oficial disponível no Ambiente Virtual para alinhar expectativas e autoavaliação."
            }
          ]
        }
      ]
    },
    {
      "type": "callout",
      "variant": "good-practice",
      "title": "Checklist final",
      "content": [
        {
          "type": "paragraph",
          "text": "Revisar exercícios integradores, praticar leitura de código legado e simular a prova com tempo cronometrado."
        }
      ]
    },
    {
      "type": "callout",
      "variant": "warning",
      "title": "Conduta",
      "content": [
        {
          "type": "paragraph",
          "text": "Prova individual, sem consulta. Entregue todo material de rascunho ao final e mantenha dispositivos desligados."
        },
        {
          "type": "unorderedList",
          "items": [
            {
              "text": "Chegue com 15 minutos de antecedência para acomodação e conferência de documentos."
            },
            {
              "text": "Durante os blocos 1 e 2, somente perguntas de compreensão do enunciado serão respondidas."
            },
            {
              "text": "Saídas ao banheiro são registradas e realizadas uma pessoa por vez, com supervisão."
            },
            { "text": "Assine a lista de presença e o recibo de entrega antes de deixar a sala." }
          ]
        }
      ]
    },
    {
      "type": "callout",
      "variant": "info",
      "title": "TED pós-aula",
      "content": [
        {
          "type": "paragraph",
          "text": "Esta aula substitui a TED por atividades avaliativas presenciais. Utilize o tempo pós-aula para registrar percepções e organizar as evidências."
        },
        {
          "type": "unorderedList",
          "items": [
            {
              "text": "Preencha o formulário de percepção pós-avaliação disponível no Moodle até 23h59."
            },
            {
              "text": "Arquive digitalmente a prova escaneada ou registrada conforme orientação institucional."
            },
            {
              "text": "Anote dúvidas específicas para a devolutiva coletiva."
            }
          ]
        }
      ]
    }
  ],
  "metadata": {
    "status": "published",
    "updatedAt": "2025-03-11T12:00:00.000Z",
    "owners": ["Prof. Tiago Sombra"],
    "sources": [
      "Plano pedagógico Algoritmos I 2025.1",
      "Ata pedagógica de revisão 2024-12",
      "Guia operacional de avaliações NP3 2025"
    ]
  },
  "formatVersion": "md3.lesson.v1",
  "slug": "avaliacao-np3",
  "summary": "Avaliação integradora que cobre todo o percurso da disciplina, exigindo aplicação articulada de lógica, estruturas de dados básicas e modularização.",
  "objectives": [
    "Avaliar domínio de algoritmos sequenciais, condicionais e iterativos.",
    "Verificar a manipulação correta de vetores, matrizes e registros.",
    "Mensurar a habilidade de decompor problemas complexos com funções."
  ],
  "competencies": [
    "Pensamento computacional avançado",
    "Estruturação e análise de algoritmos",
    "Modelagem de dados em baixo nível"
  ],
  "skills": [
    "Selecionar estruturas de controle adequadas a diferentes cenários.",
    "Implementar operações sobre coleções lineares com eficiência.",
    "Comunicar soluções completas em pseudocódigo e fluxogramas."
  ],
  "outcomes": [
    "Resolve questões integradoras que combinam múltiplas estruturas de dados.",
    "Justifica escolhas algorítmicas considerando corretude e clareza.",
    "Entrega documentação organizada que facilita a leitura do avaliador."
  ],
  "prerequisites": [
    "Todos os conteúdos das Unidades I a V da disciplina.",
    "Prática prévia com listas de exercícios integradoras."
  ],
  "tags": ["avaliacao", "algoritmos", "integrador"],
  "duration": 120,
  "modality": "in-person",
  "resources": [
    {
      "label": "Roteiro de revisão NP3",
      "url": "https://example.edu/algi/roteiro-np3",
      "type": "guide"
    },
    {
      "label": "Checklist de preparação para avaliações integrais",
      "url": "https://example.edu/algi/checklist-integrador",
      "type": "checklist"
    },
    {
      "label": "OnlineGDB - Projeto C pré-configurado",
      "type": "tool",
      "url": "https://onlinegdb.com/7JwALg8qH"
    },
    {
      "label": "Replit - Workspace Algoritmos I",
      "type": "tool",
      "url": "https://replit.com/@md3-education/algi-template"
    },
    {
      "label": "VS Code - Template C com CMake",
      "type": "repository",
      "url": "https://github.com/md3-education/algi-c-template"
    },
    {
      "label": "Planilha de preparação pré-aula",
      "type": "spreadsheet",
      "url": "https://docs.google.com/spreadsheets/d/1ALGIprepTemplate"
    }
  ],
  "bibliography": [
    "MANZANO, J. A. N. Algoritmos – Lógica para Desenvolvimento de Programos. Saraiva, 2022.",
    "SZWARCFITER, J. L.; MARKENZON, L. Estruturas de Dados e seus Algoritmos. LTC, 2021."
  ],
  "assessment": {
    "type": "summative",
    "description": "Prova NP3 presencial com questões discursivas e problemas de implementação."
  }
}
