{
  "id": "lesson-07",
  "title": "Aula 7: Homeostase e Adaptação Organizacional",
  "objective": "Compreender os mecanismos que permitem que os sistemas organizacionais mantenham equilíbrio diante de estímulos externos e se adaptem às mudanças.",
  "content": [
    {
      "type": "lessonPlan",
      "title": "Plano da Aula",
      "cards": [
        {
          "icon": "book-open",
          "title": "CONTEÚDO",
          "content": "Unidade II – A organização como um sistema aberto. Homeostase organizacional; adaptação e autorregulação nos sistemas."
        },
        {
          "icon": "bullseye",
          "title": "OBJETIVO ESPECÍFICO",
          "content": "Compreender os mecanismos que permitem que os sistemas organizacionais mantenham equilíbrio diante de estímulos externos e se adaptem às mudanças."
        },
        {
          "icon": "gears",
          "title": "METODOLOGIA E RECURSOS",
          "content": "Aula expositiva dialogada com uso de analogias biológicas, exemplos contemporâneos e esquemas visuais."
        }
      ]
    },
    {
      "type": "callout",
      "variant": "info",
      "title": "Pergunta Norteadora",
      "content": [
        {
          "type": "paragraph",
          "text": "Como o termostato do ar-condicionado, que liga e desliga para manter a sala a 22°C, se parece com a forma como o gerente de uma loja ajusta o estoque de um produto que está a vender muito ou pouco?"
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "🌡️ O Termostato Organizacional: Equilíbrio em Meio ao Caos",
      "content": [
        {
          "type": "paragraph",
          "text": "Se as organizações são sistemas abertos em constante interação com um ambiente turbulento, como é que elas não se desintegram? A resposta está em dois conceitos-chave emprestados da biologia e da cibernética: homeostase e autorregulação."
        },
        {
          "type": "paragraph",
          "text": "A homeostase é a capacidade de um sistema manter um estado de equilíbrio interno dinâmico, mesmo quando o ambiente externo muda drasticamente. Pense no corpo humano mantendo a temperatura em torno de 36,5°C, seja num dia de calor intenso ou de frio rigoroso. As organizações bem-sucedidas fazem o mesmo: ajustam as suas operações, estratégias e recursos para se manterem estáveis e funcionais perante crises económicas, novas tecnologias ou a entrada de concorrentes. O mecanismo por trás dessa magia é a autorregulação, impulsionada pelos ciclos de feedback que já estudámos."
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "🎯 Modelo de Controle: do Setpoint à Ação",
      "content": [
        {
          "type": "list",
          "items": [
            "Variável controlada: nível de serviço (OTIF), tempo médio de atendimento, taxa de defeitos.",
            "Setpoint (meta): alvo desejado (ex.: OTIF ≥ 96%).",
            "Sensor (medição): KPI/telemetria/encuestas NPS/ERP.",
            "Controlador (regra/política): gatilhos de decisão (ex.: reabastecer, escalonar, abrir turno).",
            "Atuador (ação física/digital): compra de insumos, alocação de equipe, ajuste de preço.",
            "Distúrbios & atrasos: sazonalidade, ruptura de fornecedor, tempo de aprovação, fila de TI."
          ]
        },
        {
          "type": "image",
          "src": "https://sombraprof.github.io/tgs/imagens/aula_7_imagem_1.svg",
          "alt": "Loop de Controle Homeostático"
        }
      ]
    },
    {
      "type": "md3Table",
      "title": "Os Dois Lados do Feedback: Estabilizar ou Amplificar?",
      "headers": ["➖ Feedback Negativo (de Equilíbrio)", "➕ Feedback Positivo (de Reforço)"],
      "rows": [
        [
          "Busca estabilizar o sistema, corrigindo desvios para retornar a um estado desejado. Age como um freio.",
          "Busca amplificar uma tendência, criando um efeito \"bola de neve\" que afasta o sistema do seu estado inicial. Age como um acelerador."
        ],
        [
          "Analogia: O termostato do ar-condicionado. Se a temperatura sobe, ele liga para resfriar. Se arrefece demais, ele desliga.",
          "Analogia: Um microfone perto da sua própria caixa de som. O som é captado, amplificado, emitido, captado novamente e amplificado, gerando microfonia."
        ],
        [
          "Exemplos organizacionais:\n- Controle de estoque: se o nível cai abaixo do mínimo, o sistema gera uma ordem de compra.\n- Gestão de projetos: atraso aciona alocação extra de recursos.\n- Suporte ao cliente: aumento de reclamações leva à revisão do processo.",
          "Exemplos organizacionais:\n- Marketing viral: um post popular gera mais visualizações e partilhas.\n- Crise de reputação: notícias negativas provocam queda nas ações e mais notícias negativas.\n- Efeito de rede (Uber/iFood): mais usuários atraem mais parceiros, reforçando o serviço."
        ]
      ]
    },
    {
      "type": "contentBlock",
      "title": "📦 Controle de Estoque como Loop de Feedback",
      "content": [
        {
          "type": "image",
          "src": "https://sombraprof.github.io/tgs/imagens/aula_7_imagem_2.svg",
          "alt": "CLD de Estoque (Feedback Negativo)"
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "⏩ Feedforward & 🔄 Alostase",
      "content": [
        {
          "type": "paragraph",
          "text": "Feedforward antecipa perturbações antes do erro aparecer na saída. Exemplos: reabastecimento sazonal com base em previsão, autoscaling de servidores por tendência de tráfego."
        },
        {
          "type": "paragraph",
          "text": "Alostase é a capacidade do sistema de ajustar o setpoint (meta) quando o ambiente muda de forma persistente (ex.: rever prazo \"padrão\" de entrega em mercados com nova logística urbana)."
        },
        {
          "type": "md3Table",
          "headers": ["Técnica", "Quando usar", "Risco comum"],
          "rows": [
            [
              "Feedback (negativo)",
              "Desvio pontual do alvo",
              "Oscilação se atrasos/histerese mal configurados"
            ],
            [
              "Feedforward",
              "Antecipar sazonalidade/rupturas",
              "Previsão ruim gera sobre/baixo ajuste"
            ],
            [
              "Alostase",
              "Novo \"normal\" no ambiente",
              "Mudar metas cedo demais (perde comparabilidade)"
            ]
          ]
        }
      ]
    },
    {
      "type": "videosBlock",
      "title": "🎬 Vídeos para fixar o conteúdo",
      "videos": [
        {
          "youtubeId": "CWJ8KDM5PAY",
          "title": "Pensamento Sistêmico: relações causais e ciclos de feedback (aplicação em organizações)"
        },
        {
          "youtubeId": "TlwpY5pHveM",
          "title": "Teoria dos Sistemas | Organização como Sistema Aberto — visão sistêmica na Administração"
        }
      ]
    },
    {
      "type": "callout",
      "variant": "good-practice",
      "title": "🦠 Estudo de Caso: Resposta Organizacional à Pandemia",
      "content": [
        {
          "type": "paragraph",
          "text": "A pandemia de COVID-19 foi um dos maiores estímulos ambientais da história recente. As empresas que sobreviveram foram as que melhor se autorregularam. Em grupo, discutam:"
        },
        {
          "type": "list",
          "ordered": true,
          "items": [
            "O trabalho remoto emergiu como um estímulo que exigiu qual tipo de feedback para a maioria das empresas?",
            "O aumento da procura por streaming e delivery representa feedback positivo ou negativo? Justifique.",
            "Como sistemas de informação (colaboração, e-commerce, logística) ajudaram a buscar um novo equilíbrio?"
          ]
        }
      ]
    },
    {
      "type": "cardGrid",
      "title": "📈 Indicadores que Regulam o Sistema",
      "cards": [
        {
          "title": "Leading vs Lagging",
          "content": "- Leading (antecipam): tempo de picking, fila no chat, taxa de abandono do carrinho. - Lagging (resultados): OTIF, NPS mensal, ticket médio."
        },
        {
          "title": "Histerese (faixa de tolerância)",
          "content": "Evita \"liga-desliga\" constante: só agir quando a variável sai de uma faixa (ex.: 94–98% de OTIF)."
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "📝 Tarefa (TED): Resposta Argumentativa",
      "content": [
        {
          "type": "paragraph",
          "text": "Para a próxima aula, você deverá produzir uma resposta argumentativa curta, baseada nos conceitos de adaptação e autorregulação."
        },
        {
          "type": "blockquote",
          "text": "\"Em sua opinião, o home office tornou as empresas mais adaptáveis? Por quê?\""
        },
        {
          "type": "list",
          "title": "Instruções:",
          "items": [
            "Elabore uma resposta curta e objetiva (um ou dois parágrafos).",
            "Use os conceitos de sistema aberto, ambiente e feedback na sua argumentação.",
            "Poste a sua resposta no fórum da disciplina no AVA. Prepare-se para comentar sobre o tema na próxima aula."
          ]
        }
      ]
    },
    {
      "type": "accordion",
      "title": "🧐 Mini-Quiz de Autoavaliação",
      "items": [
        {
          "title": "1. Quando um banco central aumenta as taxas de juro para controlar a inflação, está a aplicar um ciclo de feedback...",
          "content": "Resposta: Negativo (de Equilíbrio). O objetivo é corrigir um desvio (inflação alta) e trazer o sistema económico de volta a um estado de estabilidade."
        },
        {
          "title": "2. A capacidade de uma organização manter a sua cultura e identidade mesmo após uma grande mudança, como uma fusão, é um exemplo de...",
          "content": "Resposta: Homeostase. É a tendência do sistema de manter as suas variáveis internas essenciais estáveis, apesar das perturbações externas."
        },
        {
          "title": "3. Verdadeiro ou Falso: Em sistemas de informação, o feedback positivo é sempre desejável.",
          "content": "Resposta: Falso. O feedback positivo pode ser desejável (ex: marketing viral), mas também pode ser perigoso (ex: uma pequena falha de sistema que causa uma sobrecarga em cascata e derruba todo o serviço)."
        }
      ]
    },
    {
      "type": "accordion",
      "title": "📑 Glossário & Leituras",
      "items": [
        {
          "title": "Glossário rápido",
          "content": "- SIPOC: Fornecedores-Entradas-Processo-Saídas-Clientes.\n- VSM: Mapeamento do Fluxo de Valor (tempo de espera vs. processamento).\n- WMS/TMS/ERP: Sistemas que orquestram fluxos de informação e materiais."
        },
        {
          "title": "Leituras curtas sugeridas",
          "content": "- Cap. introdutórios de cadeias de suprimentos (qualquer manual de logística).\n- Capítulos sobre processos e métricas nos livros já citados (Stair & Reynolds; Silva et al.)."
        }
      ]
    },
    {
      "type": "bibliographyBlock",
      "title": "📚 Bibliografia",
      "references": [
        "MEIRELES, Manuel; SORDI, J. O. de. Administração de sistemas de informação. 2. ed. São Paulo: Atlas, 2019.",
        "IMONIANA, Joshua Onome. Auditoria de sistemas de informação. 3. ed. São Paulo: Atlas, 2016."
      ]
    }
  ],
  "formatVersion": "md3.lesson.v1",
  "slug": "aula-7-homeostase-e-adaptacao-organizacional",
  "summary": "Explora o tema \"Homeostase e Adaptação Organizacional\" conectando teoria e prática para compreender os mecanismos que permitem que os sistemas organizacionais mantenham equilíbrio diante de estímulos externos e se adaptem às mudanças..",
  "objectives": [
    "Compreender os mecanismos que permitem que os sistemas organizacionais mantenham equilíbrio diante de estímulos externos e se adaptem às mudanças.",
    "Relacionar conceitos da aula a desafios organizacionais reais.",
    "Planejar como aplicar os aprendizados em projetos acadêmicos ou profissionais."
  ],
  "competencies": [
    "Pensamento sistêmico aplicado",
    "Análise crítica organizacional",
    "Comunicação interdisciplinar"
  ],
  "skills": [
    "Elaborar sínteses estruturadas sobre o tema da aula.",
    "Conectar evidências práticas aos fundamentos teóricos.",
    "Registrar recomendações acionáveis para a organização estudada."
  ],
  "outcomes": [
    "Produz análise alinhada ao foco sistêmico da aula.",
    "Apresenta argumentos que sustentam decisões de gestão.",
    "Documenta próximos passos para aprofundar o tema em projetos."
  ],
  "prerequisites": [
    "Revisar conceitos fundamentais das aulas anteriores.",
    "Ler o material preparatório indicado no AVA."
  ],
  "tags": ["aula-7-homeostase"],
  "duration": 110,
  "modality": "in-person",
  "resources": [
    {
      "label": "Guia de apoio da aula",
      "url": "https://example.edu/tgs/apoio-aula",
      "type": "guide"
    },
    {
      "label": "Estudo de caso para discussão",
      "url": "https://example.edu/tgs/caso-estudo",
      "type": "case"
    }
  ],
  "bibliography": [
    "BERTALANFFY, L. Teoria Geral dos Sistemas. Vozes, 2015.",
    "SENGE, P. A Quinta Disciplina. Best Seller, 2020."
  ],
  "assessment": {
    "type": "formative",
    "description": "Registro reflexivo no portfólio com evidências da aprendizagem da aula."
  },
  "metadata": {
    "status": "published",
    "updatedAt": "2025-02-08T00:00:00.000Z",
    "owners": ["Profa. Marina Duarte"],
    "sources": ["Plano de ensino TGS 2025.1"]
  }
}
