{
  "id": "lesson-14",
  "title": "Aula 14: Correção e Feedback da NP1",
  "objective": "Revisar a avaliação NP1, consolidar aprendizados e orientar próximos passos.",
  "content": [
    {
      "type": "lessonPlan",
      "title": "Plano da Aula",
      "cards": [
        {
          "icon": "check-circle",
          "title": "CONTEÚDO",
          "content": "Panorama geral do desempenho na NP1, análise coletiva de itens-chave e planejamento de reforço."
        },
        {
          "icon": "bullseye",
          "title": "OBJETIVOS",
          "content": "- Entender critérios de correção e oportunidades de melhoria.\n- Comparar abordagens adotadas pelas equipes.\n- Definir planos individuais de estudo para a próxima etapa."
        },
        {
          "icon": "users",
          "title": "METODOLOGIA",
          "content": "Devolutiva dialogada, estudo de caso com respostas-modelo, debate orientado e demonstração de boas práticas de resolução."
        }
      ]
    },
    {
      "type": "timeline",
      "title": "Como conduziremos a devolutiva",
      "steps": [
        {
          "title": "Aquecimento",
          "content": "Apresentação dos indicadores gerais (média, dispersão, questões mais desafiadoras) e combinados para a conversa."
        },
        {
          "title": "Estudo de Caso: Questão 2",
          "content": "Releitura coletiva do enunciado e comparação entre uma resposta incompleta e outra exemplar, destacando critérios de pontuação."
        },
        {
          "title": "Demonstração guiada",
          "content": "O docente reconstrói, passo a passo, a estratégia de resolução para um item que gerou maior índice de erro."
        },
        {
          "title": "Debate em duplas",
          "content": "Duplas discutem decisões adotadas na prova e registram aprendizados em um canvas de melhorias."
        },
        {
          "title": "Planejamento",
          "content": "Cada estudante elabora um plano de reforço com foco nas competências que precisam ser consolidadas para as próximas avaliações."
        }
      ]
    },
    {
      "type": "cardGrid",
      "title": "Indicadores para observar",
      "cards": [
        {
          "title": "Acertos conceituais",
          "content": "Identifique quais conceitos de TGS foram utilizados corretamente e quais precisam de revisão."
        },
        {
          "title": "Argumentação",
          "content": "Avalie se a resposta explicita conexões sistêmicas (entradas, processos, feedbacks) de forma lógica."
        },
        {
          "title": "Gestão do tempo",
          "content": "Reflita sobre como distribuiu o tempo entre questões e quais estratégias podem otimizar a próxima prova."
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "Debate orientado",
      "content": [
        {
          "type": "paragraph",
          "text": "Forme um círculo rápido com colegas que atingiram resultados distintos. Cada pessoa compartilha uma decisão acertada e um ponto a melhorar na prova."
        },
        {
          "type": "paragraph",
          "text": "Use perguntas disparadoras: Qual conceito você aplicaria diferente? Como garantir que os exemplos contemplem a visão sistêmica completa?"
        }
      ]
    },
    {
      "type": "callout",
      "variant": "good-practice",
      "title": "Checklist rápido pós-NP1",
      "content": [
        {
          "type": "list",
          "ordered": false,
          "items": [
            "Atualizei meus resumos com os pontos sinalizados na correção?",
            "Organizei dúvidas para levar ao plantão ou fórum?",
            "Combinei com o grupo como aplicar o feedback no projeto integrador?"
          ]
        }
      ]
    },
    {
      "type": "checklist",
      "title": "Plano individual",
      "items": [
        "Registrar três prioridades de estudo para as próximas semanas.",
        "Identificar materiais de apoio disponíveis no AVA.",
        "Agendar momento de revisão conjunta com colegas."
      ]
    },
    {
      "type": "callout",
      "variant": "task",
      "title": "TED",
      "content": [
        {
          "type": "paragraph",
          "text": "Publique no AVA, até às 23h59 de hoje, um registro reflexivo com: (1) o principal aprendizado da devolutiva, (2) um compromisso de melhoria e (3) o material que pretende consultar para reforço. Anexe o canvas de melhorias preenchido pela dupla."
        }
      ]
    }
  ],
  "formatVersion": "md3.lesson.v1",
  "slug": "aula-14-correcao-e-feedback-da-np1",
  "summary": "Realiza a devolutiva estruturada da NP1, promovendo reflexão crítica e planejamento de reforço com base nos critérios de correção.",
  "objectives": [
    "Compreender a distribuição de desempenho e os critérios usados na correção da NP1.",
    "Comparar respostas reais e identificar boas práticas de argumentação sistêmica.",
    "Planejar ações de reforço alinhadas às competências da disciplina."
  ],
  "competencies": [
    "Pensamento sistêmico aplicado",
    "Autoavaliação acadêmica",
    "Planejamento de aprendizagem"
  ],
  "skills": [
    "Interpretar feedbacks qualitativos e quantitativos.",
    "Argumentar com base em evidências coletivas.",
    "Definir metas de estudo coerentes com lacunas identificadas."
  ],
  "outcomes": [
    "Atualiza o portfólio com reflexões sobre a NP1.",
    "Ajusta estratégias individuais de estudo e participação.",
    "Integra o feedback ao projeto integrador da turma."
  ],
  "prerequisites": [
    "Trazer a prova NP1 corrigida.",
    "Revisar as anotações pessoais feitas durante a avaliação."
  ],
  "tags": ["aula-14-np1"],
  "duration": 110,
  "modality": "in-person",
  "resources": [
    {
      "label": "Relatório analítico da NP1",
      "url": "https://example.edu/tgs/np1/relatorio",
      "type": "report"
    },
    {
      "label": "Canvas de melhorias",
      "url": "https://example.edu/tgs/modelos/canvas-melhorias",
      "type": "template"
    }
  ],
  "bibliography": [
    "BERTALANFFY, L. Teoria Geral dos Sistemas. Vozes, 2015.",
    "SENGE, P. A Quinta Disciplina. Best Seller, 2020."
  ],
  "assessment": {
    "type": "formative",
    "description": "Registro reflexivo e plano de ação publicados no AVA."
  },
  "metadata": {
    "status": "draft",
    "updatedAt": "2025-02-10T00:00:00.000Z",
    "owners": ["Profa. Marina Duarte"],
    "sources": ["Plano de ensino TGS 2025.1"]
  }
}
