{
  "id": "lesson-14",
  "title": "Aula 28: Avaliação – NP2",
  "objective": "Mensurar a capacidade de aplicar pensamento sistêmico na análise de organizações complexas.",
  "content": [
    {
      "type": "flightPlan",
      "title": "Plano da avaliação",
      "items": [
        "Data e duração: Prova NP2 presencial com 110 minutos de duração.",
        "Foco: Aplicar pensamento sistêmico em estudos de caso envolvendo homeostase, feedback e fronteiras.",
        "Formato: Questões discursivas e análise de diagramas fornecidos.",
        "Preparação: Revisar aulas 6 a 10, anotações de laboratório e discussões no fórum.",
        "Pós-prova: Registrar percepções e dúvidas para a devolutiva coletiva."
      ]
    },
    {
      "type": "cardGrid",
      "title": "Competências avaliadas",
      "cards": [
        {
          "title": "Modelagem",
          "content": "Representar fluxos e loops de feedback destacando variáveis críticas."
        },
        {
          "title": "Diagnóstico",
          "content": "Identificar causas raiz e pontos de ruptura em sistemas abertos."
        },
        {
          "title": "Intervenção",
          "content": "Propor ações que preservem homeostase ou conduzam à transformação desejada."
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "Estrutura da prova",
      "content": [
        {
          "type": "orderedList",
          "items": [
            {
              "title": "Questão 1 — Análise de contexto",
              "text": "Leia o caso apresentado, identifique fronteiras, atores e indicadores de saúde do sistema."
            },
            {
              "title": "Questão 2 — Loop de feedback",
              "text": "Construa um diagrama apontando loops reforçadores e balanceadores, sugerindo métricas de monitoramento."
            },
            {
              "title": "Questão 3 — Plano de ação",
              "text": "Descreva intervenções possíveis, justificando impactos esperados a curto e médio prazo."
            }
          ]
        },
        {
          "type": "paragraph",
          "text": "Cada resposta deve combinar conceitos teóricos, exemplos práticos e linguagem clara. Utilize o tempo inicial para planejar a estrutura antes de escrever."
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "Critérios de correção",
      "content": [
        {
          "type": "subBlock",
          "title": "Rubrica resumida",
          "items": [
            "Compreensão sistêmica (40%): capacidade de mapear elementos, interações e contextos.",
            "Aplicação conceitual (35%): uso adequado de termos como homeostase, entropia, sinergia.",
            "Clareza e argumentação (15%): estrutura lógica, coesão textual e referências a evidências.",
            "Inovação (10%): propostas criativas viáveis e alinhadas à realidade apresentada."
          ]
        }
      ]
    },
    {
      "type": "callout",
      "variant": "warning",
      "title": "Orientações logísticas",
      "content": [
        {
          "type": "paragraph",
          "text": "Prova individual, sem consulta. Trazer documento oficial com foto e caneta azul ou preta. Dispositivos devem permanecer desligados."
        }
      ]
    },
    {
      "type": "callout",
      "variant": "info",
      "title": "Checklist de preparação",
      "content": [
        {
          "type": "paragraph",
          "text": "Revise mapas produzidos em sala, refaça ao menos um exercício de loops de feedback e organize um resumo dos conceitos-chave."
        }
      ]
    }
  ],
  "formatVersion": "md3.lesson.v1",
  "slug": "aula-28-avaliacao-np2",
  "summary": "Avaliação NP2 voltada à síntese de sistemas abertos, fluxos e homeostase, articulando teoria e estudos de caso.",
  "objectives": [
    "Analisar fluxos e mecanismos de adaptação em situações propostas.",
    "Conectar conceitos de homeostase, feedback e transformação organizacional.",
    "Elaborar respostas com recomendações práticas alinhadas aos conceitos."
  ],
  "competencies": ["Pensamento sistêmico avançado", "Tomada de decisão", "Comunicação escrita"],
  "skills": [
    "Interpretar cenários complexos sob a ótica sistêmica.",
    "Produzir argumentos alinhados às evidências fornecidas.",
    "Organizar respostas com clareza e estrutura lógica."
  ],
  "outcomes": [
    "Entrega respostas coesas para questões situacionais.",
    "Demonstra domínio da terminologia e dos modelos estudados.",
    "Propõe intervenções alinhadas à manutenção do equilíbrio organizacional."
  ],
  "prerequisites": [
    "Estudo das aulas 6 a 10.",
    "Revisão do material de homeostase e modelagem sistêmica."
  ],
  "tags": ["avaliacao", "np2", "pensamento-sistemico"],
  "duration": 110,
  "modality": "in-person",
  "resources": [
    {
      "label": "Guia de revisão NP2",
      "url": "https://example.edu/tgs/guia-np2",
      "type": "guide"
    },
    {
      "label": "Checklist de preparação",
      "url": "https://example.edu/tgs/checklist-np2",
      "type": "checklist"
    }
  ],
  "bibliography": [
    "BERTALANFFY, L. Teoria Geral dos Sistemas. Vozes, 2015.",
    "SENGE, P. A Quinta Disciplina. Best Seller, 2020."
  ],
  "assessment": {
    "type": "summative",
    "description": "Prova presencial NP2 com estudos de caso e questões discursivas."
  },
  "metadata": {
    "status": "published",
    "updatedAt": "2025-02-08T00:00:00.000Z",
    "owners": ["Prof. Tiago Sombra"],
    "sources": ["Plano de ensino TGS 2025.1"]
  }
}
