{
  "id": "lesson-04",
  "title": "Aula 4: Tipos de Sistemas: Classificações e Exemplos",
  "objective": "Diferenciar tipos de sistemas e relacioná-los a casos reais.",
  "content": [
    {
      "type": "lessonPlan",
      "title": "Plano da Aula",
      "cards": [
        {
          "icon": "book-open",
          "title": "CONTEÚDO",
          "content": "Unidade I – Definição e Tipos de Sistemas. Tipos de sistemas: abertos x fechados, estáveis x dinâmicos, permanentes x temporários."
        },
        {
          "icon": "bullseye",
          "title": "OBJETIVO ESPECÍFICO",
          "content": "Diferenciar os tipos de sistemas a partir de suas características principais e analisar exemplos de sua aplicação prática em diferentes contextos organizacionais."
        },
        {
          "icon": "gears",
          "title": "METODOLOGIA E RECURSOS",
          "content": "Estudo de caso em grupo (metodologia ativa) para análise de sistemas reais, com uso de quadro ou lousa digital."
        }
      ]
    },
    {
      "type": "callout",
      "variant": "info",
      "title": "Pergunta Norteadora",
      "content": [
        {
          "type": "paragraph",
          "text": "Por que uma rede social como o Instagram precisa se atualizar constantemente, enquanto as regras do xadrez permanecem as mesmas por séculos? O que isso nos diz sobre os diferentes tipos de sistemas?"
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "🗂️ Por que Classificar Sistemas?",
      "content": [
        {
          "type": "paragraph",
          "text": "Depois de entendermos a anatomia de um sistema, o próximo passo é aprender a classificá-lo. Assim como um biólogo classifica os seres vivos para entender seus comportamentos e relações, um analista de sistemas classifica os sistemas para prever seu comportamento, entender suas necessidades e escolher a melhor abordagem para projetá-los ou gerenciá-los. A TGS de Bertalanffy nos deu a base para entender as organizações como sistemas abertos, e essa classificação é a ferramenta que usamos para modelá-los."
        },
        {
          "type": "paragraph",
          "text": "Saber se um sistema de informação, como um ERP ou um CRM, é aberto ou fechado, dinâmico ou estável, nos ajuda a tomar decisões cruciais. Um sistema dinâmico, por exemplo, exigirá uma arquitetura de software flexível e escalável, enquanto um sistema estável pode priorizar a segurança e a robustez. Esta aula nos dará as ferramentas para fazer essa diferenciação."
        }
      ]
    },
    {
      "type": "md3Table",
      "title": "Tabela Comparativa de Tipos de Sistemas",
      "headers": [
        "Critério",
        "Tipo 1",
        "Característica Principal e Exemplos",
        "Tipo 2",
        "Característica Principal e Exemplos"
      ],
      "rows": [
        [
          "Interação com o Ambiente",
          "Aberto",
          "Troca constante de energia e informação com o ambiente. É adaptativo. Ex: Uma empresa (social), o Google Search (SI), um ecossistema (natural).",
          "Fechado",
          "Interação mínima ou nula com o ambiente. Comportamento previsível. Ex: Um relógio de corda (físico), uma reação química isolada (natural)."
        ],
        [
          "Resposta à Mudança",
          "Dinâmico",
          "Muda constantemente em resposta a estímulos. É flexível e evolutivo. Ex: O app da Uber (SI), o clima (natural), o mercado de ações (social).",
          "Estável (ou Estático)",
          "Resiste a mudanças e busca manter o equilíbrio (homeostase). Ex: As regras do xadrez (social), um sistema de controle de versão como o Git (SI)."
        ],
        [
          "Duração no Tempo",
          "Permanente",
          "Projetado para existir por um longo e indeterminado período. Ex: Uma universidade (social), um sistema operacional como o Windows (SI).",
          "Temporário",
          "Criado com um propósito específico e um ciclo de vida definido. Ex: Um projeto de software (SI), a organização de um evento (social)."
        ]
      ]
    },
    {
      "type": "contentBlock",
      "title": "📌 Aplicação em Sistemas de Informação",
      "content": [
        {
          "type": "paragraph",
          "text": "A classificação de um sistema não é um exercício puramente acadêmico; ela tem implicações diretas no design e na arquitetura de software."
        },
        {
          "type": "list",
          "items": [
            "Sistemas Abertos e Dinâmicos (ex: redes sociais, e-commerce) exigem alta escalabilidade e interoperabilidade. Microsserviços e uso intensivo de APIs permitem evoluir partes do sistema de forma independente enquanto a segurança cuida das interações externas.",
            "Sistemas Fechados e Estáveis (ex: sistema de controle de um avião, software de uma urna eletrônica) priorizam segurança, confiabilidade e robustez. A arquitetura costuma ser monolítica, com testes exaustivos e integração rigidamente controlada."
          ]
        }
      ]
    },
    {
      "type": "cardGrid",
      "title": "🚨 Erros Comuns na Classificação",
      "cards": [
        {
          "title": "Confusão entre Aberto e Fechado em Software",
          "content": "Nenhum software é 100% fechado; ele sempre roda em um ambiente (sistema operacional). A classificação depende do grau de interação. Um sistema de backoffice com poucas integrações é \"relativamente fechado\" em comparação com uma API pública."
        },
        {
          "title": "Assumir que todo sistema dinâmico é caótico",
          "content": "Sistemas dinâmicos mudam, mas isso não significa que não tenham regras. O algoritmo do Google Search é extremamente dinâmico, mas opera com base em regras de ranqueamento muito bem definidas."
        },
        {
          "title": "Não identificar a mudança de classificação",
          "content": "Um sistema pode mudar sua natureza ao longo do tempo. Um projeto de software (temporário) pode se tornar um produto de sucesso que exige manutenção contínua (permanente)."
        }
      ]
    },
    {
      "type": "callout",
      "variant": "good-practice",
      "title": "👥 Metodologia Ativa: Estudo de Caso em Grupo",
      "content": [
        {
          "type": "paragraph",
          "text": "Agora é a hora de aplicar o conhecimento! Vamos nos dividir em grupos para analisar sistemas do mundo real."
        },
        {
          "type": "paragraph",
          "text": "Passo a passo:"
        },
        {
          "type": "list",
          "ordered": true,
          "items": [
            "Formem grupos de 3 a 4 pessoas.",
            "Escolham um sistema entre: sistema bancário, sistema de uma escola ou faculdade, aplicativo de delivery ou sistema de transporte público.",
            "Classifiquem o sistema selecionado usando os três critérios estudados.",
            "Preparem justificativas claras e exemplos práticos para cada classificação.",
            "Apresentem a análise e as conclusões para a turma."
          ]
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "📝 Tarefa (TED): Análise Comparativa",
      "content": [
        {
          "type": "paragraph",
          "text": "Para a próxima aula, você deverá fazer uma análise comparativa de dois sistemas com naturezas distintas."
        },
        {
          "type": "list",
          "title": "Instruções:",
          "items": [
            "Escolha dois sistemas que você utiliza: um aberto e dinâmico (ex.: rede social) e outro fechado e estável (ex.: editor de texto offline).",
            "Classifique cada sistema e justifique a escolha com exemplos práticos.",
            "Compare como as naturezas diferentes impactam a experiência do usuário.",
            "(Opcional) Produza um mini-diagrama ou tabela para ilustrar a comparação.",
            "(Reflexão) Considere os cuidados de arquitetura e banco de dados ao propor um novo recurso para o sistema dinâmico."
          ]
        },
        {
          "type": "paragraph",
          "text": "Entrega: Poste seu relato escrito no fórum da disciplina no Moodle."
        }
      ]
    },
    {
      "type": "accordion",
      "title": "🧐 Mini-Quiz de Autoavaliação",
      "items": [
        {
          "title": "1. Uma organização empresarial é um exemplo clássico de qual tipo de sistema?",
          "content": "Resposta: Aberto e Dinâmico. Aberto porque interage constantemente com clientes, fornecedores e o mercado. Dinâmico porque precisa se adaptar às mudanças para sobreviver e crescer."
        },
        {
          "title": "2. O sistema de regras de um jogo de tabuleiro, como o Banco Imobiliário, é melhor classificado como:",
          "content": "Resposta: Estável. As regras são fixas e não mudam durante o jogo, garantindo o equilíbrio e a previsibilidade."
        },
        {
          "title": "3. Verdadeiro ou Falso: Um projeto para desenvolver um novo aplicativo para a Copa do Mundo de 2026 é um exemplo de sistema permanente.",
          "content": "Resposta: Falso. É um sistema temporário, pois tem um objetivo claro e um prazo definido para terminar (o fim do evento)."
        }
      ]
    },
    {
      "type": "bibliographyBlock",
      "title": "📚 Bibliografia",
      "references": [
        "STAIR, Ralph M.; REYNOLDS, George W. Princípios de sistemas de informação. 14. ed. São Paulo: Cengage Learning, 2021.",
        "LAUDON, Kenneth C.; LAUDON, Jane P. Sistemas de Informação Gerenciais. 11. ed. São Paulo: Pearson Prentice Hall, 2014.",
        "PALMISANO, Angelo; ROSINI, Alessandro Marco. Administração de sistemas de informação e a gestão do conhecimento. 2. ed. São Paulo: Cengage Learning, 2012.",
        "BERTALANFFY, Ludwig von. Teoria Geral dos Sistemas. Petrópolis: Vozes, 2008.",
        "CHIAVENATO, Idalberto. Introdução à teoria geral da administração. 9. ed. Barueri: Manole, 2014."
      ]
    }
  ],
  "formatVersion": "md3.lesson.v1",
  "slug": "tipos-de-sistemas-classificacoes",
  "summary": "Explora classificações de sistemas (quanto à finalidade, estrutura e interação) ilustrando exemplos práticos no ambiente organizacional.",
  "objectives": [
    "Comparar classificações clássicas (abertos, fechados, naturais, artificiais).",
    "Identificar sistemas socio-técnicos em diferentes setores.",
    "Avaliar implicações das classificações para a gestão."
  ],
  "competencies": ["Análise comparativa", "Aplicação prática", "Gestão sistêmica"],
  "skills": [
    "Classificar sistemas apresentados em estudos de caso.",
    "Justificar escolhas de classificação com argumentos técnicos.",
    "Relacionar classificações a decisões gerenciais."
  ],
  "outcomes": [
    "Produz tabela comparativa de tipos de sistemas com exemplos.",
    "Argumenta sobre vantagens e limitações de cada classificação.",
    "Propõe indicadores para monitorar sistemas em cada categoria."
  ],
  "prerequisites": [
    "Conhecimento de componentes e características sistêmicas.",
    "Participação nas aulas iniciais."
  ],
  "tags": ["classificacao", "sistemas", "analise"],
  "duration": 110,
  "modality": "in-person",
  "resources": [
    {
      "label": "Tabela de classificação de sistemas",
      "url": "https://example.edu/tgs/tabela-classificacao",
      "type": "resource"
    },
    {
      "label": "Estudo de caso: Sistema de saúde",
      "url": "https://example.edu/tgs/case-saude",
      "type": "case"
    }
  ],
  "bibliography": [
    "CHIAVENATO, I. Teoria Geral da Administração. Elsevier, 2021.",
    "MORIN, E. Introdução ao Pensamento Complexo. Sulina, 2020."
  ],
  "assessment": {
    "type": "formative",
    "description": "Quadro colaborativo classificando sistemas apresentados pelos grupos."
  },
  "metadata": {
    "status": "published",
    "updatedAt": "2025-02-08T00:00:00.000Z",
    "owners": ["Prof. Tiago Sombra"],
    "sources": ["Plano de ensino TGS 2025.1"]
  }
}
