{
  "id": "lesson-15",
  "title": "Aula 15: Tipos de Sistemas Empresariais",
  "objective": "Analisar classificações de sistemas empresariais e relacioná-las a necessidades organizacionais.",
  "content": [
    {
      "type": "lessonPlan",
      "title": "Plano da Aula",
      "cards": [
        {
          "icon": "book-open",
          "title": "CONTEÚDOS",
          "content": "Panorama dos principais sistemas empresariais (ERP, CRM, SCM, BPM, BI) e critérios de seleção."
        },
        {
          "icon": "bullseye",
          "title": "OBJETIVOS",
          "content": "- Diferenciar categorias de sistemas empresariais.\n- Avaliar aderência de soluções a cenários reais.\n- Mapear impactos sistêmicos de cada escolha."
        },
        {
          "icon": "users",
          "title": "METODOLOGIA",
          "content": "Estudo de caso em squads, debate socrático e demonstração guiada de catálogo de soluções."
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "Por que existem tantos sistemas empresariais?",
      "content": [
        {
          "type": "paragraph",
          "text": "Cada sistema nasce para resolver uma dor específica do negócio. Quando avaliamos pela ótica sistêmica, enxergamos dependências, integrações e trade-offs que vão além do software isolado."
        },
        {
          "type": "paragraph",
          "text": "Laudon e Laudon (2024) lembram que sistemas de informação sustentam níveis estratégicos, táticos e operacionais simultaneamente, o que exige mapear processos ponta a ponta antes de decidir a tecnologia. Turban et al. (2023) reforçam que o valor surge quando dados, pessoas e governança estão alinhados às prioridades do negócio."
        },
        {
          "type": "callout",
          "variant": "info",
          "content": [
            {
              "type": "paragraph",
              "text": "Pergunta norteadora: quais fluxos de informação o sistema precisa orquestrar para gerar valor perceptível?"
            }
          ]
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "Referenciais clássicos",
      "content": [
        {
          "type": "paragraph",
          "text": "Davenport (2013) destaca que projetos de ERP e SCM só entregam vantagem competitiva quando traduzem métricas críticas em decisões do dia a dia. Hammer (2015) argumenta que iniciativas de BPM precisam redesenhar fluxos, e não apenas automatizar o caos existente. Já Porter e Heppelmann (2015) explicam como sensores IoT e analytics conectam operações físicas a plataformas digitais, abrindo espaço para modelos orientados a serviços."
        },
        {
          "type": "unorderedList",
          "items": [
            "ERP consolida dados estruturados para sincronizar áreas de backoffice (Davenport, 2013).",
            "CRM orquestra interações personalizadas quando integra marketing, vendas e atendimento (Turban et al., 2023).",
            "SCM depende de colaboração com parceiros externos para reduzir variabilidade da cadeia (Christopher, 2016).",
            "BPM redesenha processos críticos sob a ótica cliente-valor (Hammer, 2015).",
            "BI e analytics habilitam ciclos de melhoria contínua orientados por indicadores confiáveis (Laudon & Laudon, 2024)."
          ]
        }
      ]
    },
    {
      "type": "md3Table",
      "title": "Panorama dos sistemas empresariais",
      "headers": ["Categoria", "Objetivo principal", "Indicadores afetados", "Exemplo"],
      "rows": [
        [
          "ERP",
          "Integrar processos centrais (finanças, estoque, RH)",
          "OTIF, custo operacional, conformidade",
          "TOTVS Protheus"
        ],
        [
          "CRM",
          "Gerenciar relacionamento, pipeline e pós-venda",
          "CAC, NPS, taxa de conversão",
          "Salesforce"
        ],
        [
          "SCM",
          "Otimizar cadeia de suprimentos e logística",
          "Lead time, nível de estoque, fill rate",
          "SAP SCM"
        ],
        [
          "BPM/Workflow",
          "Orquestrar processos e garantir conformidade",
          "Tempo de ciclo, retrabalho, SLA",
          "Pipefy"
        ],
        [
          "BI/Analytics",
          "Transformar dados em insights acionáveis",
          "Tempo de decisão, assertividade, ROI de campanhas",
          "Power BI"
        ]
      ]
    },
    {
      "type": "md3Table",
      "title": "Critérios de seleção segundo a literatura",
      "headers": ["Autor", "Foco analítico", "Pergunta-chave"],
      "rows": [
        [
          "Laudon & Laudon (2024)",
          "Alinhamento estratégico e integração",
          "Como o sistema sustenta a cadeia de valor completa?"
        ],
        [
          "Davenport (2013)",
          "Governança de dados e métricas",
          "Quais indicadores ganharão precisão ou rapidez com a implementação?"
        ],
        [
          "Hammer (2015)",
          "Reengenharia de processos",
          "O processo foi redesenhado antes da automação?"
        ],
        [
          "Porter & Heppelmann (2015)",
          "Servitização e IoT",
          "Que novos serviços ou modelos de negócio surgem com a digitalização?"
        ],
        [
          "Turban et al. (2023)",
          "Arquitetura tecnológica",
          "Quais integrações e padrões de dados garantem escalabilidade e segurança?"
        ]
      ]
    },
    {
      "type": "contentBlock",
      "title": "Como conduzir o estudo de caso em squads",
      "content": [
        {
          "type": "paragraph",
          "text": "Divida a turma em squads de 4 a 6 pessoas. Cada grupo escolhe (ou recebe) um dos cenários abaixo e aplica o checklist de análise sistêmica para mapear processos, dados, tecnologia e pessoas. Oriente-os a registrar decisões em uma matriz com três colunas: dor identificada, solução proposta e evidências coletadas na demonstração guiada."
        },
        {
          "type": "paragraph",
          "text": "Reserve 5 minutos iniciais para leitura do contexto, 20 minutos para a análise colaborativa e 5 minutos finais para preparar um pitch de 2 minutos. Durante o trabalho em grupo, circule com perguntas norteadoras como: 'Quais integrações são mandatórias?', 'Que riscos surgem se o módulo X falhar?' e 'Como a equipe medirá sucesso pós-implantação?'."
        }
      ]
    },
    {
      "type": "cardGrid",
      "title": "Estudo de caso em squads",
      "cards": [
        {
          "title": "Retail Mix",
          "content": "Contexto: rede varejista multicanal com ruptura de estoque em lojas físicas e visão fragmentada do cliente.\nAtividades do squad:\n1. Mapear o fluxo pedido-entrega e identificar onde ocorrem os gargalos.\n2. Sugerir uma combinação de ERP, SCM e CRM que integre inventário, e-commerce e atendimento.\n3. Definir indicadores (OTIF, NPS, giro) e dados mestres necessários.\nSaída esperada: quadro-resumo com módulos priorizados, integrações essenciais e plano de mudança para equipes de loja."
        },
        {
          "title": "HealthConnect",
          "content": "Contexto: clínica especializada com prontuários isolados por setor, retrabalho de faturamento e exigências rígidas de compliance LGPD.\nAtividades do squad:\n1. Desenhar o fluxo paciente (agendamento -> consulta -> faturamento -> pós-atendimento).\n2. Selecionar sistemas (prontuário eletrônico, ERP/financeiro, CRM de relacionamento) e apontar integrações HL7/FHIR.\n3. Identificar controles de consentimento, anonimização e trilhas de auditoria.\nSaída esperada: matriz de responsabilidades mostrando donos do processo, riscos mitigados e requisitos de treinamento."
        },
        {
          "title": "Indústria 4.0",
          "content": "Contexto: fábrica de componentes que instalou sensores IoT e quer sincronizar produção, manutenção preditiva e logística outbound.\nAtividades do squad:\n1. Mapear o fluxo ordem de produção -> chão de fábrica -> expedição -> distribuidores.\n2. Avaliar como MES/SCADA, ERP e plataforma de analytics se conectam via APIs ou middleware.\n3. Planejar governança de dados para séries temporais e alertas em tempo real.\nSaída esperada: roadmap em três ondas (curto, médio e longo prazo) com integrações priorizadas e requisitos de capacitação de operadores."
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "Checklist de análise sistêmica",
      "content": [
        {
          "type": "orderedList",
          "items": [
            {
              "title": "Processos",
              "text": "Desenhe o fluxo ponta a ponta em um canvas (ex.: SIPOC), marque gargalos, reprocessos e dependências entre áreas. Verifique se há políticas ou SLAs que condicionam a escolha do sistema."
            },
            {
              "title": "Dados",
              "text": "Liste fontes internas e externas, classifique a qualidade (exatidão, atualidade, completude) e registre obrigações de conformidade como LGPD, SOX e requisitos regulatórios setoriais."
            },
            {
              "title": "Tecnologia",
              "text": "Mapeie integrações prioritárias (APIs, middleware, ETL), dependências com legados e limitações de infraestrutura. Aponte padrões (REST, SOAP, eventos) que precisarão ser suportados."
            },
            {
              "title": "Pessoas",
              "text": "Identifique papéis-chave, competências que precisarão ser desenvolvidas e plano de gestão da mudança. Determine ownership de cada módulo e canais de suporte."
            }
          ]
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "Debate socrático",
      "content": [
        {
          "type": "orderedList",
          "items": [
            {
              "title": "Critérios de aderência",
              "text": "Quais dimensões (processos, pessoas, dados, tecnologia) pesaram na escolha do sistema? Peça que os squads apresentem evidências coletadas no catálogo e no checklist."
            },
            {
              "title": "Riscos sistêmicos",
              "text": "Que efeitos colaterais podem emergir em outros subsistemas da organização? Explore cenários de falha e pergunte quem seria impactado em upstream e downstream."
            },
            {
              "title": "Governança",
              "text": "Como garantir atualização, suporte e evolução contínua do sistema selecionado? Discuta papéis de TI e das áreas de negócio, backlog de melhorias e políticas de revisão periódica."
            }
          ]
        }
      ]
    },
    {
      "type": "callout",
      "variant": "good-practice",
      "title": "Demonstração guiada",
      "content": [
        {
          "type": "paragraph",
          "text": "A turma acompanha, em tempo real, a navegação pelo Catálogo Gartner de aplicações empresariais (https://example.edu/tgs/recursos/catalogo-sistemas) ou outro marketplace institucional autorizado. Mostre como aplicar filtros por segmento, porte, módulos disponíveis e integrações certificadas."
        },
        {
          "type": "paragraph",
          "text": "Projete a planilha-modelo de captura de requisitos (Ficha de estudo de caso) e vá preenchendo ao vivo: integrações essenciais, requisitos técnicos, modelos de licenciamento e SLAs. Faça pausas para que as squads registrem observações que alimentarão o estudo de caso."
        }
      ]
    },
    {
      "type": "callout",
      "variant": "task",
      "title": "TED",
      "content": [
        {
          "type": "paragraph",
          "text": "Poste no AVA a análise do seu squad contendo: (1) sistemas recomendados e módulos escolhidos, (2) justificativa sistêmica ancorada nas quatro dimensões do checklist, (3) integrações prioritárias e riscos associados, e (4) evidência (print ou link) da ferramenta explorada na demonstração guiada."
        }
      ]
    },
    {
      "type": "callout",
      "variant": "info",
      "title": "Prompt para revisitar a aula",
      "content": [
        {
          "type": "paragraph",
          "text": "Use o prompt a seguir para solicitar a um assistente de IA sugestões de aprimoramento contínuo da aula. Oriente o professor a colar o texto completo na ferramenta escolhida (ChatGPT, Gemini, Copilot etc.) após a aula, salvando os insights em um documento compartilhado com a coordenação."
        },
        {
          "type": "codeBlock",
          "language": "text",
          "text": "Você é um especialista em sistemas de informação empresariais. Analise a aula 'Tipos de Sistemas Empresariais' (ERP, CRM, SCM, BPM, BI) para um curso técnico de TGS. Aprofunde exemplos com base em Davenport (2013), Laudon & Laudon (2024), Turban et al. (2023), Hammer (2015), Porter & Heppelmann (2015) e Christopher (2016). Sugira ajustes no plano de aula, estudos de caso e avaliação, garantindo conexões entre processos, dados, tecnologia e pessoas. Indique também métricas para avaliar aprendizagem e referências complementares atualizadas."
        }
      ]
    }
  ],
  "formatVersion": "md3.lesson.v1",
  "slug": "aula-15-tipos-de-sistemas-empresariais",
  "summary": "Compara categorias de sistemas empresariais, relacionando critérios de escolha a casos reais e integrações necessárias.",
  "objectives": [
    "Diferenciar sistemas empresariais por propósito e escopo.",
    "Relacionar necessidades organizacionais a soluções tecnológicas específicas.",
    "Identificar critérios de governança e integração para adoção de sistemas."
  ],
  "competencies": [
    "Análise sistêmica de processos",
    "Tomada de decisão baseada em dados",
    "Colaboração interdisciplinar"
  ],
  "skills": [
    "Mapear requisitos de negócio e traduzi-los em capacidades de sistemas.",
    "Argumentar escolhas tecnológicas considerando impactos organizacionais.",
    "Utilizar catálogos e matrizes comparativas como suporte à decisão."
  ],
  "outcomes": [
    "Entrega estudo de caso justificando sistemas selecionados.",
    "Documenta riscos e integrações essenciais.",
    "Compartilha aprendizados coletivos no AVA."
  ],
  "prerequisites": [
    "Revisar conceitos das aulas 9 a 12 sobre níveis de SI.",
    "Trazer notas da NP1 para conectar lacunas a novos conteúdos."
  ],
  "tags": ["aula-15-sistemas-empresariais"],
  "duration": 110,
  "modality": "in-person",
  "resources": [
    {
      "label": "Catálogo Gartner de aplicações empresariais",
      "url": "https://example.edu/tgs/recursos/catalogo-sistemas",
      "type": "guide"
    },
    {
      "label": "Ficha de estudo de caso",
      "url": "https://example.edu/tgs/modelos/ficha-case",
      "type": "template"
    },
    {
      "label": "Relatório Gartner Magic Quadrant ERP (trecho público)",
      "url": "https://www.gartner.com/en/documents/3980900",
      "type": "report"
    },
    {
      "label": "Guia SAP sobre integração SCM",
      "url": "https://www.sap.com/products/scm.html",
      "type": "article"
    },
    {
      "label": "Estudo Harvard Business Review sobre servitização",
      "url": "https://hbr.org/2015/10/how-smart-connected-products-are-transforming-companies",
      "type": "article"
    }
  ],
  "bibliography": [
    "LAUDON, Kenneth; LAUDON, Jane. Sistemas de Informação Gerenciais. Pearson, 2024.",
    "TURBAN, Efraim et al. Tecnologia da Informação para Gestão. Bookman, 2023.",
    "DAVENPORT, Thomas H. Process Innovation: Reengineering Work through Information Technology. Harvard Business School Press, 2013.",
    "HAMMER, Michael. Faster, Better, Cheaper. Crown Business, 2015.",
    "PORTER, Michael; HEPPELMANN, James. How Smart, Connected Products Are Transforming Companies. Harvard Business Review, 2015.",
    "CHRISTOPHER, Martin. Logistics & Supply Chain Management. Pearson, 2016."
  ],
  "assessment": {
    "type": "formative",
    "description": "Análise do estudo de caso registrada e debatida no AVA."
  },
  "metadata": {
    "status": "draft",
    "updatedAt": "2025-02-10T00:00:00.000Z",
    "owners": ["Profa. Marina Duarte"],
    "sources": ["Plano de ensino TGS 2025.1"]
  }
}
