{
  "id": "lesson-06",
  "title": "Aula 6: Fluxos e Transformação Organizacional",
  "objective": "Identificar fluxos críticos e propor melhorias sistêmicas nos processos organizacionais.",
  "content": [
    {
      "type": "lessonPlan",
      "title": "Plano da Aula",
      "cards": [
        {
          "icon": "book-open",
          "title": "CONTEÚDO",
          "content": "Unidade II – A organização como um sistema aberto. Transformação organizacional; fluxo de informações e energia nos sistemas."
        },
        {
          "icon": "bullseye",
          "title": "OBJETIVO ESPECÍFICO",
          "content": "Identificar os processos de transformação e os fluxos sistêmicos em organizações, compreendendo a interdependência entre suas partes e o ambiente."
        },
        {
          "icon": "gears",
          "title": "METODOLOGIA E RECURSOS",
          "content": "Aula expositiva com exemplificação de fluxos reais (cadeia de suprimentos, sistemas logísticos, organogramas) e vídeos sobre transformação digital."
        }
      ]
    },
    {
      "type": "callout",
      "variant": "info",
      "title": "Pergunta Norteadora",
      "content": [
        {
          "type": "paragraph",
          "text": "Como a Amazon consegue entregar um produto na sua casa tão rápido? Que fluxos de informação e de materiais você acha que acontecem desde o clique em \"comprar\" até a campainha tocar?"
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "🌊 A Empresa em Movimento: Fluxos e Transformação",
      "content": [
        {
          "type": "paragraph",
          "text": "Na aula anterior, estabelecemos que uma organização é um sistema aberto. Hoje, vamos aprofundar essa ideia, entendendo que esse sistema não é estático; ele é um organismo dinâmico, pulsante, movido por fluxos constantes. Assim como o corpo humano depende do fluxo sanguíneo para transportar oxigênio e nutrientes, uma empresa depende de fluxos de materiais, informação e energia para sobreviver e crescer."
        },
        {
          "type": "paragraph",
          "text": "O \"coração\" da empresa é o seu processo de transformação: a capacidade de converter recursos (entradas) em produtos e serviços de valor (saídas). Compreender como esses fluxos alimentam a transformação e como as diferentes partes da organização (subsistemas) são interdependentes é fundamental para qualquer profissional de SI que deseje projetar tecnologias que otimizem e acelerem esses processos."
        }
      ]
    },
    {
      "type": "cardGrid",
      "title": "As Correntes Sanguíneas da Organização",
      "cards": [
        {
          "title": "Fluxo de Materiais e Energia",
          "content": "Refere-se ao movimento físico de recursos através da organização. É o fluxo tangível, que podemos ver e tocar. - Exemplo: numa fábrica de automóveis, é o fluxo do aço que chega do fornecedor, passa pela linha de montagem e sai como um carro pronto. - Em SI: envolve hardware (servidores, computadores) e a energia elétrica que os alimenta."
        },
        {
          "title": "Fluxo de Informação",
          "content": "É o fluxo intangível de dados, ordens, conhecimento e comunicação que coordena e controla o fluxo de materiais. É o \"sistema nervoso\" da empresa. - Exemplo: o pedido de compra que aciona o fornecedor, a nota fiscal e o código de rastreamento. - Em SI: é nossa matéria-prima: linhas de código, registros em banco de dados, mensagens e integrações."
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "Exemplo Prático: A Cadeia de Suprimentos (Supply Chain)",
      "content": [
        {
          "type": "paragraph",
          "text": "A cadeia de suprimentos é o exemplo perfeito da interdependência entre os fluxos de materiais e de informação. Um não funciona sem o outro."
        },
        {
          "type": "image",
          "src": "https://sombraprof.github.io/tgs/imagens/aula_5_imagen_1.png",
          "alt": "Diagrama da Cadeia de Suprimentos"
        },
        {
          "type": "list",
          "items": [
            "O Fluxo de Materiais (o produto físico) move-se numa direção: da matéria-prima ao cliente.",
            "O Fluxo de Informação (pedidos, pagamentos, rastreamento, feedback) move-se em ambas as direções, coordenando toda a operação. Um pedido do cliente (informação) inicia todo o fluxo de materiais."
          ]
        }
      ]
    },
    {
      "type": "callout",
      "variant": "good-practice",
      "title": "📦 Estudo de Caso: A Máquina Logística da Amazon",
      "content": [
        {
          "type": "paragraph",
          "text": "Vamos usar o exemplo da Amazon para identificar os fluxos em ação. Em grupo, discutam e mapeiem:"
        },
        {
          "type": "list",
          "ordered": true,
          "items": [
            "Fluxo de informação inicial: o que acontece no sistema quando você clica em \"Comprar\"?",
            "Fluxo de materiais no armazém: como o pedido vira movimentação física dentro do centro de distribuição?",
            "Fluxo de informação externo: de que forma o sistema conversa com a transportadora e quais dados circulam?",
            "Feedback: qual o papel do código de rastreamento e das avaliações pós-entrega?"
          ]
        }
      ]
    },
    {
      "type": "cardGrid",
      "title": "🧭 Conceitos-chave",
      "cards": [
        {
          "title": "Throughput",
          "content": "Taxa de saída do sistema (itens/unidade de tempo). Em logística, pedidos despachados por hora."
        },
        {
          "title": "Lead Time",
          "content": "Tempo total \"pedido→entrega\". Inclui esperas, filas e processamento."
        },
        {
          "title": "WIP (Trabalho em Progresso)",
          "content": "Itens em processamento. Excesso de WIP aumenta filas e lead time."
        },
        {
          "title": "Gargalo",
          "content": "Etapa que limita o throughput do sistema. Otimizações fora do gargalo têm pouco efeito."
        },
        {
          "title": "OTIF / Fill Rate",
          "content": "On-Time In-Full e taxa de atendimento. Medem eficácia do fluxo fim-a-fim."
        },
        {
          "title": "Feedback & Homeostase",
          "content": "Loops que estabilizam (negativo) ou amplificam (positivo) o comportamento do sistema."
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "📋 SIPOC + Mini VSM",
      "content": [
        {
          "type": "image",
          "src": "https://sombraprof.github.io/tgs/imagens/aula_6_imagem_1.svg",
          "alt": "Diagrama SIPOC + Mini VSM"
        },
        {
          "type": "list",
          "items": [
            "Onde a informação vira ação? No gatilho do pedido (ERP/WMS), que movimenta picking/packing (fluxo de materiais).",
            "Como reduzir lead time? Diminuindo esperas (filas), equilibrando WIP e aliviando o gargalo."
          ]
        }
      ]
    },
    {
      "type": "callout",
      "variant": "good-practice",
      "title": "⚡ Atividade Relâmpago (10–12 min)",
      "content": [
        {
          "type": "list",
          "ordered": true,
          "items": [
            "Marque no diagrama SIPOC onde um dado dispara uma ação física.",
            "Liste dois pontos de espera e um gargalo provável. Sugira uma métrica (ex.: OTIF).",
            "Explique em poucas linhas como um webhook pode reduzir o lead time."
          ]
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "📏 Rubrica de Avaliação (TED)",
      "content": [
        {
          "type": "md3Table",
          "headers": ["Critério", "Excelente (2)", "Adequado (1)", "Insuficiente (0)"],
          "rows": [
            [
              "Correção do fluxo",
              "Sequência correta e completa",
              "Pequenos deslizes",
              "Etapas incorretas/omissões"
            ],
            [
              "Integração info↔material",
              "Vínculos claros entre dados e ação",
              "Vínculos parciais",
              "Sem integração"
            ],
            ["Clareza visual", "Legível, consistente", "Alguma confusão", "Confuso/incompleto"],
            [
              "Justificativa",
              "Justifica escolhas em 3–5 linhas",
              "Justifica parcialmente",
              "Sem justificativa"
            ]
          ]
        }
      ]
    },
    {
      "type": "accordion",
      "title": "📑 Glossário & Leituras",
      "items": [
        {
          "title": "Glossário rápido",
          "content": "- SIPOC: Fornecedores-Entradas-Processo-Saídas-Clientes.\n- VSM: Mapeamento do Fluxo de Valor (tempo de espera vs. processamento).\n- WMS/TMS/ERP: Sistemas que orquestram fluxos de informação e materiais."
        },
        {
          "title": "Leituras curtas sugeridas",
          "content": "- Cap. introdutórios de cadeias de suprimentos (qualquer manual de logística).\n- Capítulos sobre processos e métricas nos livros já citados (Stair & Reynolds; Silva et al.)."
        }
      ]
    },
    {
      "type": "videosBlock",
      "title": "🎬 Vídeos para fixar o conteúdo",
      "videos": [
        {
          "youtubeId": "V8tJLKC2D4o",
          "title": "Supply Chain: o que é e como funciona (fluxos de materiais e informação)"
        },
        {
          "youtubeId": "8pOWFeVPZ6o",
          "title": "Retroação (feedback), entropia e homeostase na Teoria Geral de Sistemas"
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "🧩 TED: Fluxograma do Processo de Matrícula",
      "content": [
        {
          "type": "paragraph",
          "text": "Objetivo: Completar o fluxograma, preenchendo os blocos [Preencher] e validando o caminho das decisões."
        },
        {
          "type": "image",
          "src": "https://sombraprof.github.io/tgs/imagens/aula_6_imagem_2.svg",
          "alt": "Fluxograma da Matrícula (Versão para Alunos) — Alinhado"
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "📝 Tarefa (TED): Estudo Orientado de Fluxograma",
      "content": [
        {
          "type": "paragraph",
          "text": "Para a próxima aula, a sua tarefa será aplicar o conhecimento sobre fluxos a um processo organizacional."
        },
        {
          "type": "list",
          "title": "Instruções:",
          "items": [
            "Acesse o AVA da disciplina e faça o download do arquivo PDF \"TED_Aula_6_Fluxograma\".",
            "O arquivo contém um fluxograma que representa um processo de transformação organizacional (ex: processo de matrícula de um aluno), mas com algumas partes em branco.",
            "Sua tarefa é preencher os espaços em branco, identificando as etapas corretas do fluxo de informação e/ou materiais.",
            "Salve o PDF preenchido e submeta-o na atividade correspondente no AVA."
          ]
        },
        {
          "type": "paragraph",
          "text": "Entrega: Individual, via upload do PDF preenchido no AVA."
        }
      ]
    },
    {
      "type": "accordion",
      "title": "🧐 Mini-Quiz de Autoavaliação",
      "items": [
        {
          "title": "1. Numa cadeia de suprimentos, o código de rastreamento de um pedido é um exemplo de qual fluxo?",
          "content": "Resposta: Fluxo de Informação. Ele é um dado que representa e permite monitorizar o fluxo de materiais (o pacote físico)."
        },
        {
          "title": "2. A \"Transformação Digital\" nas empresas foca principalmente em otimizar qual dos fluxos?",
          "content": "Resposta: O Fluxo de Informação. A transformação digital usa a tecnologia para tornar o fluxo de informação mais rápido, inteligente e automatizado, o que, por consequência, otimiza o fluxo de materiais e a tomada de decisão."
        },
        {
          "title": "3. Verdadeiro ou Falso: Um organograma representa apenas a hierarquia de poder numa empresa.",
          "content": "Resposta: Falso. Além da hierarquia, um organograma representa o fluxo formal de comunicação e autoridade, que é uma forma de fluxo de informação."
        }
      ]
    },
    {
      "type": "bibliographyBlock",
      "title": "📚 Bibliografia",
      "references": [
        "SILVA, K.C.N.D.; BARBOSA, C.; JUNIOR, R.S.C. Sistemas de informações gerenciais. Porto Alegre: Grupo A, 2019.",
        "STAIR, Ralph M.; REYNOLDS, George W. Princípios de sistemas de informação. 14. ed. São Paulo: Cengage Learning, 2021."
      ]
    }
  ],
  "formatVersion": "md3.lesson.v1",
  "slug": "fluxos-e-transformacao-organizacional",
  "summary": "Discute processos de transformação e fluxos sistêmicos nas organizações, evidenciando interdependências e gargalos.",
  "objectives": [
    "Mapear fluxos de informação, materiais e energia em organizações.",
    "Diagnosticar gargalos e redundâncias.",
    "Propor intervenções para otimizar a transformação organizacional."
  ],
  "competencies": ["Gestão de processos", "Pensamento sistêmico", "Melhoria contínua"],
  "skills": [
    "Elaborar diagramas de fluxo sistêmico.",
    "Aplicar métricas para avaliar desempenho dos processos.",
    "Justificar recomendações de melhoria baseadas em dados."
  ],
  "outcomes": [
    "Entrega mapa de fluxo comentado.",
    "Identifica causas sistêmicas de ineficiências.",
    "Prioriza ações de melhoria alinhadas a indicadores."
  ],
  "prerequisites": [
    "Compreensão de sistemas abertos.",
    "Conhecimento básico de mapeamento de processos."
  ],
  "tags": ["fluxos", "processos", "transformacao"],
  "duration": 110,
  "modality": "in-person",
  "resources": [
    {
      "label": "Ferramenta: Bizagi Modeler para mapeamento de processos",
      "url": "https://www.bizagi.com/en/platform/modeler",
      "type": "tool"
    },
    {
      "label": "Case: Transformação digital em serviços de saúde",
      "url": "https://www.preprints.org/manuscript/202205.0061/v1/download",
      "type": "case"
    }
  ],
  "bibliography": [
    "HAMMER, M.; CHAMPY, J. Reengenharia. Campus, 2019.",
    "SENGE, P. A Quinta Disciplina. Best Seller, 2020."
  ],
  "assessment": {
    "type": "practical",
    "description": "Workshop de diagnóstico com relatório de melhorias prioritárias."
  },
  "metadata": {
    "status": "published",
    "updatedAt": "2025-02-08T00:00:00.000Z",
    "owners": ["Prof. Tiago Sombra"],
    "sources": ["Plano de ensino TGS 2025.1"]
  }
}
