{
  "id": "lesson-02",
  "title": "Aula 2: Curricularização da Extensão",
  "objective": "Analisar a obrigatoriedade da extensão nos cursos de TI e planejar ações alinhadas à realidade da turma.",
  "content": [
    {
      "type": "lessonPlan",
      "title": "Plano da Aula",
      "cards": [
        {
          "icon": "book-open",
          "title": "CONTEÚDO",
          "content": "Curricularização da Extensão – Unidade de Introdução. O que são atividades de extensão; relações entre universidade, comunidade e mercado; importância do tripé Ensino-Pesquisa-Extensão."
        },
        {
          "icon": "bullseye",
          "title": "OBJETIVO",
          "content": "Compreender o papel da extensão universitária, sua obrigatoriedade no currículo de Sistemas de Informação segundo a legislação do MEC, e reconhecer sua importância para a formação profissional e cidadã."
        },
        {
          "icon": "gears",
          "title": "METODOLOGIA",
          "content": "Aula expositiva dialogada com uso de roda de conversa e vídeo (metodologia ativa)."
        },
        {
          "icon": "desktop",
          "title": "RECURSOS",
          "content": "Quadro, vídeo sobre ações extensionistas, relato de projeto real da instituição."
        }
      ]
    },
    {
      "type": "callout",
      "variant": "info",
      "title": "Pergunta Norteadora",
      "content": [
        {
          "type": "paragraph",
          "text": "Fora dos muros da universidade, como a tecnologia e o conhecimento que aprendemos aqui podem transformar a realidade da nossa comunidade?"
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "🌍 O Papel Social da Universidade",
      "content": [
        {
          "type": "paragraph",
          "text": "Normalmente, pensamos na universidade como um lugar para aprender (Ensino) e para descobrir coisas novas (Pesquisa). Mas existe um terceiro pilar, igualmente importante, que conecta tudo isso ao mundo real: a Extensão."
        },
        {
          "type": "paragraph",
          "text": "A extensão é a ponte que leva o conhecimento produzido na academia para a sociedade e, ao mesmo tempo, traz as necessidades, os desafios e os saberes da comunidade para dentro da universidade. É uma via de mão dupla que enriquece a formação do aluno, qualifica a pesquisa e fortalece o impacto social da instituição."
        },
        {
          "type": "paragraph",
          "text": "Desde 2018, de acordo com a Resolução CNE/CES nº 7/2018, o Ministério da Educação (MEC) tornou obrigatória a Curricularização da Extensão. Isso significa que todos os cursos de graduação devem destinar, no mínimo, 10% da carga horária total para atividades extensionistas. Portanto, participar de projetos de extensão não é opcional: faz parte do seu currículo acadêmico e é requisito para a colação de grau."
        }
      ]
    },
    {
      "type": "cardGrid",
      "title": "🏛️ O Tripé: Ensino, Pesquisa e Extensão",
      "cards": [
        {
          "title": "Ensino",
          "content": "É a base de tudo. A transmissão e construção do conhecimento em sala de aula, preparando profissionais qualificados para o mercado."
        },
        {
          "title": "Pesquisa",
          "content": "A produção de novo conhecimento. É a investigação científica que avança as fronteiras da ciência e da tecnologia, gerando inovação."
        },
        {
          "title": "Extensão",
          "content": "A articulação entre o saber acadêmico e o saber popular. É a aplicação prática do conhecimento para resolver problemas reais da comunidade."
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "A Sinergia do Tripé: Como os Pilares se Conectam",
      "content": [
        {
          "type": "paragraph",
          "text": "Esses três pilares não funcionam de forma isolada. Pelo contrário, eles se alimentam mutuamente em um ciclo contínuo:"
        },
        {
          "type": "list",
          "items": [
            "A Pesquisa inova o Ensino: As descobertas científicas e tecnológicas da pesquisa atualizam o conteúdo que é ensinado em sala de aula, garantindo uma formação sempre relevante.",
            "A Extensão dá propósito ao Ensino e à Pesquisa: Ao aplicar o conhecimento para resolver um problema real da comunidade, o aluno entende o propósito prático do que aprendeu. Muitas vezes, os desafios encontrados na extensão geram novas perguntas que viram temas de pesquisa.",
            "O Ensino prepara para a Pesquisa e a Extensão: A base teórica sólida adquirida em sala de aula é o que capacita o aluno a investigar novos temas (pesquisa) e a desenvolver soluções eficazes para a sociedade (extensão)."
          ]
        },
        {
          "type": "paragraph",
          "text": "É um sistema dinâmico onde cada parte fortalece as outras, criando um ciclo virtuoso de aprendizado, descoberta e impacto social."
        }
      ]
    },
    {
      "type": "cardGrid",
      "title": "💡 A Extensão em Sistemas de Informação na Prática",
      "cards": [
        {
          "title": "Exemplo 1: Inclusão Digital",
          "body": "Alunos de SI organizam oficinas para ensinar idosos a usar smartphones, internet banking e redes sociais, promovendo autonomia e combatendo o isolamento digital.",
          "items": [
            "Comunidade beneficiada: Idosos locais.",
            "Habilidades desenvolvidas: Didática, paciência, comunicação."
          ]
        },
        {
          "title": "Exemplo 2: Sistema para ONGs",
          "body": "Uma equipe de estudantes desenvolve, voluntariamente, um sistema de gestão de doações e voluntários para uma organização não governamental do bairro, otimizando seus processos.",
          "items": [
            "Comunidade beneficiada: ONG e seus assistidos.",
            "Habilidades desenvolvidas: Levantamento de requisitos, desenvolvimento, gestão de projetos."
          ]
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "💼 Por que a Extensão é um Diferencial para sua Carreira?",
      "content": [
        {
          "type": "paragraph",
          "text": "Além de ser um requisito curricular, a participação em projetos de extensão é um grande investimento no seu futuro profissional. Em um mercado de TI competitivo, a experiência prática com impacto social se destaca:"
        },
        {
          "type": "list",
          "items": [
            "Enriquece seu currículo e portfólio: Projetos reais mostram sua capacidade de aplicar a teoria na prática.",
            "Desenvolve Soft Skills: Liderança, trabalho em equipe, comunicação com clientes (a comunidade), resolução de problemas complexos e empatia são habilidades altamente valorizadas.",
            "Cria Networking: Conecta você com professores, colegas e membros da comunidade, abrindo portas para futuras oportunidades.",
            "Demonstra Proatividade e Engajamento: Mostra para recrutadores que você é um profissional que vai além do básico e se preocupa com o impacto do seu trabalho."
          ]
        }
      ]
    },
    {
      "type": "callout",
      "variant": "good-practice",
      "title": "Desafio Prático: Ideia de Projeto",
      "content": [
        {
          "type": "paragraph",
          "text": "Pense em uma necessidade real de tecnologia na sua comunidade (bairro, escola, grupo social, etc.). Descreva em poucas linhas como um projeto de extensão, liderado por alunos de SI, poderia ajudar a resolver ou amenizar esse problema. Além de pensar no impacto social, reflita: como um projeto de extensão poderia fortalecer o seu currículo e mostrar para o mercado que você sabe aplicar tecnologia para resolver problemas reais?"
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "Roda de Conversa: Conectando Ideias",
      "content": [
        {
          "type": "paragraph",
          "text": "Vamos agora abrir para uma roda de conversa. Com base no vídeo sobre ações extensionistas que assistiremos e em suas próprias experiências, vamos debater:"
        },
        {
          "type": "list",
          "items": [
            "Que tipo de problema na nossa cidade ou comunidade poderia ser amenizado ou resolvido com um projeto de extensão em TI?",
            "Como a interação com a comunidade pode trazer novas perspectivas para os projetos que desenvolvemos em sala de aula?",
            "Além do conhecimento técnico, que outras competências um projeto de extensão pode desenvolver em um futuro profissional de SI?"
          ]
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "📝 Tarefa (TED)",
      "content": [
        {
          "type": "paragraph",
          "text": "Sua tarefa para a próxima aula é pesquisar e refletir sobre o impacto da extensão. Poste sua resposta no fórum do Moodle para a seguinte questão:"
        },
        {
          "type": "blockquote",
          "text": "\"Que ações de extensão você já participou ou conhece na sua comunidade (mesmo que não sejam de TI)? Como elas contribuem com a sociedade?\""
        },
        {
          "type": "paragraph",
          "text": "Entrega: Poste sua pesquisa e reflexão no fórum da disciplina no AVA até a data da nossa próxima aula."
        },
        {
          "type": "paragraph",
          "text": "Dica: Pesquise sobre a Resolução CNE/CES nº 7/2018 e traga na sua reflexão uma frase sobre como essa norma impacta a sua formação."
        }
      ]
    },
    {
      "type": "accordion",
      "title": "🧐 Mini-Quiz de Autoavaliação",
      "items": [
        {
          "title": "1. Qual é o objetivo principal da extensão universitária?",
          "content": "Resposta: O principal objetivo é criar uma ponte de mão dupla entre a universidade e a sociedade, aplicando o conhecimento acadêmico para resolver problemas reais da comunidade e, ao mesmo tempo, trazendo as experiências e saberes da comunidade para dentro da universidade, enriquecendo o ensino e a pesquisa."
        },
        {
          "title": "2. O tripé que sustenta a universidade é composto por quais três pilares?",
          "content": "Resposta: Ensino, Pesquisa e Extensão."
        },
        {
          "title": "3. Verdadeiro ou Falso: Um projeto de extensão beneficia apenas a comunidade externa.",
          "content": "Resposta: Falso. O projeto de extensão beneficia tanto a comunidade quanto os alunos e professores envolvidos, que desenvolvem habilidades técnicas, sociais e de comunicação, além de ganharem uma perspectiva prática sobre a aplicação de seus conhecimentos."
        }
      ]
    },
    {
      "type": "bibliographyBlock",
      "title": "📚 Bibliografia",
      "references": [
        "RAINER, Jr., Kelly R. Introdução a Sistemas de Informação. 5. ed. Rio de Janeiro, 2016.",
        "FREIRE, Paulo. Extensão ou Comunicação? 17. ed. Rio de Janeiro: Paz e Terra, 2011. (Leitura complementar sobre a filosofia da extensão)."
      ]
    }
  ],
  "formatVersion": "md3.lesson.v1",
  "slug": "curricularizacao-da-extensao",
  "summary": "Contextualiza a curricularização da extensão no ensino superior brasileiro, destacando legislação e impactos na formação em Sistemas de Informação.",
  "objectives": [
    "Interpretar diretrizes do MEC sobre extensão universitária.",
    "Identificar oportunidades de projetos extensionistas vinculados à disciplina.",
    "Planejar contribuições pessoais para iniciativas de extensão."
  ],
  "competencies": ["Responsabilidade social", "Gestão acadêmica", "Planejamento de projetos"],
  "skills": [
    "Ler e sintetizar marcos legais da extensão.",
    "Relacionar competências técnicas com demandas comunitárias.",
    "Elaborar proposta inicial de ação extensionista."
  ],
  "outcomes": [
    "Explica a importância da extensão para a formação cidadã.",
    "Lista possibilidades de projetos conectados à disciplina.",
    "Define próximos passos para participação efetiva em extensão."
  ],
  "prerequisites": [
    "Conhecer objetivos gerais da disciplina.",
    "Interesse em atividades comunitárias."
  ],
  "tags": ["extensao", "legislacao", "planejamento"],
  "duration": 110,
  "modality": "in-person",
  "resources": [
    {
      "label": "Resolução CNE/CES nº 7/2018",
      "url": "http://portal.mec.gov.br/docman/setembro-2018-pdf/97044-rces007-18-pdf/file",
      "type": "legislation"
    },
    {
      "label": "Guia de curricularização da extensão (MEC)",
      "url": "https://example.edu/tgs/guia-extensao",
      "type": "guide"
    }
  ],
  "bibliography": [
    "BRASIL. Ministério da Educação. Diretrizes para Extensão Universitária. 2018.",
    "FREIRE, P. Extensão ou Comunicação? Paz e Terra, 2019."
  ],
  "assessment": {
    "type": "formative",
    "description": "Quadro colaborativo de ideias para projetos extensionistas."
  },
  "metadata": {
    "status": "published",
    "updatedAt": "2025-02-08T00:00:00.000Z",
    "owners": ["Prof. Tiago Sombra"],
    "sources": ["Plano de ensino TGS 2025.1"]
  }
}
