{
  "id": "lesson-03",
  "title": "Aula 3: Componentes e Características dos Sistemas",
  "objective": "Reconhecer componentes e propriedades que definem o comportamento sistêmico.",
  "content": [
    {
      "type": "lessonPlan",
      "title": "Plano da Aula",
      "cards": [
        {
          "icon": "book-open",
          "title": "CONTEÚDO",
          "content": "Unidade I – Definição e Tipos de Sistemas. Componentes essenciais (entradas, processamento, saídas, feedback), características (propósito, fronteira, ambiente) e tipos de sistemas."
        },
        {
          "icon": "bullseye",
          "title": "OBJETIVO ESPECÍFICO",
          "content": "Compreender os principais elementos e características que compõem um sistema e sua aplicação em diferentes contextos organizacionais e de TI."
        },
        {
          "icon": "gears",
          "title": "METODOLOGIA E RECURSOS",
          "content": "Aula expositiva com exemplos progressivos, utilizando esquemas visuais, tabelas comparativas e estudo de caso para conectar a teoria com a prática."
        }
      ]
    },
    {
      "type": "callout",
      "variant": "info",
      "title": "Pergunta Norteadora",
      "content": [
        {
          "type": "paragraph",
          "text": "Como um analista de sistemas pode usar o conceito de entradas, processamento, saídas e feedback para melhorar um processo organizacional? Pense num sistema que usa no seu dia a dia e reflita: o que aconteceria se um desses elementos falhasse?"
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "⚙️ Decompondo a Máquina: A Anatomia de um Sistema",
      "content": [
        {
          "type": "paragraph",
          "text": "Se a Teoria Geral de Sistemas nos deu os \"óculos\" para enxergar o mundo de forma conectada, agora vamos ajustar o foco para entender a anatomia de tudo o que vemos. Todo sistema, de um simples micro-ondas a um complexo sistema de e-commerce, opera sobre os mesmos princípios fundamentais. Ele existe para cumprir um propósito, dentro de uma fronteira definida, interagindo com o seu ambiente."
        },
        {
          "type": "paragraph",
          "text": "Em Sistemas de Informação, dominar essa anatomia não é apenas teoria, é a base da nossa profissão. Identificar corretamente as entradas (o que o sistema recebe), os processos (o que ele faz), as saídas (o que ele entrega) e o feedback (como ele aprende) é o primeiro passo para analisar requisitos, projetar software e garantir que a tecnologia realmente resolva um problema. Um erro nesta fase inicial pode levar a falhas críticas, como sistemas que não atendem às necessidades do utilizador ou não se adaptam às mudanças do negócio."
        }
      ]
    },
    {
      "type": "cardGrid",
      "title": "🔭 As Lentes do Analista: Características de Todo o Sistema",
      "cards": [
        {
          "title": "Propósito (ou Objetivo)",
          "content": "Todo o sistema existe por uma razão. É a meta principal que justifica a sua existência e guia as suas ações. Exemplo: O propósito de uma aplicação de música é permitir que o utilizador ouça qualquer canção, a qualquer momento."
        },
        {
          "title": "Ambiente",
          "content": "É tudo o que está fora do sistema, mas que o influencia ou é influenciado por ele. Exemplo: Para um sistema de transporte urbano, o ambiente inclui os passageiros, o trânsito, o clima e as leis municipais."
        },
        {
          "title": "Fronteira",
          "content": "A linha (física ou conceptual) que separa o sistema do seu ambiente. Define o âmbito do que podemos controlar. Exemplo: A fronteira de um sistema de e-commerce termina onde a transportadora (ambiente) assume a entrega."
        },
        {
          "title": "Subsistemas",
          "content": "Sistemas menores que compõem um sistema maior. Cada um tem o seu próprio propósito, mas trabalham juntos para o objetivo geral. Exemplo: Num carro, o motor, os travões e o sistema elétrico são subsistemas."
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "O Ciclo de Vida da Informação em um Sistema",
      "content": [
        {
          "type": "image",
          "src": "https://sombraprof.github.io/tgs/imagens/aula_3_imagen_1.png",
          "alt": "Diagrama de fluxo mostrando quatro caixas conectadas por setas. A primeira, 'Entrada', aponta para 'Processamento'. 'Processamento' aponta para 'Saída'. Uma seta curva sai de 'Saída' e volta para 'Entrada', rotulada como 'Feedback'."
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "🛠️ Os 4 Componentes Essenciais de Todo Sistema",
      "content": [
        {
          "type": "contentBlock",
          "title": "1. Entradas (Inputs): O Combustível do Sistema",
          "content": [
            {
              "type": "paragraph",
              "text": "As entradas são todos os recursos que o sistema coleta de seu ambiente para poder operar. São a matéria-prima, os dados brutos, a energia ou os comandos que iniciam uma ação."
            },
            {
              "type": "callout",
              "variant": "info",
              "content": [
                {
                  "type": "paragraph",
                  "text": "Exemplos:"
                },
                {
                  "type": "list",
                  "ordered": false,
                  "items": [
                    "Sistema Hospitalar (ERP): Dados de cadastro de um novo paciente, resultados de exames.",
                    "Sistema de CRM: Informações de um novo lead, registro de uma ligação de vendas."
                  ]
                }
              ]
            }
          ]
        },
        {
          "type": "contentBlock",
          "title": "2. Processamento: O Motor da Transformação",
          "content": [
            {
              "type": "paragraph",
              "text": "O processamento é o conjunto de ações, regras e algoritmos que transformam as entradas em algo novo e útil. É o \"cérebro\" da operação, onde a mágica acontece."
            },
            {
              "type": "callout",
              "variant": "info",
              "content": [
                {
                  "type": "paragraph",
                  "text": "Exemplos:"
                },
                {
                  "type": "list",
                  "ordered": false,
                  "items": [
                    "Sistema Hospitalar (ERP): Cruzar dados do paciente com o histórico para sugerir diagnósticos, agendar cirurgia.",
                    "Sistema de CRM: Qualificar o lead com base em seu perfil e interações, gerar um relatório de funil de vendas."
                  ]
                }
              ]
            }
          ]
        },
        {
          "type": "contentBlock",
          "title": "3. Saídas (Outputs): O Resultado Final",
          "content": [
            {
              "type": "paragraph",
              "text": "As saídas são os resultados gerados pelo processamento, que são entregues de volta ao ambiente. É o produto final, o serviço prestado ou a informação gerada."
            },
            {
              "type": "callout",
              "variant": "info",
              "content": [
                {
                  "type": "paragraph",
                  "text": "Exemplos:"
                },
                {
                  "type": "list",
                  "ordered": false,
                  "items": [
                    "Sistema Hospitalar (ERP): Prontuário eletrônico atualizado, fatura do plano de saúde.",
                    "Sistema de CRM: E-mail de marketing enviado para o lead, dashboard de performance para o gestor."
                  ]
                }
              ]
            }
          ]
        },
        {
          "type": "contentBlock",
          "title": "4. Retroalimentação (Feedback): O Mecanismo de Ajuste",
          "content": [
            {
              "type": "paragraph",
              "text": "O feedback é a informação sobre a saída que retorna ao sistema para avaliar e corrigir seu desempenho. É o que permite que um sistema aprenda, se adapte e melhore continuamente."
            },
            {
              "type": "callout",
              "variant": "info",
              "content": [
                {
                  "type": "paragraph",
                  "text": "Exemplos:"
                },
                {
                  "type": "list",
                  "ordered": false,
                  "items": [
                    "Sistema Hospitalar (ERP): Alerta de estoque baixo de um medicamento, pesquisa de satisfação do paciente.",
                    "Sistema de CRM: Taxa de abertura de e-mails, motivo de perda de uma venda registrado pelo vendedor."
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "type": "callout",
      "variant": "info",
      "title": "Conexão com a Teoria",
      "content": [
        {
          "type": "paragraph",
          "text": "Ludwig von Bertalanffy, o pai da TGS, observou este ciclo em sistemas biológicos. Ele viu que um organismo (sistema) consome nutrientes (entradas), os metaboliza (processamento) para gerar energia (saída) e usa sinais internos (feedback) para manter seu equilíbrio. A genialidade foi perceber que este mesmo modelo se aplica a qualquer sistema, seja ele vivo ou artificial."
        }
      ]
    },
    {
      "type": "cardGrid",
      "title": "🚨 Erros Comuns ao Mapear Sistemas",
      "cards": [
        {
          "title": "Esquecer o Feedback",
          "content": "Muitos focam apenas no fluxo linear de entrada-processo-saída e esquecem de mapear como o sistema se monitora e se corrige. Um sistema sem feedback é um sistema \"cego\", incapaz de se adaptar."
        },
        {
          "title": "Confundir Entradas e Processos",
          "content": "Lembre-se que a entrada é o \"o quê\" (o dado, o recurso), enquanto o processo é o \"como\" (a ação, a transformação). \"Dados do cliente\" é uma entrada; \"validar dados do cliente\" é um processo."
        },
        {
          "title": "Definir Fronteiras Vagas",
          "content": "Não saber onde o sistema termina e o ambiente começa gera o \"escopo infinito\". A API de um banco é parte do sistema do banco ou do ambiente para o app que a consome? Definir isso é crucial para o sucesso de um projeto."
        }
      ]
    },
    {
      "type": "callout",
      "variant": "info",
      "title": "Caso Real: ERP de um Hospital",
      "content": [
        {
          "type": "paragraph",
          "text": "Vamos aplicar estes conceitos a um sistema complexo:"
        },
        {
          "type": "list",
          "ordered": false,
          "items": [
            "Propósito: Gerir todas as operações do hospital para garantir o melhor atendimento ao paciente.",
            "Subsistemas: Agendamento, internamento, farmácia, faturação, processo clínico eletrónico.",
            "Entrada: Registo de um novo paciente.",
            "Processamento: O sistema verifica a disponibilidade de camas, aloca médicos e agenda exames.",
            "Saída: A fatura enviada ao plano de saúde e o histórico médico do paciente.",
            "Feedback: Um alerta de que o estoque de um medicamento está baixo, forçando uma nova compra (ajuste no sistema)."
          ]
        }
      ]
    },
    {
      "type": "md3Table",
      "title": "🔄 Mapeando Componentes: Do Físico ao Digital",
      "headers": [
        "Componente",
        "Sistema Físico (Micro-ondas)",
        "Sistema de Informação (App de Música)"
      ],
      "rows": [
        [
          "Entrada",
          "Comida fria, tempo (2 minutos), potência (alta)",
          "Pesquisa por \"Queen\", clique no play"
        ],
        [
          "Processamento",
          "Gerar micro-ondas para aquecer a comida",
          "Algoritmo procura a música no servidor e faz o streaming"
        ],
        [
          "Saída",
          "Comida quente, aviso sonoro de \"pronto\"",
          "A música a tocar nos auscultadores"
        ],
        [
          "Feedback",
          "O sensor que desliga o aparelho se a porta for aberta",
          "O sistema recolhe dados de que ouviu a música inteira e recomenda-a a outros utilizadores"
        ]
      ]
    },
    {
      "type": "cardGrid",
      "title": "🗂️ Tipos de Sistemas: Uma Prévia",
      "cards": [
        {
          "title": "Naturais vs. Artificiais",
          "content": "O corpo humano vs. um software."
        },
        {
          "title": "Abertos vs. Fechados",
          "content": "Uma empresa vs. um relógio."
        },
        {
          "title": "Simples vs. Complexos",
          "content": "Uma calculadora vs. um sistema de controlo de tráfego aéreo."
        },
        {
          "title": "Determinísticos vs. Probabilísticos",
          "content": "Um cálculo matemático vs. a previsão do tempo."
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "📝 Tarefa (TED): Análise Crítica de um Sistema",
      "content": [
        {
          "type": "paragraph",
          "text": "A sua tarefa é escolher um sistema (físico ou de informação) e fazer uma análise crítica dos seus componentes."
        },
        {
          "type": "list",
          "title": "Instruções:",
          "items": [
            "Escolha um sistema e descreva o seu propósito.",
            "Mapeie as suas Entradas, Processamento, Saídas e Feedback.",
            "Justifique a importância de cada um destes quatro componentes para que o sistema atinja o seu propósito. O que falharia se um deles não existisse?",
            "(Opcional) Se possível, relacione o sistema escolhido com um sistema de informação organizacional que poderia geri-lo ou interagir com ele."
          ]
        },
        {
          "type": "paragraph",
          "text": "Entrega: Apresente a sua análise por escrito no fórum da disciplina no Moodle."
        }
      ]
    },
    {
      "type": "accordion",
      "title": "🧐 Mini-Quiz de Autoavaliação",
      "items": [
        {
          "title": "1. Num sistema de e-commerce, qual das seguintes opções é um exemplo de FEEDBACK?",
          "content": [
            {
              "type": "list",
              "items": [
                "a) O clique do utilizador no botão \"comprar\".",
                "b) A validação do número do cartão de crédito.",
                "c) O e-mail de confirmação de compra enviado ao cliente.",
                "d) O relatório de produtos mais visitados que o sistema gera para o gestor."
              ]
            },
            {
              "type": "paragraph",
              "text": "Resposta correta: d. O relatório é uma informação sobre as saídas (visitas) que retorna ao sistema (gestores) para ajustar futuras estratégias (processamento)."
            }
          ]
        },
        {
          "title": "2. O conceito de \"melhoria contínua\" em Sistemas de Informação está mais diretamente ligado a qual componente do sistema?",
          "content": "Resposta: Ao Feedback. É através do ciclo de feedback que um sistema recolhe dados sobre o seu desempenho, permitindo que os programadores e gestores façam ajustes e melhorias contínuas."
        },
        {
          "title": "3. Verdadeiro ou Falso: A palavra-passe que digita numa caixa multibanco é uma SAÍDA do sistema.",
          "content": "Resposta: Falso. A palavra-passe é uma ENTRADA, um dado que fornece ao sistema para que ele possa processar (validar) a sua identidade."
        }
      ]
    },
    {
      "type": "bibliographyBlock",
      "title": "📚 Bibliografia",
      "references": [
        "STAIR, Ralph M.; REYNOLDS, George W. Princípios de sistemas de informação. 14. ed. São Paulo: Cengage Learning, 2021.",
        "SILVA, K.C.N.D.; BARBOSA, C.; JUNIOR, R.S.C. Sistemas de informações gerenciais. Porto Alegre: Grupo A, 2019."
      ]
    }
  ],
  "formatVersion": "md3.lesson.v1",
  "slug": "componentes-e-caracteristicas-dos-sistemas",
  "summary": "Investiga elementos estruturais dos sistemas e como características como retroalimentação e sinergia aparecem em contextos organizacionais.",
  "objectives": [
    "Listar componentes fundamentais de sistemas organizacionais.",
    "Diferenciar propriedades como sinergia, entropia e feedback.",
    "Aplicar conceitos a estudos de caso de TI."
  ],
  "competencies": ["Análise sistêmica", "Pensamento crítico", "Modelagem organizacional"],
  "skills": [
    "Mapear entradas, processos e saídas de sistemas reais.",
    "Identificar laços de realimentação positivos e negativos.",
    "Relacionar falhas sistêmicas a desequilíbrios de componentes."
  ],
  "outcomes": [
    "Produz mapa conceitual dos componentes de um sistema escolhido.",
    "Explica efeitos de feedback e entropia em cenários organizacionais.",
    "Propõe melhorias sistêmicas com base na análise realizada."
  ],
  "prerequisites": [
    "Definição de sistemas e tipos básicos.",
    "Leitura dos materiais da aula 1 e 2."
  ],
  "tags": ["componentes", "caracteristicas", "feedback"],
  "duration": 110,
  "modality": "in-person",
  "resources": [
    {
      "label": "Artigo: Leverage points for intervening in systems (Donella Meadows)",
      "url": "https://donellameadows.org/wp-content/userfiles/Leverage_Points.pdf",
      "type": "article"
    },
    {
      "label": "Estudo de caso: Transformação logística com gêmeos digitais",
      "url": "https://www.preprints.org/manuscript/202503.0005/v1/download",
      "type": "case"
    }
  ],
  "bibliography": [
    "BERTALANFFY, L. Teoria Geral dos Sistemas. Vozes, 2015.",
    "SENGE, P. A Quinta Disciplina. Best Seller, 2020."
  ],
  "assessment": {
    "type": "formative",
    "description": "Mapa conceitual em grupo com devolutiva em sala."
  },
  "metadata": {
    "status": "published",
    "updatedAt": "2025-02-08T00:00:00.000Z",
    "owners": ["Prof. Tiago Sombra"],
    "sources": ["Plano de ensino TGS 2025.1"]
  }
}
