{
  "id": "lesson-10",
  "title": "Aula 10: Níveis dos Sistemas de Informação (Operacional, Tático e Estratégico)",
  "objective": "Consolidar conhecimentos essenciais sobre níveis dos sistemas de informação (operacional, tático e estratégico).",
  "content": [
    {
      "type": "flightPlan",
      "title": "Plano de voo da aula",
      "items": [
        "Ponto de partida: Revisar rapidamente os conceitos de sistemas operacionais, táticos e estratégicos.",
        "Mapear o terreno: Identificar como cada nível atende demandas específicas do negócio.",
        "Estudo de caso: Analisar um cenário real com indicadores de desempenho e pontos de falha.",
        "Oficina colaborativa: Definir recomendações para alinhar processos entre os níveis.",
        "Registro no portfólio: Documentar aprendizados e próximos passos para o projeto integrador."
      ]
    },
    {
      "type": "cardGrid",
      "title": "Os três níveis dos Sistemas de Informação",
      "cards": [
        {
          "title": "Operacional",
          "content": "Sustenta o dia a dia com registros transacionais (TPS, ERPs de base). Enfatiza precisão, tempo real e padronização."
        },
        {
          "title": "Tático",
          "content": "Transforma dados operacionais em análises gerenciais (MIS, dashboards). Apoia coordenação de equipes e otimização de recursos."
        },
        {
          "title": "Estratégico",
          "content": "Integra informações internas e externas (ESS, BI avançado) para direcionar a visão de longo prazo e a inovação."
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "Indicadores e decisões por nível",
      "content": [
        {
          "type": "paragraph",
          "text": "Cada camada responde a perguntas diferentes. Ao identificar os indicadores corretos, conseguimos alinhar processos e evitar gargalos."
        },
        {
          "type": "md3Table",
          "headers": ["Nível", "Decisões típicas", "Indicadores de sucesso"],
          "rows": [
            [
              {
                "value": "Operacional"
              },
              {
                "value": "Processamento de pedidos, controle de estoque, apontamento de produção."
              },
              {
                "value": "Tempo de ciclo, taxa de erro, custo por transação."
              }
            ],
            [
              {
                "value": "Tático"
              },
              {
                "value": "Planejamento de capacidade, campanhas regionais, gestão de equipe."
              },
              {
                "value": "Cumprimento de metas, eficiência de processos, satisfação da equipe."
              }
            ],
            [
              {
                "value": "Estratégico"
              },
              {
                "value": "Entrada em novos mercados, parcerias estratégicas, inovação de produtos."
              },
              {
                "value": "Participação de mercado, valor para o cliente, retorno sobre investimento."
              }
            ]
          ]
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "Estudo de caso guiado",
      "content": [
        {
          "type": "paragraph",
          "text": "Analise o caso da rede varejista Futura Market, que enfrenta atrasos na reposição e decisões lentas sobre expansão."
        },
        {
          "type": "orderedList",
          "items": [
            {
              "title": "Coleta de dados",
              "text": "Quais sistemas atualmente alimentam cada nível? Identifique fontes internas e externas."
            },
            {
              "title": "Diagnóstico",
              "text": "Quais indicadores estão faltando ou são pouco confiáveis? Relacione com as decisões críticas atrasadas."
            },
            {
              "title": "Recomendações",
              "text": "Proponha integrações ou automações que conectem o operacional ao estratégico, priorizando quick wins."
            }
          ]
        }
      ]
    },
    {
      "type": "callout",
      "variant": "info",
      "title": "Atividade em grupo",
      "content": [
        {
          "type": "paragraph",
          "text": "Monte um mapa visual mostrando quais equipes consomem dados de cada nível e como o fluxo de informações pode ser melhorado."
        }
      ]
    },
    {
      "type": "checklist",
      "title": "Registro no portfólio",
      "items": [
        "Resumo das percepções sobre o caso Futura Market.",
        "Tabela com indicadores-chave por nível na organização escolhida pelo grupo.",
        "Próximos passos para aprofundar a análise sistêmica no projeto integrador."
      ]
    }
  ],
  "formatVersion": "md3.lesson.v1",
  "slug": "aula-10-niveis-dos-sistemas-de-informacao-operacional-tatico-e-estrategico",
  "summary": "Explora como sistemas operacionais, táticos e estratégicos se articulam para sustentar decisões em diferentes níveis da organização.",
  "objectives": [
    "Consolidar conhecimentos essenciais sobre níveis dos sistemas de informação (operacional, tático e estratégico).",
    "Relacionar conceitos da aula a desafios organizacionais reais.",
    "Planejar como aplicar os aprendizados em projetos acadêmicos ou profissionais."
  ],
  "competencies": [
    "Pensamento sistêmico aplicado",
    "Análise crítica organizacional",
    "Comunicação interdisciplinar"
  ],
  "skills": [
    "Elaborar sínteses estruturadas sobre o tema da aula.",
    "Conectar evidências práticas aos fundamentos teóricos.",
    "Registrar recomendações acionáveis para a organização estudada."
  ],
  "outcomes": [
    "Produz análise alinhada ao foco sistêmico da aula.",
    "Apresenta argumentos que sustentam decisões de gestão.",
    "Documenta próximos passos para aprofundar o tema em projetos."
  ],
  "prerequisites": [
    "Revisar conceitos fundamentais das aulas anteriores.",
    "Ler o material preparatório indicado no AVA."
  ],
  "tags": ["aula-10-niveis"],
  "duration": 110,
  "modality": "in-person",
  "resources": [
    {
      "label": "Guia de apoio da aula",
      "url": "https://example.edu/tgs/apoio-aula",
      "type": "guide"
    },
    {
      "label": "Estudo de caso para discussão",
      "url": "https://example.edu/tgs/caso-estudo",
      "type": "case"
    }
  ],
  "bibliography": [
    "BERTALANFFY, L. Teoria Geral dos Sistemas. Vozes, 2015.",
    "SENGE, P. A Quinta Disciplina. Best Seller, 2020."
  ],
  "assessment": {
    "type": "formative",
    "description": "Registro reflexivo no portfólio com evidências da aprendizagem da aula."
  },
  "metadata": {
    "status": "published",
    "updatedAt": "2025-02-08T00:00:00.000Z",
    "owners": ["Prof. Tiago Sombra"],
    "sources": ["Plano de ensino TGS 2025.1"]
  }
}
