{
  "id": "lesson1",
  "title": "Aula 1: Unidade I – Fundamentos do Android",
  "objective": "",
  "content": [
    {
      "type": "legacySection",
      "id": "aula1",
      "title": "Resumo em Áudio da Aula",
      "html": "<div data-legacy-card=\"\"> <audio controls=\"\"> <source src=\"assets/resumo_aula_1.mp3\" type=\"audio/mpeg\"> O seu navegador não suporta o elemento de áudio. </audio> </div> <div data-legacy-card=\"\"> <h3> Plano de Voo da Aula (1h 40min) </h3> <ul> <li> <strong>(15 min) Check-in e Apresentação da Disciplina:</strong> Discussão sobre o plano de ensino, metodologia, avaliação e expectativas da turma. </li> <li> <strong>(40 min) A Revolução Móvel e a História do Android:</strong> Uma viagem interativa desde a fundação da Android Inc. até aos dias de hoje. </li> <li> <strong>(30 min) O Ecossistema Android:</strong> Análise da dominância de mercado, o modelo de negócio (AOSP vs GMS) e a importância do Kotlin. </li> <li> <strong>(15 min) Encerramento e Próximos Passos:</strong> Explicação da tarefa (TED), apresentação da bibliografia e espaço para dúvidas. </li> </ul> </div> <div data-legacy-grid=\"\"> <div data-legacy-card=\"\"> <h5>Check-in Inicial: Vamos Conversar!</h5> <p> Antes de começarmos, vamos aquecer os motores. Qual foi a aplicação que mais usaram hoje? O que te fascinou nela? A sua experiência como usuário é o ponto de partida para se tornarem excelentes desenvolvedores. </p> </div> <div data-legacy-card=\"\"> <button aria-expanded=\"false\"> <span>Plano de Ensino e Objetivos</span> <span>▼</span> </button> <div style=\"max-height: 0px\"> <div> <h4>Objetivo Geral:</h4> <p> Capacitar o aluno para projetar, implementar e testar aplicativos móveis Android, utilizando a linguagem <strong>Kotlin</strong> e ferramentas modernas do ecossistema Android. O curso abrange tanto móveis nativas e híbridas, compreendendo boas práticas de persistência local, consumo de APIs e integração com serviços backend modernos. </p> <h4>Objetivos Específicos:</h4> <ul> <li> Criar interfaces e controlar a navegação em apps Android com <strong>Kotlin</strong>. </li> <li> Implementar persistência local com <strong>SharedPreferences</strong> e <strong>Room</strong>. </li> <li> Consumir APIs <strong>RESTful</strong> com <strong>Retrofit</strong> e corrotinas. </li> <li> Integrar funcionalidades com <strong>Firebase</strong> (Firestore e Autenticação). </li> <li> Aplicar boas práticas com <strong>ViewModel</strong> e <strong>LiveData</strong>. </li> <li> Compreender os fundamentos do desenvolvimento híbrido com <strong>React Native</strong>. </li> </ul> </div> </div> </div> <div data-legacy-card=\"\"> <button aria-expanded=\"false\"> <span>Metodologia e Avaliação</span> <span>▼</span> </button> <div style=\"max-height: 0px\"> <div> <h4>Metodologia:</h4> <p> Aulas expositivas e dialogadas com apoio de slides, exploração do ambiente institucional (AVA/Moodle, biblioteca digital) e abertura para perguntas. A participação ativa é fundamental! </p> <h4> Critérios de Avaliação: </h4> <ul> <li><strong>NP1:</strong> (Trabalho + Prova * 2) / 3</li> <li><strong>NP2:</strong> (Trabalho + Prova * 2) / 3</li> <li><strong>NP3:</strong> 10,0</li> <li><strong>NF:</strong> (NP1 + NP2 + NP3) / 3</li> </ul> <h5> Para aprovação, o aluno deve atender a três condições: </h5> <ol> <li>Mínimo de 75% de presença na disciplina.</li> <li>Nota Final (NF) maior ou igual a 5,0.</li> <li>Nota da NP3 maior ou igual a 4,0.</li> </ol> </div> </div> </div> </div> <div id=\"anatomia\" data-legacy-card=\"\"> <h3> A Anatomia de uma Aplicação Móvel </h3> <div> <p> Antes de mergulharmos nos detalhes, é útil ter um mapa mental de como qualquer aplicação funciona. Podemos pensar numa app como sendo composta por três pilares fundamentais. Ao longo da disciplina, vamos construir cada uma destas partes. </p> <div> <div> <h4> 1. Interface do Usuário (UI) </h4> <p> É a parte visual, com a qual o usuário interage: os botões, textos, imagens e telas. Vamos construir isto com XML e, mais tarde, com Jetpack Compose. </p> </div> <div> <h4>2. Lógica de Negócio</h4> <p> É o \"cérebro\" da aplicação. Onde as regras, os cálculos e as decisões acontecem. É aqui que o nosso código <strong>Kotlin</strong> vai brilhar. </p> </div> <div> <h4>3. Dados</h4> <p> É a informação que a nossa app manipula. Pode ser armazenada localmente no dispositivo (com <strong>Room</strong>) ou na nuvem (com <strong>Firebase</strong>). </p> </div> </div> </div> </div> <div id=\"revolucao\" data-legacy-card=\"\"> <h3> O Palco da Revolução Móvel: O Mundo Pré-Android </h3> <div> <p> Antes do Android e do iPhone, o mundo dos celulares era muito diferente. Era dominado por sistemas como <strong>Symbian</strong> (Nokia), <strong>BlackBerry OS</strong> e <strong>Windows Mobile</strong>. Cada um era um \"jardim murado\", com desafios significativos: </p> <ul> <li> <strong>Para o Usuário:</strong> A experiência era fragmentada. A \"loja de apps\" de um Nokia era completamente diferente da de um BlackBerry. Instalar uma aplicação era muitas vezes um processo complicado e pouco intuitivo. </li> <li> <strong>Para o Desenvolvedor:</strong> Este era o maior obstáculo. O desenvolvimento era caro e complexo. Para lançar uma aplicação, era preciso criar e manter versões completamente diferentes para cada sistema operativo. O Android propôs uma plataforma unificada, de código aberto e gratuita, o que foi absolutamente revolucionário e democratizou o desenvolvimento de apps. </li> </ul> </div> </div> <div id=\"historia\" data-legacy-card=\"\"> <h3> A História do Android </h3> <div> <div id=\"timeline-container\"></div> <div> <div id=\"timeline-details\"> <h4 id=\"details-title\"> Selecione um marco </h4> <p id=\"details-year\"></p> <div id=\"details-content\"> <p> Clique num item da linha do tempo à esquerda para ver os detalhes aqui. </p> </div> </div> </div> </div> </div> <div id=\"importancia\" data-legacy-card=\"\"> <h3> Importância e Ecossistema do Android </h3> <div> <p> O domínio do Android no mercado global é inegável, detendo a maior fatia do mercado de sistemas operacionais móveis. Mas o que isso significa na prática? </p> <div> <canvas id=\"marketShareChart\"></canvas> </div> <h4> AOSP vs. GMS: O Coração Aberto e a Mente do Google </h4> <p> Esta é uma das distinções mais importantes no mundo Android. Não são a mesma coisa! </p> <div> <div> <h5> AOSP (Android Open Source Project) </h5> <p> É a base, o \"coração\" do Android. Um sistema operativo de código aberto e gratuito que qualquer fabricante pode modificar e usar nos seus dispositivos. Inclui o kernel Linux, as bibliotecas base e uma interface de usuário simples. </p> <p> <strong>Exemplo:</strong> O sistema Fire OS da Amazon é baseado no AOSP, mas não inclui os serviços da Google. </p> </div> <div> <h5>GMS (Google Mobile Services)</h5> <p> É a camada de software proprietária da Google que roda por cima do AOSP. Inclui as aplicativos móveis Android, utilizando a linguagem <strong>Kotlin</strong> e ferramentas modernas do ecossistema Android. O curso abrange tanto e APIs que a maioria dos usuários associa ao Android: Google Play Store, Gmail, Google Maps, YouTube, e serviços essenciais como o Firebase Cloud Messaging. </p> <p> <strong>Importância:</strong> Para um fabricante ter acesso à Play Store, precisa de licenciar o GMS e seguir as regras da Google. </p> </div> </div> <div> <h5>Para o Desenvolvedor</h5> <p> Saber esta diferença é crucial. Se a sua aplicação depende de uma API do Google Maps, por exemplo, ela não funcionará num dispositivo que só tem o AOSP. Pode aprender mais na <a href=\"https://source.android.com/\" target=\"_blank\">página oficial do AOSP</a>. </p> </div> <h4> Kotlin-First: A Evolução da Programação Android </h4> <p> Em 2019, a Google anunciou que o desenvolvimento Android seria \"Kotlin-first\". Mas porquê abandonar o Java, que foi a linguagem principal durante tantos anos? </p> <div> <div> <h5>Java (O Clássico)</h5> <pre><code>button.setOnClickListener(new View.OnClickListener() { @Override public void onClick(View v) { System.out.println(\"Botão clicado!\"); }\n});</code></pre> </div> <div> <h5>Kotlin (O Moderno)</h5> <pre><code>button.setOnClickListener { println(\"Botão clicado!\")\n}</code></pre> </div> </div> <p> Como o exemplo acima ilustra, o Kotlin é muito mais <strong>conciso</strong>. Mas as vantagens vão além: </p> <ul> <li> <strong>Segurança contra Nulos (Null Safety):</strong> O sistema de tipos do Kotlin ajuda a eliminar os <code-text>NullPointerException</code-text>, os erros mais temidos pelos desenvolvedores Java. </li> <li> <strong>Interoperabilidade:</strong> Pode ter código Kotlin e Java a coexistir no mesmo projeto sem qualquer problema, permitindo uma migração gradual. </li> <li> <strong>Corrotinas:</strong> Simplificam drasticamente a programação assíncrona (tarefas que rodam em segundo plano, como chamadas de rede), tornando o código mais legível e menos propenso a erros. </li> <li> <strong>Preparado para o Futuro:</strong> O Kotlin é a base para as tecnologias mais modernas do ecossistema, como o <strong>Jetpack Compose</strong>, o novo toolkit declarativo para a construção de interfaces de usuário. </li> </ul> <div> <h5>Assista ao Anúncio!</h5> <p> A decisão de tornar o Kotlin a linguagem principal foi um marco. Pode ver mais sobre a visão da Google no <a href=\"https://youtu.be/ldM6QZy9e0s\" target=\"_blank\">anúncio oficial durante o Google I/O 2019</a>. </p> </div> </div> </div> <div id=\"nosso-projeto\" data-legacy-card=\"\"> <h3> O Nosso Primeiro Projeto: O Que Vamos Construir? </h3> <div> <p> Para que a teoria não fique abstrata, vamos ter um objetivo prático desde o início. Ao longo das próximas aulas da Unidade I, vamos aplicar os conceitos que aprendemos para construir uma aplicação simples de \"Boas-vindas\". </p> <div> <img src=\"https://placehold.co/200x400/e0e7ff/3730a3?text=App+Ol%C3%A1+Mundo\" alt=\"Mockup da aplicação Olá Mundo\"> <div> <h4>App \"Olá, [Nome]!\"</h4> <p> A nossa meta será criar um tela onde o usuário pode inserir o seu nome num campo de texto. Ao clicar num botão, a aplicação irá exibir uma mensagem de saudação personalizada, como \"Olá, Tiago!\". </p> <p> Com este projeto simples, vamos aprender na prática a usar componentes de UI, manipular eventos de clique e gerir dados básicos. </p> </div> </div> </div> </div> <div id=\"tarefa\" data-legacy-grid=\"\"> <h3> Encerramento e Próximos Passos </h3> <div data-legacy-card=\"\"> <h5>Tarefa para a próxima aula (TED)</h5> <p> Para aprofundar o nosso conhecimento sobre a evolução do Android e refletir sobre a disciplina, a tarefa é a seguinte: </p> <ol> <li> Ler o Capítulo 1 da obra \"Desenvolvimento para Dispositivos Móveis\" (SAGAH, 2019). </li> <li> Listar pelo menos 5 marcos importantes da evolução do Android para discutirmos na próxima aula. </li> <li> Acesse ao Moodle e postar no fórum da \"Aula 1\" um parágrafo respondendo: <strong>“Como espero usar programação no meu futuro profissional?”</strong>. </li> </ol> </div> <div data-legacy-card=\"\"> <h4> Bibliografia Recomendada </h4> <ul> <li> OLIVEIRA, Diego Bittencourt de et al. <strong>Desenvolvimento para Dispositivos Móveis</strong>. Porto Alegre: SAGAH, 2019. v. 1. </li> <li> URMA, Raoul-Gabriel; WARBURTON, Richard. <strong>Desenvolvimento Real de Software: Um Guia de Projetos para Fundamentos em Java</strong>. Alta Books, 2021. </li> </ul> </div> </div>"
    }
  ]
}
