{
  "formatVersion": "md3.lesson.v1",
  "id": "lesson-01",
  "title": "Aula 1: Unidade I – Fundamentos do Android",
  "summary": "Panorama do ecossistema Android, objetivos da disciplina e expectativas para a jornada mobile ao longo do semestre.",
  "objective": "Apresentação da disciplina, seus objetivos, métodos e a importância do Android no mercado.",
  "objectives": [
    "Apresentar os pilares, critérios e entregáveis da disciplina de desenvolvimento mobile.",
    "Contextualizar a evolução do Android e seu impacto no mercado contemporâneo."
  ],
  "competencies": [
    "Planejamento de jornadas de aprendizagem em desenvolvimento mobile",
    "Contextualização de ecossistemas tecnológicos em cenários reais"
  ],
  "skills": [
    "Explicar a linha do tempo e os marcos do Android",
    "Identificar oportunidades profissionais ligadas ao ecossistema Android"
  ],
  "outcomes": [
    "Apresenta o plano de ensino, critérios de avaliação e expectativas para a turma.",
    "Relaciona versões do Android a inovações de mercado e modelos de distribuição."
  ],
  "prerequisites": ["Familiaridade básica com smartphones Android e uso de aplicativos."],
  "tags": ["android", "fundamentos", "ecossistema"],
  "duration": 100,
  "modality": "in-person",
  "resources": [
    {
      "label": "Android Developers – Platform Overview",
      "url": "https://developer.android.com/guide",
      "type": "article"
    },
    {
      "label": "Mobile OS Market Share (StatCounter)",
      "url": "https://gs.statcounter.com/os-market-share/mobile/worldwide",
      "type": "report"
    }
  ],
  "bibliography": [
    "Google. \"Android Developers – Overview.\" 2024.",
    "StatCounter. \"Mobile Operating System Market Share Worldwide.\" 2024."
  ],
  "assessment": {
    "type": "diagnostic",
    "description": "Checklist de participação no check-in inicial e registro das expectativas individuais."
  },
  "content": [
    {
      "type": "audioBlock",
      "title": "Resumo em Áudio da Aula",
      "src": "content/ddm/lessons/assets/resumo_aula_1.mp3"
    },
    {
      "type": "flightPlan",
      "title": "Plano de Voo da Aula (1h 40min)",
      "items": [
        "(15 min) Check-in e Apresentação da Disciplina: Discussão sobre o plano de ensino, metodologia, avaliação e expectativas da turma.",
        "(40 min) A Revolução Móvel e a História do Android: Uma viagem interativa desde a fundação da Android Inc. até aos dias de hoje.",
        "(30 min) O Ecossistema Android: Análise da dominância de mercado, o modelo de negócio (AOSP vs GMS) e a importância do Kotlin.",
        "(15 min) Encerramento e Próximos Passos: Explicação da tarefa (TED), apresentação da bibliografia e espaço para dúvidas."
      ]
    },
    {
      "type": "callout",
      "variant": "info",
      "title": "Check-in Inicial: Vamos Conversar!",
      "content": [
        {
          "type": "paragraph",
          "text": "Antes de começarmos, vamos aquecer os motores. Qual foi a aplicação que mais usaram hoje? O que te fascinou nela? A sua experiência como usuário é o ponto de partida para se tornarem excelentes desenvolvedores."
        }
      ]
    },
    {
      "type": "accordion",
      "items": [
        {
          "title": "Plano de Ensino e Objetivos",
          "content": "Objetivo Geral:\nCapacitar o aluno para projetar, implementar e testar aplicativos móveis Android, utilizando a linguagem Kotlin e ferramentas modernas do ecossistema Android. O curso abrange tanto móveis nativas e híbridas, compreendendo boas práticas de persistência local, consumo de APIs e integração com serviços backend modernos.\nObjetivos Específicos:\n- Criar interfaces e controlar a navegação em apps Android com Kotlin.\n- Implementar persistência local com SharedPreferences e Room.\n- Consumir APIs RESTful com Retrofit e corrotinas.\n- Integrar funcionalidades com Firebase (Firestore e Autenticação).\n- Aplicar boas práticas com ViewModel e LiveData.\n- Compreender os fundamentos do desenvolvimento híbrido com React Native."
        },
        {
          "title": "Metodologia e Avaliação",
          "content": "Metodologia:\nAulas expositivas e dialogadas com apoio de slides, exploração do ambiente institucional (AVA/Moodle, biblioteca digital) e abertura para perguntas. A participação ativa é fundamental!\nCritérios de Avaliação:\n- NP1: (Trabalho + Prova * 2) / 3\n- NP2: (Trabalho + Prova * 2) / 3\n- NP3: 10,0\n- NF: (NP1 + NP2 + NP3) / 3\nPara aprovação, o aluno deve atender a três condições:\n- Mínimo de 75% de presença na disciplina.\n- Nota Final (NF) maior ou igual a 5,0.\n- Nota da NP3 maior ou igual a 4,0."
        }
      ]
    },
    {
      "type": "cardGrid",
      "title": "A Anatomia de uma Aplicação Móvel",
      "cards": [
        {
          "title": "1. Interface do Usuário (UI)",
          "content": "É a parte visual, com a qual o usuário interage: os botões, textos, imagens e telas. Vamos construir isto com XML e, mais tarde, com Jetpack Compose."
        },
        {
          "title": "2. Lógica de Negócio",
          "content": "É o \"cérebro\" da aplicação. Onde as regras, os cálculos e as decisões acontecem. É aqui que o nosso código Kotlin vai brilhar."
        },
        {
          "title": "3. Dados",
          "content": "É a informação que a nossa app manipula. Pode ser armazenada localmente no dispositivo (com Room) ou na nuvem (com Firebase)."
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "O Palco da Revolução Móvel: O Mundo Pré-Android",
      "content": [
        {
          "type": "paragraph",
          "text": "Antes do Android e do iPhone, o mundo dos celulares era muito diferente. Era dominado por sistemas como Symbian (Nokia), BlackBerry OS e Windows Mobile. Cada um era um \"jardim murado\", com desafios significativos:"
        },
        {
          "type": "list",
          "items": [
            "Para o Usuário: A experiência era fragmentada. A \"loja de apps\" de um Nokia era completamente diferente da de um BlackBerry. Instalar uma aplicação era muitas vezes um processo complicado e pouco intuitivo.",
            "Para o Desenvolvedor: Este era o maior obstáculo. O desenvolvimento era caro e complexo. Para lançar uma aplicação, era preciso criar e manter versões completamente diferentes para cada sistema operativo. O Android propôs uma plataforma unificada, de código aberto e gratuita, o que foi absolutamente revolucionário e democratizou o desenvolvimento de apps."
          ]
        }
      ]
    },
    {
      "type": "timeline",
      "title": "A História do Android",
      "steps": [
        {
          "title": "2003: A Fundação",
          "content": "Andy Rubin, Rich Miner, Nick Sears e Chris White fundam a Android Inc. com a visão de criar sistemas operativos mais inteligentes para câmaras digitais."
        },
        {
          "title": "2005: A Aquisição pela Google",
          "content": "A Google adquire a Android Inc. por cerca de 50 milhões de dólares, um dos melhores negócios da história da tecnologia."
        },
        {
          "title": "2007: O Anúncio",
          "content": "A Google anuncia oficialmente o Android e a formação da Open Handset Alliance (OHA), um consórcio de empresas para desenvolver padrões abertos para dispositivos móveis."
        },
        {
          "title": "2008: O Primeiro Dispositivo",
          "content": "O HTC Dream (ou T-Mobile G1) é lançado, o primeiro smartphone comercial a correr o sistema operativo Android."
        },
        {
          "title": "2010-2014: A Ascensão",
          "content": "O Android cresce exponencialmente, ultrapassando o Symbian e o iOS em quota de mercado, impulsionado por fabricantes como a Samsung, HTC e LG."
        },
        {
          "title": "2019: Kotlin-First",
          "content": "A Google declara o Kotlin como a linguagem preferencial para o desenvolvimento Android, um marco na evolução da plataforma."
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "Importância e Ecossistema do Android",
      "content": [
        {
          "type": "paragraph",
          "text": "O domínio do Android no mercado global é inegável, detendo a maior fatia do mercado de sistemas operacionais móveis. Mas o que isso significa na prática?"
        },
        {
          "type": "chart",
          "chartType": "pie",
          "data": {
            "labels": ["Android", "iOS", "Outros"],
            "datasets": [
              {
                "label": "Market Share",
                "data": [71.8, 27.6, 0.6],
                "backgroundColor": ["#4CAF50", "#9E9E9E", "#F44336"]
              }
            ]
          }
        },
        {
          "type": "contentBlock",
          "title": "AOSP vs. GMS: O Coração Aberto e a Mente do Google",
          "content": [
            {
              "type": "paragraph",
              "text": "Esta é uma das distinções mais importantes no mundo Android. Não são a mesma coisa!"
            },
            {
              "type": "cardGrid",
              "cards": [
                {
                  "title": "AOSP (Android Open Source Project)",
                  "content": "É a base, o \"coração\" do Android. Um sistema operativo de código aberto e gratuito que qualquer fabricante pode modificar e usar nos seus dispositivos. Inclui o kernel Linux, as bibliotecas base e uma interface de usuário simples.\nExemplo: O sistema Fire OS da Amazon é baseado no AOSP, mas não inclui os serviços da Google."
                },
                {
                  "title": "GMS (Google Mobile Services)",
                  "content": "É a camada de software proprietária da Google que roda por cima do AOSP. Inclui as aplicativos móveis Android, utilizando a linguagem Kotlin e ferramentas modernas do ecossistema Android. O curso abrange tanto e APIs que a maioria dos usuários associa ao Android: Google Play Store, Gmail, Google Maps, YouTube, e serviços essenciais como o Firebase Cloud Messaging.\nImportância: Para um fabricante ter acesso à Play Store, precisa de licenciar o GMS e seguir as regras da Google."
                }
              ]
            },
            {
              "type": "callout",
              "variant": "info",
              "title": "Para o Desenvolvedor",
              "content": [
                {
                  "type": "paragraph",
                  "text": "Saber esta diferença é crucial. Se a sua aplicação depende de uma API do Google Maps, por exemplo, ela não funcionará num dispositivo que só tem o AOSP. Pode aprender mais na página oficial do AOSP (https://source.android.com/)."
                }
              ]
            }
          ]
        },
        {
          "type": "contentBlock",
          "title": "Kotlin-First: A Evolução da Programação Android",
          "content": [
            {
              "type": "paragraph",
              "text": "Em 2019, a Google anunciou que o desenvolvimento Android seria \"Kotlin-first\". Mas porquê abandonar o Java, que foi a linguagem principal durante tantos anos?"
            },
            {
              "type": "code",
              "language": "kotlin",
              "code": "// Java (O Clássico)\nbutton.setOnClickListener(new View.OnClickListener() {\n    @Override\n    public void onClick(View v) {\n        System.out.println(\"Botão clicado!\");\n    }\n});\n\n// Kotlin (O Moderno)\nbutton.setOnClickListener {    println(\"Botão clicado!\")\n}"
            },
            {
              "type": "paragraph",
              "text": "Como o exemplo acima ilustra, o Kotlin é muito mais conciso. Mas as vantagens vão além:"
            },
            {
              "type": "list",
              "items": [
                "Segurança contra Nulos (Null Safety): O sistema de tipos do Kotlin ajuda a eliminar os NullPointerException, os erros mais temidos pelos desenvolvedores Java.",
                "Interoperabilidade: Pode ter código Kotlin e Java a coexistir no mesmo projeto sem qualquer problema, permitindo uma migração gradual.",
                "Corrotinas: Simplificam drasticamente a programação assíncrona (tarefas que rodam em segundo plano, como chamadas de rede), tornando o código mais legível e menos propenso a erros.",
                "Preparado para o Futuro: O Kotlin é a base para as tecnologias mais modernas do ecossistema, como o Jetpack Compose, o novo toolkit declarativo para a construção de interfaces de usuário."
              ]
            },
            {
              "type": "callout",
              "variant": "info",
              "title": "Assista ao Anúncio!",
              "content": [
                {
                  "type": "paragraph",
                  "text": "A decisão de tornar o Kotlin a linguagem principal foi um marco. Pode ver mais sobre a visão da Google no anúncio oficial durante o Google I/O 2019 (https://youtu.be/ldM6QZy9e0s)."
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "O Nosso Primeiro Projeto: O Que Vamos Construir?",
      "content": [
        {
          "type": "paragraph",
          "text": "Para que a teoria não fique abstrata, vamos ter um objetivo prático desde o início. Ao longo das próximas aulas da Unidade I, vamos aplicar os conceitos que aprendemos para construir uma aplicação simples de \"Boas-vindas\"."
        },
        {
          "type": "image",
          "src": "https://placehold.co/200x400/e0e7ff/3730a3?text=App+Ol%C3%A1+Mundo",
          "alt": "Mockup da aplicação Olá Mundo"
        },
        {
          "type": "contentBlock",
          "title": "App \"Olá, [Nome]!\"",
          "content": [
            {
              "type": "paragraph",
              "text": "A nossa meta será criar um tela onde o usuário pode inserir o seu nome num campo de texto. Ao clicar num botão, a aplicação irá exibir uma mensagem de saudação personalizada, como \"Olá, Tiago!\"."
            },
            {
              "type": "paragraph",
              "text": "Com este projeto simples, vamos aprender na prática a usar componentes de UI, manipular eventos de clique e gerir dados básicos."
            }
          ]
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "Encerramento e Próximos Passos",
      "content": [
        {
          "type": "callout",
          "variant": "task",
          "title": "Tarefa para a próxima aula (TED)",
          "content": [
            {
              "type": "paragraph",
              "text": "Para aprofundar o nosso conhecimento sobre a evolução do Android e refletir sobre a disciplina, a tarefa é a seguinte:"
            },
            {
              "type": "list",
              "ordered": true,
              "items": [
                "Ler o Capítulo 1 da obra \"Desenvolvimento para Dispositivos Móveis\" (SAGAH, 2019).",
                "Listar pelo menos 5 marcos importantes da evolução do Android para discutirmos na próxima aula.",
                "Acesse ao Moodle e postar no fórum da \"Aula 1\" um parágrafo respondendo: “Como espero usar programação no meu futuro profissional?”."
              ]
            }
          ]
        },
        {
          "type": "bibliographyBlock",
          "title": "Bibliografia Recomendada",
          "references": [
            "OLIVEIRA, Diego Bittencourt de et al. Desenvolvimento para Dispositivos Móveis. Porto Alegre: SAGAH, 2019. v. 1.",
            "URMA, Raoul-Gabriel; WARBURTON, Richard. Desenvolvimento Real de Software: Um Guia de Projetos para Fundamentos em Java. Alta Books, 2021."
          ]
        }
      ]
    }
  ],
  "metadata": {
    "status": "in-review",
    "updatedAt": "2024-05-05T00:00:00.000Z",
    "owners": ["Prof. Tiago Sombra"],
    "sources": ["Plano de ensino DDM 2024.1"]
  }
}
