{
  "formatVersion": "md3.lesson.v1",
  "id": "lesson-02",
  "title": "Aula 2: Unidade I – Configuração do Ambiente de Desenvolvimento",
  "summary": "Instalação e configuração do Android Studio, SDKs e emuladores para iniciar o desenvolvimento com Kotlin.",
  "objective": "Preparar o ambiente Android, instalando e configurando as ferramentas essenciais para a criação de aplicativos.",
  "objectives": [
    "Configurar o ambiente oficial de desenvolvimento Android em diferentes sistemas operacionais.",
    "Gerar o primeiro projeto Kotlin verificando dependências e execução no emulador."
  ],
  "competencies": ["Configuração de ambientes de desenvolvimento mobile profissionais"],
  "skills": [
    "Instalar Android Studio e componentes de SDK necessários.",
    "Criar e executar um projeto inicial Kotlin no emulador ou dispositivo físico."
  ],
  "outcomes": [
    "Entrega do checklist de instalação com capturas do Android Studio configurado.",
    "Projeto base Kotlin criado e executado com sucesso no emulador."
  ],
  "prerequisites": ["Conhecimentos básicos de sistemas operacionais e permissões de software."],
  "tags": ["android-studio", "ambiente", "kotlin"],
  "duration": 110,
  "modality": "in-person",
  "resources": [
    {
      "label": "Download do Android Studio",
      "url": "https://developer.android.com/studio",
      "type": "download"
    },
    {
      "label": "Guia oficial do Android Emulator",
      "url": "https://developer.android.com/studio/run/emulator",
      "type": "guide"
    }
  ],
  "bibliography": [
    "Google. \"Install Android Studio.\" 2024.",
    "JetBrains. \"Kotlin Documentation.\" 2024."
  ],
  "assessment": {
    "type": "lab",
    "description": "Checklist prático de instalação e criação do projeto Hello Android."
  },
  "content": [
    {
      "type": "flightPlan",
      "title": "Plano de Voo da Aula",
      "items": [
        "Objetivo Principal: Ao final desta aula, todos deverão ter o Android Studio instalado e um primeiro projeto \"Olá, Mundo!\" funcionando no emulador ou em um dispositivo físico.",
        "Componentes do Ambiente: O que é o JDK, o Android Studio e o SDK? Por que precisamos de cada um?",
        "Instalação Guiada: Foco nos pontos chave e nas opções importantes durante a instalação.",
        "Primeiro Projeto: Criação passo a passo de um aplicativo \"Olá, Mundo!\".",
        "Tour pelo Android Studio: Uma exploração guiada pela interface para nos sentirmos \"em casa\".",
        "Tarefa (TED): Reforçar a importância de replicar o processo em casa."
      ]
    },
    {
      "type": "cardGrid",
      "title": "Os Três Pilares do Nosso Ambiente",
      "cards": [
        {
          "title": "1. JDK (Java Development Kit)",
          "content": "Apesar de programarmos em Kotlin, o Android ainda é construído sobre a plataforma Java. O JDK é a fundação que fornece as bibliotecas e a máquina virtual essenciais para que tudo funcione. Hoje o Android Studio já inclui um JDK embarcado, reduzindo a necessidade de instalações separadas."
        },
        {
          "title": "2. Android Studio",
          "content": "Esta é a nossa oficina principal. É o Ambiente de Desenvolvimento Integrado (IDE) oficial, criado pela Google. Ele inclui o editor de código, ferramentas de depuração, assistentes de layout e tudo o que precisamos para escrever, testar e compilar nossos aplicativos."
        },
        {
          "title": "3. Android SDK & Emulador",
          "content": "Estas são as nossas ferramentas específicas. O SDK (Software Development Kit) contém as APIs e bibliotecas de cada versão do Android. O Emulador (AVD - Android Virtual Device) permite criar celulares virtuais para validar o app sem depender de um dispositivo físico."
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "Instalação e Criação do Primeiro Projeto",
      "content": [
        {
          "type": "paragraph",
          "text": "A instalação do Android Studio hoje em dia é um processo bastante direto. Vamos focar nos passos e decisões mais importantes, que serão a base para todo o nosso trabalho."
        },
        {
          "type": "orderedList",
          "items": [
            {
              "title": "Baixe o Android Studio",
              "text": "Acesse o site oficial em developer.android.com/studio (https://developer.android.com/studio) e faça o download da versão mais recente detectada para o seu sistema operacional."
            },
            {
              "title": "Execute o instalador",
              "text": "Siga o assistente com as opções padrão. Confirme que o componente Android Virtual Device está marcado para incluir o gerenciador de emuladores."
            },
            {
              "title": "Complete a configuração inicial",
              "text": "No primeiro lançamento o Android Studio solicitará o download dos SDKs recomendados. Reserve alguns minutos e mantenha a conexão estável até concluir."
            },
            {
              "title": "Crie um projeto Empty Views",
              "text": "Na tela inicial escolha New Project e selecione o template Empty Views Activity para começar com uma estrutura limpa."
            },
            {
              "title": "Ajuste os detalhes do projeto",
              "text": "Use as opções: Name = OlaMundoAndroid; Package name = br.com.unichristus.ads.olamundoandroid; Language = Kotlin; Minimum SDK = API 26 (Android 8.0)."
            },
            {
              "title": "Finalize e aguarde o Gradle Sync",
              "text": "Clique em Finish para gerar o projeto e aguarde o processo de sincronização baixar as dependências necessárias."
            }
          ]
        },
        {
          "type": "image",
          "src": "https://placehold.co/800x500/e0e7ff/3730a3?text=Seleção+de+Template",
          "alt": "Tela do Android Studio destacando o template Empty Views Activity",
          "caption": "Use o template Empty Views Activity para iniciar o projeto de boas-vindas."
        },
        {
          "type": "subBlock",
          "title": "Execute o aplicativo",
          "items": [
            "Abra Tools > Device Manager para criar um emulador Pixel com imagem recente do Android.",
            "Para testar em um aparelho físico, habilite as opções de desenvolvedor e a depuração USB seguindo o guia oficial (https://developer.android.com/studio/debug/dev-options).",
            "Selecione o destino desejado e pressione o botão Run (play) para ver o app \"Olá, Mundo!\" em execução."
          ]
        },
        {
          "type": "callout",
          "variant": "info",
          "title": "Dica importante",
          "content": [
            {
              "type": "paragraph",
              "text": "Se o Gradle Sync demorar muito, confira a aba Build para identificar downloads pendentes ou permissões bloqueadas pelo sistema operacional."
            }
          ]
        }
      ]
    },
    {
      "type": "cardGrid",
      "title": "Tour Guiado pelo Android Studio",
      "cards": [
        {
          "title": "1. Janela de Projeto (Esquerda)",
          "content": "É o seu explorador de arquivos. Mostra a estrutura de pastas do seu projeto. Inicialmente, use a visão \"Android\" que organiza os arquivos de forma lógica (manifests, java, res)."
        },
        {
          "title": "2. Janela do Editor (Centro)",
          "content": "É aqui que a magia acontece. É onde você irá escrever seu código Kotlin e editar seus arquivos de layout XML. Pode ter vários arquivos abertos em abas."
        },
        {
          "title": "3. Barra de Ferramentas (Topo)",
          "content": "Contém os atalhos mais importantes: Executar (Play), Depurar (Debug), selecionar o dispositivo (emulador ou físico) e sincronizar o projeto (Gradle Sync)."
        },
        {
          "title": "4. Logcat (Fundo)",
          "content": "Sua ferramenta de depuração mais importante. É um console que mostra mensagens do sistema e, mais importante, as mensagens que imprimimos no nosso código para verificar valores e fluxos."
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "Encerramento e Próximos Passos",
      "content": [
        {
          "type": "callout",
          "variant": "task",
          "title": "Tarefa para a próxima aula (TED)",
          "content": [
            {
              "type": "paragraph",
              "text": "Garanta que o ambiente está pronto para os próximos encontros práticos:"
            },
            {
              "type": "list",
              "ordered": true,
              "items": [
                "Instale o Android Studio no seu computador pessoal.",
                "Crie um projeto com o template Empty Views Activity.",
                "Execute o app em um emulador ou dispositivo físico.",
                "Envie uma captura de tela do \"Olá, Mundo!\" funcionando no Moodle."
              ]
            }
          ]
        },
        {
          "type": "callout",
          "variant": "info",
          "title": "Envio oficial no Moodle",
          "content": [
            {
              "type": "paragraph",
              "text": "Acesse Moodle > DDM 2024.1 > Unidade I > TED 02 – Configuração do Ambiente para anexar a evidência."
            },
            {
              "type": "list",
              "ordered": false,
              "items": [
                "Link direto: https://moodle.unichristus.br/mod/assign/view.php?id=98142.",
                "Prazo oficial: 20/06/2024 às 23h59 (horário de Fortaleza).",
                "Formatos aceitos: PNG, JPG ou PDF com até 10 MB (anexe captura e comentários)."
              ]
            }
          ]
        },
        {
          "type": "bibliographyBlock",
          "title": "Bibliografia Recomendada",
          "references": [
            "OLIVEIRA, Diego Bittencourt de et al. Desenvolvimento para Dispositivos Móveis. Porto Alegre: SAGAH, 2019. v. 1.",
            "SIMAS, V. L. et al. Desenvolvimento para Dispositivos Móveis – Volume 2. Grupo A, 2019."
          ]
        }
      ]
    }
  ],
  "metadata": {
    "status": "in-review",
    "updatedAt": "2024-06-18T00:00:00.000Z",
    "owners": ["Prof. Tiago Sombra", "Ana Paula (Governança)"],
    "sources": ["Guia de Laboratório DDM – Ambiente", "docs/governance/moodle-ted-crosswalk.md"],
    "evidences": [
      "Ata: docs/governance/professor-validation-meeting.md",
      "Planilha: docs/governance/post-module-monitoring.md"
    ]
  }
}
