{
  "formatVersion": "md3.lesson.v1",
  "id": "lesson-03",
  "title": "Aula 3: Unidade I – Estrutura Básica de um App Android",
  "summary": "Mapeamento da anatomia de um app Android: Manifest, resources, Gradle e ciclo de build.",
  "objective": "Compreender a organização de um projeto, identificando os arquivos essenciais como AndroidManifest.xml, MainActivity.kt e a pasta res.",
  "objectives": [
    "Compreender como as camadas de um aplicativo Android se relacionam na execução.",
    "Organizar pastas, recursos e dependências em um projeto base."
  ],
  "competencies": ["Modelagem de arquitetura de aplicações móveis nativas"],
  "skills": [
    "Identificar responsabilidades do AndroidManifest.xml e dos módulos Gradle.",
    "Estruturar diretórios de resources para layouts, strings e drawables."
  ],
  "outcomes": [
    "Explica as responsabilidades de Manifest, Gradle e resources para a turma.",
    "Entrega um mapa de pastas documentando o fluxo de build do app exemplo."
  ],
  "prerequisites": ["Ambiente Android Studio instalado e validado na aula anterior."],
  "tags": ["estrutura-app", "activity", "android"],
  "duration": 100,
  "modality": "in-person",
  "resources": [
    {
      "label": "Application Fundamentals",
      "url": "https://developer.android.com/guide/components/fundamentals",
      "type": "article"
    },
    {
      "label": "Manage app resources",
      "url": "https://developer.android.com/guide/topics/resources/providing-resources",
      "type": "guide"
    }
  ],
  "bibliography": ["Google. \"App Fundamentals.\" 2024.", "Google. \"Resource Management.\" 2024."],
  "assessment": {
    "type": "reflection",
    "description": "Mapa mental documentando a estrutura e dependências do app exemplo."
  },
  "content": [
    {
      "type": "flightPlan",
      "title": "Plano de Voo da Aula",
      "items": [
        "Recapitulação: Revisão rápida da criação do projeto \"Olá, Mundo!\".",
        "O Mapa do Tesouro: Por que a estrutura de pastas é o nosso guia.",
        "Análise dos Arquivos Essenciais: Um mergulho profundo no que cada arquivo principal faz.",
        "Atividade Prática: Exploração orientada da estrutura do nosso projeto no Android Studio.",
        "Tarefa (TED): Preparação para a consolidação do conhecimento."
      ]
    },
    {
      "type": "contentBlock",
      "title": "O Mapa do Tesouro: Entendendo a Estrutura do Projeto",
      "content": [
        {
          "type": "paragraph",
          "text": "Imagine que um projeto Android é como uma cidade. Existem diferentes bairros, cada um com uma função específica: um para as \"casas\" (layouts), um para as \"leis\" (manifest), e um para os \"cérebros\" que fazem tudo funcionar (código Kotlin). Antes de começar a construir novos prédios, precisamos aprender a ler o mapa da cidade."
        },
        {
          "type": "paragraph",
          "text": "Nesta aula, vamos aprender a ler este \"mapa\". Compreender a função de cada pasta e arquivo principal é fundamental para nos tornarmos desenvolvedores organizados e eficientes. Ignorar esta etapa é como tentar construir uma casa sem a planta: o resultado será o caos."
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "A Estrutura de Pastas Desmistificada",
      "content": [
        {
          "type": "paragraph",
          "text": "Visualize a árvore do projeto Android em camadas e associe cada pasta às responsabilidades do aplicativo."
        },
        {
          "type": "subBlock",
          "title": "Principais diretórios",
          "items": [
            "app/ — núcleo do módulo principal, reunindo manifests, código Kotlin e recursos.",
            "manifests/ — declara permissões, activities e configurações globais via AndroidManifest.xml.",
            "java/ — abriga os pacotes Kotlin com Activities, ViewModels e classes utilitárias.",
            "res/ — concentra recursos declarativos: drawable para ícones, layout para telas XML, mipmap para variações de ícones e values para strings, temas e cores."
          ]
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "Análise Detalhada dos Arquivos Principais",
      "content": [
        {
          "type": "contentBlock",
          "title": "📄 AndroidManifest.xml",
          "content": [
            {
              "type": "paragraph",
              "text": "Função: É o \"RG\" do seu aplicativo. Este arquivo contém metadados essenciais que o sistema Android precisa para poder executar seu código."
            },
            {
              "type": "paragraph",
              "text": "Analogia: Pense nele como a capa de um livro, que informa o título, o autor e um resumo do que se trata, antes mesmo de você começar a ler."
            },
            {
              "type": "code",
              "language": "xml",
              "code": "<manifest ...>\n    <!-- Futuramente, permissões como a de internet serão declaradas aqui -->\n    <!-- <uses-permission android:name=\"android.permission.INTERNET\" /> -->\n\n    <application\n        android:allowBackup=\"true\"\n        android:icon=\"@mipmap/ic_launcher\"\n        android:label=\"@string/app_name\"\n        android:roundIcon=\"@mipmap/ic_launcher_round\"\n        android:supportsRtl=\"true\"\n        android:theme=\"@style/Theme.OlaMundoAndroid\"&gt;\n        \n        <activity\n            android:name=\".MainActivity\"\n            android:exported=\"true\"&gt;\n            \n                <category android:name=\"android.intent.category.LAUNCHER\" />\n            </intent-filter>\n        </activity>\n        \n    </application>\n</manifest>"
            },
            {
              "type": "callout",
              "variant": "info",
              "title": "Pontos-Chave a Observar",
              "content": [
                {
                  "type": "list",
                  "ordered": false,
                  "items": [
                    "android:icon e android:label: Definem o ícone e o nome do aplicativo que aparecem na tela inicial do celular.",
                    ": Cada tela (Activity) do seu app deve ser declarada aqui. Por enquanto, só temos uma: a MainActivity.",
                    ": Este bloco dentro da activity, com as tags MAIN e LAUNCHER, é especial. Ele diz ao sistema Android: \"Esta é a tela principal, a primeira a ser aberta quando o usuário clicar no ícone do app\".",
                    "Permissões: Futuramente, quando nosso app precisar acessar recursos como a internet, a câmera ou a localização, teremos que solicitar permissões aqui."
                  ]
                },
                {
                  "type": "paragraph",
                  "text": "Para um mergulho mais fundo, consulte a documentação oficial do AndroidManifest.xml (https://developer.android.com/guide/topics/manifest/manifest-intro)."
                }
              ]
            }
          ]
        },
        {
          "type": "contentBlock",
          "title": "📄 MainActivity.kt",
          "content": [
            {
              "type": "paragraph",
              "text": "Função: É o \"cérebro\" da sua tela principal. Este arquivo Kotlin contém a lógica que controla o comportamento da interface."
            },
            {
              "type": "paragraph",
              "text": "Analogia: Se o arquivo de layout é a planta da casa, o arquivo Kotlin é o eletricista e o encanador que fazem as luzes acenderem e a água correr."
            },
            {
              "type": "code",
              "language": "kotlin",
              "code": "package br.com.unichristus.ads.olamundoandroid\n\nimport androidx.appcompat.app.AppCompatActivity\nimport android.os.Bundle\n\nclass MainActivity : AppCompatActivity() {\n    override fun onCreate(savedInstanceState: Bundle?) {\n        super.onCreate(savedInstanceState)\n        setContentView(R.layout.activity_main)\n    }\n}"
            },
            {
              "type": "callout",
              "variant": "info",
              "title": "Analisando o Código",
              "content": [
                {
                  "type": "list",
                  "ordered": false,
                  "items": [
                    "class MainActivity : AppCompatActivity(): Estamos a criar uma classe chamada MainActivity que \"herda\" comportamentos e características de AppCompatActivity, uma classe base do Android que nos dá funcionalidades essenciais.",
                    "override fun onCreate(...): Este é um método do ciclo de vida da Activity. O código dentro dele é executado assim que a tela é criada. É aqui que configuramos o nosso layout.",
                    "setContentView(R.layout.activity_main): Esta é a linha que conecta a lógica (Kotlin) ao visual (XML). Ela diz: \"Para esta tela, use o design definido no arquivo activity_main.xml que está na pasta layout\"."
                  ]
                },
                {
                  "type": "paragraph",
                  "text": "Aprenda mais sobre o ciclo de vida na documentação oficial sobre Activities (https://developer.android.com/guide/components/activities/activity-lifecycle)."
                }
              ]
            }
          ]
        },
        {
          "type": "contentBlock",
          "title": "📁 res (Recursos)",
          "content": [
            {
              "type": "paragraph",
              "text": "Função: Esta é a pasta mais importante para a parte visual e estática do seu app. Ela contém todos os recursos que não são código, como layouts, imagens, textos e cores."
            },
            {
              "type": "paragraph",
              "text": "Boa Prática: A principal vantagem de usar a pasta res é a separação de responsabilidades. Manter o design (XML), textos (strings) e lógica (Kotlin) em arquivos separados torna o projeto muito mais organizado e fácil de manter."
            },
            {
              "type": "list",
              "items": [
                "drawable: Contém imagens (PNG, JPG), vetores (XML) e outros recursos gráficos.",
                "layout: Contém os arquivos XML que definem a estrutura visual de cada tela do seu app. O nosso activity_main.xml vive aqui.",
                "mipmap: Similar ao drawable, mas é usado especificamente para os ícones do aplicativo. O Android usa esta pasta para fornecer a versão do ícone com a melhor qualidade dependendo da densidade da tela do dispositivo.",
                "values: Uma pasta crucial para a organização e boas práticas. - strings.xml: Onde você deve definir TODOS os textos do seu app. Em vez de escrever \"Olá, Mundo!\" diretamente no layout, você cria uma string com um nome (ex: app_name) e a referencia no layout (@string/app_name). Isso facilita a tradução do app para outros idiomas. - colors.xml: Onde você define a paleta de cores do seu app. - themes.xml: Onde você define o estilo visual geral do seu app (cores primárias, fontes, etc.)."
              ]
            }
          ]
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "Atividade Prática: Exploração Guiada",
      "content": [
        {
          "type": "paragraph",
          "text": "Agora, vamos abrir o projeto \"Olá, Mundo!\" no Android Studio e explorar juntos. Tente encontrar as respostas para as seguintes perguntas:"
        },
        {
          "type": "list",
          "items": [
            "Abra o arquivo AndroidManifest.xml. Qual é o nome do tema (theme) do seu aplicativo?",
            "Navegue até a pasta res/values e abra o arquivo strings.xml. Altere o valor da string app_name para \"Meu Primeiro App\". Execute o aplicativo novamente. O que mudou?",
            "Abra o arquivo activity_main.xml. Mude o valor do atributo android:text no TextView de \"Hello World!\" para o seu nome. Execute o aplicativo e veja o resultado.",
            "Abra a MainActivity.kt. Encontre a linha que carrega o layout. Tente comentá-la (adicionando // no início da linha) e execute o app. O que acontece? (Não se esqueça de descomentar depois!)."
          ]
        }
      ]
    },
    {
      "type": "contentBlock",
      "title": "Encerramento e Próximos Passos",
      "content": [
        {
          "type": "callout",
          "variant": "task",
          "title": "Tarefa para a próxima aula (TED)",
          "content": [
            {
              "type": "paragraph",
              "text": "Para consolidar o que aprendemos hoje, a tarefa é criar um mapa mental ou um diagrama que represente a estrutura de um projeto Android."
            },
            {
              "type": "list",
              "ordered": true,
              "items": [
                "Utilize uma ferramenta de sua preferência (como draw.io (https://app.diagrams.net/), um software de mapa mental, ou até mesmo papel e caneta).",
                "Elabore um diagrama que mostre as principais pastas (manifests, java, res) e arquivos (AndroidManifest.xml, MainActivity.kt, activity_main.xml).",
                "Para cada item, escreva uma breve descrição da sua função, com base no que discutimos em aula.",
                "Submeta uma imagem ou PDF do seu diagrama no Moodle."
              ]
            }
          ]
        },
        {
          "type": "bibliographyBlock",
          "title": "Bibliografia Recomendada",
          "references": [
            "OLIVEIRA, Diego Bittencourt de et al. Desenvolvimento para Dispositivos Móveis. Porto Alegre: SAGAH, 2019. v. 1.",
            "URMA, Raoul-Gabriel; WARBURTON, Richard. Desenvolvimento Real de Software: Um Guia de Projetos para Fundamentos em Java. Alta Books, 2021."
          ]
        }
      ]
    }
  ],
  "metadata": {
    "status": "in-review",
    "updatedAt": "2024-05-07T00:00:00.000Z",
    "owners": ["Prof. João Lima"],
    "sources": ["Plano de aula DDM – Estrutura de Apps"]
  }
}
